5BSD/5BSD/usr.sbin/bluetooth/btled/btled.8
.\" Copyright (c) 2026 Kory Heard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 12, 2026
.Dt BTLED 8
.Os
.Sh NAME
.Nm btled
.Nd Bluetooth Low Energy HID daemon
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl a Ar adapter
.Op Fl f Ar bonds_file
.Fl s
.Nm
.Op Fl d
.Op Fl a Ar adapter
.Op Fl f Ar bonds_file
.Ar bdaddr
.Op Ar public | random
.Sh DESCRIPTION
The
.Nm
daemon connects to a Bluetooth Low Energy HID device using the
HID over GATT Profile (HOGP) and injects HID reports into the kernel
via the vhid virtual HID transport.
.Pp
The kernel's native HID drivers
.Pq Xr hkbd 4 , hms 4 , hmt 4
automatically attach to the virtual device and process reports,
providing keyboard, mouse, and touchpad functionality.
.Pp
After establishing the BLE connection and discovering services,
.Nm
enters a
.Xr capsicum 4
sandbox, restricting itself to only the file descriptors required
for operation.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a Ar adapter
Bluetooth adapter to use.
Default is
.Li ubt0 .
.It Fl d
Enable debug output to stderr.
.It Fl f Ar bonds_file
Path to the bond storage file.
Default is
.Pa /var/db/btled/bonds .
.It Fl s
Scan mode.
Scan for nearby BLE devices for 5 seconds and display results, then exit.
.It Ar bdaddr
Bluetooth address of the remote HID device.
.It Ar public | random
Address type of the remote device.
Default is
.Cm public .
.El
.Sh PROTOCOL OVERVIEW
.Nm
implements the following Bluetooth LE protocol stack:
.Bl -bullet
.It
ATT (Attribute Protocol) \(em PDU exchange over L2CAP CID 0x0004
.It
GATT (Generic Attribute Profile) \(em service and characteristic discovery
.It
SMP (Security Manager Protocol) \(em LE Legacy Pairing over L2CAP CID 0x0006
.It
HOGP (HID over GATT Profile) \(em HID Service discovery and report handling
.El
.Sh FILES
.Bl -tag -width "/var/db/btled/bonds" -compact
.It Pa /dev/vhid
Virtual HID control device
.It Pa /dev/vhidN
Virtual HID instance devices
.It Pa /var/db/btled/bonds
Default bond storage
.El
.Sh SEE ALSO
.Xr bluetooth 3 ,
.Xr capsicum 4 ,
.Xr hkbd 4 ,
.Xr hms 4 ,
.Xr hmt 4 ,
.Xr ng_hci 4 ,
.Xr ng_l2cap 4 ,
.Xr ng_ubt 4 ,
.Xr bthidd 8
.Sh STANDARDS
.Rs
.%T Bluetooth Core Specification
.%O Version 6.0
.%Q Bluetooth SIG
.Re
.Rs
.%T HID over GATT Profile (HOGP)
.%O Version 1.0
.%Q Bluetooth SIG
.Re
.Sh HISTORY
The
.Nm
daemon first appeared in
.Fx 16.0 .
.Sh AUTHORS
.An Kory Heard
