5BSD/5BSD/share/man/man7/cmp.7
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 29, 2026
.Dt CMP 7
.Os
.Sh NAME
.Nm cmp
.Nd capability component architecture
.Sh DESCRIPTION
The 5BSD capability component architecture replaces ambient system-call
authority with narrow, versioned services injected by
.Xr serviced 8 .
The public abbreviation is
.Dq Cmp :
.Dq NetworkCmp
and
.Dq FileSystemCmp .
The generic manifest field remains
.Va components
because it describes a collection rather than a product name.
.Ss Bundles and execution
A provider is a service inside a verified
.Pa .cap
bundle, not a loose daemon.
Base providers use these layouts:
.Bl -tag -width "/Capabilities/System/FileSystemCmp.cap"
.It Pa /Capabilities/System/FileSystemCmp.cap
Provides
.Dq org.5bsd.FileSystemCmp.scratch
and implements
.Dq org.5bsd.cmp.filesystem
version
.Dq 1.0.0 .
.It Pa /Capabilities/System/NetworkCmp.cap
Provides
.Dq org.5bsd.NetworkCmp.resolver
and implements
.Dq org.5bsd.cmp.network
version
.Dq 1.0.0 .
.It Pa /Capabilities/System/Netmapd.cap
Provides
.Dq org.5bsd.netmapd
as the privileged netmap mapping bearer.
.El
.Pp
Each bundle contains its executable under
.Pa bin
and its service manifest under
.Pa etc .
.Xr serviced 8
verifies the bundle, resolves provider dependencies, prepares the dynamic
loader and library descriptors, obtains component sessions, enlists their
workers in the service coalition, attenuates the client channels, and only
then executes the consumer.
.Ss Provider model
Consumers declare only stable interface names, separate semantic versions,
resource lifetime, sharing, and interface-defined options.
After loading the complete bundle set,
.Xr serviced 8
selects the unique exact implementation.
The deprecated optional provider field is a bundle-local compatibility pin,
not a normal application dependency.
New manifests omit it; administrators select providers in the separate
.Pa /etc/serviced/policy.ucl
file.
Missing or ambiguous implementations reject the configuration.
Provider declarations also advertise supported lifetimes and sharing modes;
omission means the safe process/exclusive baseline.
Resolution rejects unsupported combinations rather than deferring them to a
runtime bootstrap failure.
Any third party may ship another provider in a
.Pa .cap
bundle if it implements the same interface and bootstrap contract.
.Pp
Provider factories start as ordinary supervised services so dependency
ordering is deterministic.
They are not on-demand services.
The component workers or sessions they create are dynamic: each is created
when a consumer launches and joins that consumer's coalition before exec.
.Pp
A process-lifetime exclusive request creates a provider worker and resource
namespace for one consumer.
The provider replies with a procdesc or nested coalition descriptor.
The worker is enlisted in the consumer coalition before exec and therefore
shares its supervised lifetime.
Shared backing-resource lifetimes require an explicit provider implementation
and never permit one worker to join unrelated consumer coalitions.
.Ss FileSystemCmp
The base
.Nm FileSystemCmp
provider starts with a private, in-memory scratch filesystem.
Clients receive generation-tagged object handles, not vnode descriptors.
Every lookup is relative to an existing directory handle.
The initial provider enforces byte, object, and per-file quotas and rejects
path separators,
.Ql \&. ,
.Ql .. ,
embedded NUL bytes, stale handles, and unsupported sharing scopes.
.Pp
Future persistent or jail-scoped providers use the same public protocol.
Backing namespace descriptors remain solely in the provider address space.
.Ss NetworkCmp
The public NetworkCmp protocol, typed client library, and a DNS-capable base
provider are present.
The initial provider creates a private capability-mode resolver worker for
each consumer and advertises
.Dv NETWORKCMP_FEATURE_DNS .
It performs bounded forward resolution through an attenuated
.Xr cap_net 3
channel and does not read consumer resolver files.
.Pp
The selected full base-stack design is lwIP behind a small 5BSD backend
interface.
lwIP has a BSD-compatible license, supports TCP, UDP, IPv4, and IPv6, and is
small enough to audit and run once per private worker.
It is preferable to VPP for the base provider: VPP is Apache-2.0 licensed,
large, primarily Linux-oriented, and does not make a good in-base
.Fx
dependency.
.Pp
.Nm netmapd
owns the authority to create and register netmap mappings.
.Nm NetworkCmp
workers receive only attenuated bearer descriptors and never open arbitrary
interfaces or
.Pa /dev/netmap .
TCP and UDP control operations use the
.Xr libnetworkcmp 3
protocol.
Bulk stream and datagram data uses two role-separated
.Xr libshmring 3
rings.
QUIC belongs above the UDP API and is not part of the privileged bearer.
.Pp
Until the netmap/lwIP provider ships, the resolver provider returns
.Er EOPNOTSUPP
for TCP, UDP, and ring operations; clients discover this through
.Dv HELLO
rather than assuming features from the interface version.
.Pp
The first policy layer is enforced in
.Nm NetworkCmp .
A non-bypassable minimum policy also remains in
.Nm netmapd ;
later OpenFlow-like matching can replace policy tables atomically without
changing the application ABI.
.Ss Isolation and observability
Workers enter
.Xr capsicum 4
capability mode before serving application requests and apply
.Xr mac_capability 4
capprotect restrictions.
Factories retain only the authority necessary to create workers and acquire
their backing descriptors.
Descriptor transfer, fork, exec, socket creation, tracing, signalling, and
visibility are disabled wherever the worker role permits.
.Pp
Protocol, lifecycle, policy, ring pressure, and rejection paths expose DTrace
USDT probes.
Security decisions are also submitted to OpenBSM using distinct
FileSystemCmp, NetworkCmp, and netmapd audit events.
.Ss Packaging
Public libraries and providers have separate pkgbase packages:
.Dq libfilesystemcmp ,
.Dq libnetworkcmp ,
.Dq libshmring ,
.Dq filesystemcmp ,
and
.Dq netmapd .
The future base network provider will use the separate
.Dq networkcmp
package rather than being folded into the protocol library or netmap bearer.
Their test packages use the conventional
.Dq -tests
suffix.
Provider package payloads retain the
.Pa .cap
directory hierarchy; they do not install duplicate programs in
.Pa /usr/sbin .
.Sh TESTING
Each interface requires ABI-layout and malformed-frame tests, descriptor
cardinality and rights tests, deterministic model/property tests, quota and
resource exhaustion tests, stale-handle tests, concurrency and session
isolation tests, capability-mode syscall-denial tests, verified-bundle and
pkgbase manifest tests, provider restart tests, coalition-lifetime tests, and
end-to-end
.Xr serviced 8
injection tests.
Network providers additionally require TCP/UDP state-machine, checksum,
fragmentation, IPv4/IPv6, ring wraparound/backpressure, packet-policy, and
netmap fault-injection coverage.
.Sh SEE ALSO
.Xr libfilesystemcmp 3 ,
.Xr libnetworkcmp 3 ,
.Xr libservice 3 ,
.Xr libshmring 3 ,
.Xr capsicum 4 ,
.Xr serviced 5 ,
.Xr filesystemcmp 8 ,
.Xr serviced 8
