5BSD/5BSD/share/man/man7/component.7
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd September 25, 2026
.Dt COMPONENT 7
.Os
.Sh NAME
.Nm component
.Nd capability service model for programs managed by switchboard
.Sh DESCRIPTION
Programs managed by
.Xr switchboard 8
use typed libraries instead of ambient discovery or raw IPC protocols.
A capability service is reached in exactly one way: by name, at runtime, over
the lookup channel
.Xr switchboard 8
installs in every unit it launches.
Nothing about the services a program consumes is declared in its manifest.
.Ss Runtime acquisition
A unit manifest
.Pq Xr switchboard 5
describes only how to launch the program; there is no eager grant, no
descriptor block, and no dependency list.
The typed library for a capability
.Pq Xr libnetworkcmp 3 , Xr libcryptocmp 3 , Xr liblogcmp 3 , ...
resolves its provider lazily, at first use, with
.Fn service_open
or
.Fn service_connect
from
.Xr libservice 3 .
.Xr switchboard 8
looks the reverse-domain name up in its naming registry, activates the provider
on demand if it is stopped, and returns a new direct channel session scoped by
the requester's unforgeable channel label.
The consumer does not select a provider binary, protocol version, lifetime,
sharing mode, or options object; the name is the contract.
.Pp
The same model replaces the ambient authority that capability mode removes.
A sandboxed unit obtains, at runtime and by name:
.Bl -tag -width Ds
.It a filesystem path or device
.Xr service_open_isolated 3 ;
.Xr BSDFilesystem 8
opens it under its own per-label policy and returns a rights-limited
descriptor.
.It mutable storage
a dataset derived from the unit's channel label by
.Xr BSDFilesystem 8
.Pq Dq system.Filesystem ,
mounted with
.Xr service_storage_open 3 .
.It a jail
.Xr service_enter_namespace 3 .
.It a kernel module
.Xr service_ensure_extension 3 .
.It a vsock endpoint
.Xr service_vsock_listen 3 .
.El
.Pp
Every grant is derived from the requester's channel label, so one unit can
never name another's resource.
Network access is default-open, with inbound listeners supplied by socket
activation
.Pq Xr service_activation_socket 3 ,
so it too is never declared.
.Pp
Because nothing is pre-granted, an unavailable provider is not a launch
failure: the typed library fails the individual call softly and a later call
retries the lookup.
A consumer treats every acquisition as fallible and never exits because a peer
is down.
.Ss Global services
A provider declares one or more reverse-domain names:
.Bd -literal -offset indent
activation { ipc = ["org.example.control", "org.example.events"]; }
.Ed
.Pp
Any lookup of those names activates the one provider process.
Concurrent lookups of different names coalesce onto that same activation.
The provider uses
.Xr libservice 3
to expose one independent listener per name, and each incoming endpoint is
routed only to its addressed listener.
Registrations remain staged until the process has exposed its complete
.Va activation.ipc
set, entered capability mode, and completed
.Fn service_ready .
The entire endpoint set then becomes visible atomically.
Logging, notification, tracing, and third-party services use this model.
.Ss Failure model
Every accepted or connected session is a fresh direct channel.
Closing one session cannot consume another session's replies.
Peer exit revokes the opposite endpoint, so receive operations fail with
.Er ECONNRESET ,
send operations fail with
.Er EPIPE
or
.Er ECONNRESET ,
and pollers observe end-of-file.
If a provider exits during activation,
.Xr switchboard 8
immediately fails all pending lookups instead of retaining them until a
startup timeout.
The libservice supervisor event descriptor reports permanent loss of
.Xr switchboard 8 ;
listener descriptors also become readable and blocked accepts fail.
Already established peer channels remain independent of the naming
supervisor until a peer closes.
.Pp
Successful transport send means that the kernel accepted a message, not that
the provider committed the operation.
Typed protocols use nonzero channel reply tokens and typed replies to
acknowledge processing.
They may retry only operations whose protocol explicitly defines idempotency.
Exactly-once effects across provider crashes require provider-owned durable
deduplication and are not implied by
.Xr libservice 3 .
.Ss Security invariants
.Bl -bullet
.It
Typed application libraries own discovery and protocol validation.
.It
Global registration is authorized against the exact
.Va activation.ipc
list.
.It
Authenticated client identity comes from switchboard, not client payload.
.It
Every grant is resolved at runtime by name and scoped by the requester's
unforgeable channel label; nothing is minted for a unit at launch beyond its
sealed bootstrap and, for a base broker, the system-gate token its manifest
declares
.Pq see Sx CAPABILITIES No in Xr switchboard 5 .
.It
Delivered sessions are transfer-confined unless the provider declares them
sendable with
.Fn service_provider_expose_sendable .
.It
Security-relevant creation, denial, routing, and teardown paths provide
OpenBSM audit events and DTrace probes.
.El
.Sh SEE ALSO
.Xr libservice 3 ,
.Xr service_storage_open 3 ,
.Xr switchboard 5 ,
.Xr BSDFilesystem 8 ,
.Xr switchboard 8
