5BSD/5BSD/usr.sbin/BSDFilesystem/BSDFilesystem.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd September 8, 2026
.Dt BSDFILESYSTEM 8
.Os
.Sh NAME
.Nm BSDFilesystem
.Nd "[TZFS] storage daemon"
.Sh SYNOPSIS
.Nm
.Op Fl f
.Op Fl c Ar config
.Sh DESCRIPTION
.Nm
is the
.Sy [TZFS]
system daemon that owns the storage plane of the capability system.
It holds the root-pool handle for the pool that backs
.Pa /Capabilities
and auto-provisions the persistent and ephemeral dataset roots.
It is a socket-free capability-plane service: it exposes the well-known name
.Dq Li system.Filesystem
and serves each client on its own
.Xr mac_capability 4
channel.
The discovery
.Em domain
layer resolves
.Dq Li system.Filesystem
only for authorized clients.
.Pp
Obtaining storage is
.Em consumer self-service :
a program asks for a dataset, configuration object, or isolated scratch root at
runtime by calling
.Xr service_storage_open 3 ,
.Xr service_open_config 3 ,
or
.Xr service_open_isolated 3 ,
whose library resolves
.Nm
and drives it.
On request
.Nm
mints a rights-limited TrustedZFS handle
.Pq see Xr trustedzfs 3
scoped to the caller's unforgeable channel label and re-delivers it over that
channel; the consumer then mounts and drives the handle itself.
A claim may ask for the store
.Em mounted
.Pq the sandboxed consumer cannot mount it itself
or for a mounted
.Em read-only view ,
whose directory carries read-only Capsicum rights so every descriptor derived
under it can look up, read, stat and map but never write, create, unlink or
change attributes; this is how a bundle's units read the shared environment
one of them writes.
A store is mounted once and shared by every holder; it stays mounted while
any holder keeps the delivered directory descriptor
.Pq so a restart of Nm never unmounts a store under a running consumer
and is unmounted when the last such descriptor and the last claim are gone;
.Nm
keeps one mount anchor per claim, so a consumer may hold its persistent
store, its cache and shared stores at the same time over its one connection.
.Nm
is never driven by
.Xr switchboard 8
on a unit's behalf, and a unit does not declare storage in its manifest.
.Nm
takes the storage-granting role that
.Xr capsule 8
previously performed inline.
.Pp
Durable storage lives in a per-bundle
.Em container ,
.Pa Data/<bundle>/<unit>/persistent
and
.Pa Data/<bundle>/<unit>/cache
under the persistent root, with
.Pa Data/<bundle>/shared
for the bundle's units and
.Pa Data/Shared/<group>
for a group of bundles that declare it.
.Nm
reconciles those containers against the installed and running bundles
.Pq the install folders and Pa /Capabilities/Run
once at boot and then periodically, destroying the container of a bundle that
is neither installed nor running
.Pq a group container once no member is installed ,
snapshots included.
A container whose snapshot is pinned by a clone outside it is left intact:
that reap fails
.Pq ZFS reports the branch point as Er EEXIST ,
is logged with the reason, and is retried on every later pass until the clone
is gone.
The cadence of the timer passes, which is also the grace window, is the
.Va reclaim_interval
configuration key in seconds
.Pq default 300, accepted range 10 to 86400 ;
an out-of-range value is a configuration error.
The passes and each destroyed container are visible through the
.Ql BSDFilesystem:::reclaim-pass ,
.Ql BSDFilesystem:::reclaim-destroy ,
and
.Ql BSDFilesystem:::reclaim-snapshot
DTrace probes.
.Pp
ZFS is a required subsystem for this system, although the host may still boot
from UFS.
.Nm
comes up in the PID 1 boot chain, after the pool is available, and serves
storage to consumers on demand.
On installer media, before a root pool exists, it remains available in a
degraded isolated-path-only mode so boot services can obtain policy and identity
files; dataset operations fail with
.Er ENXIO
until the configured pool is available.
.Pp
All name-based setup
.Pq configuration, opening the pool, provisioning
happens at startup.
.Nm
then enters capability mode with
.Xr cap_enter 2
and serves every request from its retained capability handles, so a
compromised daemon cannot reach datasets outside
.Pa /Capabilities .
.Pp
The options are:
.Bl -tag -width ".Fl c Ar config"
.It Fl c Ar config
Read configuration from
.Ar config
instead of
.Pa /Capabilities/Config/BSDFilesystem.ucl .
A missing file is not an error; built-in defaults stand.
.It Fl f
Run in the foreground and log to stderr as well as syslog.
.El
.Sh FILES
.Bl -tag -width ".Pa /var/run/BSDFilesystem.ready" -compact
.It Pa /Capabilities/Config/BSDFilesystem.ucl
configuration file
.It Pa /var/run/BSDFilesystem.ready
readiness marker, written once serving begins
.El
.Sh SEE ALSO
.Xr cap_enter 2 ,
.Xr libbsdfilesystem 3 ,
.Xr service_open_config 3 ,
.Xr service_open_isolated 3 ,
.Xr service_storage_open 3 ,
.Xr trustedzfs 3 ,
.Xr mac_capability 4 ,
.Xr tzfs.conf 5 ,
.Xr tzfsctl 8 ,
.Xr capsule 8 ,
.Xr switchboard 8
.Sh AUTHORS
.An Kory Heard
