5BSD/5BSD/usr.sbin/sysextctl/sysextctl.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd September 10, 2026
.Dt SYSEXTCTL 8
.Os
.Sh NAME
.Nm sysextctl
.Nd request kernel extensions through SystemExtension
.Sh SYNOPSIS
.Nm
.Cm list
.Nm
.Cm status Ar module
.Nm
.Cm load Ar module
.Nm
.Cm reload
.Sh DESCRIPTION
.Nm
uses the caller's capability discovery authority to contact
.Dq system.SystemExtension .
It does not invoke
.Xr kldload 2
directly and does not manage the core service.
.Pp
.Cm list
prints the permitted module names.
.Cm status
reports whether an allowed module is loaded.
.Cm load
ensures an allowed module is loaded; an already loaded module is success.
Names must be single filename components, without paths.
The broker resolves them through the kernel module path.
Install a rebuilt module there before requesting a load.
.Pp
The broker enforces its allow-list regardless of the caller's UID.
There is no unload command.
.Cm reload
rereads the broker's configured policy file and requires ADMIN rights on
the service channel, not merely UID 0 or permission to connect.
It does not stop or manage the core service.
An invalid or missing file leaves the active policy unchanged.
Editing the file alone does not change the running policy.
.Pp
To change policy, prepare a complete replacement file owned by root and
not writable by group or others, then atomically rename it over the policy
file and run
.Nm Cm reload .
Use
.Nm Cm list
to verify the active allow-list.
The list replaces rather than augments the defaults.
Removing a name prevents future requests; it does not unload the module
or cancel an already admitted request.
.Sh FILES
.Bl -tag -width indent
.It Pa /Capabilities/Config/sysextd.ucl
Broker policy; the allowed_extensions array replaces the built-in list.
.El
.Sh EXIT STATUS
Zero indicates success.
.Cm status
returns 1 when the permitted module is not loaded.
Other failures use
.Xr sysexits 3
codes.
.Sh SEE ALSO
.Xr kldload 8 ,
.Xr sysextd 8
