5BSD/5BSD/usr.sbin/localnetwork/localnetwork.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt LOCALNETWORK 8
.Os
.Sh NAME
.Nm localnetwork
.Nd capability-mode kernel NetworkCmp provider
.Sh DESCRIPTION
.Nm
is the initial base-system provider for
.Dq org.5bsd.network
version
.Dq 1.0.0 .
It is installed in
.Pa /Capabilities/System/LocalNetwork.cap
and launched only by
.Xr serviced 8 .
.Pp
The base provider implements bounded DNS and TCP/UDP socket and data operations
using the kernel network stack through an attenuated
.Xr cap_net 3
channel.
Each consumer receives a private capability-mode worker enlisted in its
coalition.
The worker cannot fork, execute, or receive unrelated descriptors.
The Casper factory channel never crosses a fork; each attenuated resolver
channel survives only its worker fork and is non-transferable and locked
against exec propagation.
Kernel socket descriptors and the Casper channel never cross into the
consumer.
Connected TCP streams and UDP sockets use bounded inline messages as the
baseline data path.
Every provider socket operation, including receive, is nonblocking.
The typed client library implements receive deadlines with bounded
nonblocking requests so one wait cannot stall unrelated session RPCs.
Datagram truncation and stream EOF are reported explicitly.
The version 1 protocol deliberately exposes only this bounded inline path.
Any future bulk transport will use a separately negotiated protocol version
rather than publishing an unimplemented attachment ABI.
.Pp
Resolver requests cap host and service lengths, flags, address families, and
result counts.
They never read resolver configuration from the consumer filesystem.
Resolution runs on a dedicated thread with a separately attenuated
.Xr cap_net 3
channel, so a slow resolver cannot stop socket operations on the session.
At most one resolution is active per private session; an overlapping request
fails with
.Er EBUSY .
If a client abandons or times out a request, the channel reply token prevents
the eventual late result from being mistaken for another reply.
The provider also enforces a 30-second resolver deadline.
Because the resolver interface does not provide safe in-thread cancellation,
exceeding that deadline terminates only the consumer's private NetworkCmp
worker; the typed client observes peer death and may recover according to its
component lifecycle policy.
This fail-closed boundary prevents a stuck resolver from retaining resources
or making every later resolve return
.Er EBUSY
indefinitely.
.Pp
The component bootstrap carries no manifest-selected policy object.
The provider-owned initial policy enables IPv4, IPv6, outbound connections,
and at most 16 resolver results and 64 sockets per session.
Bind, listen, and accept authority is denied.
Socket options are restricted to bounded buffer sizes and an explicit
allow-list including
.Dv SO_KEEPALIVE ,
.Dv SO_REUSEADDR ,
.Dv TCP_NODELAY ,
and
.Dv IPV6_V6ONLY .
.Sh SECURITY
Session creation and resolver policy decisions are recorded through OpenBSM.
Session, resolution, and rejection paths expose DTrace probes through the
.Dq localnetwork_provider
provider.
.Sh SEE ALSO
.Xr cap_net 3 ,
.Xr libnetworkcmp 3 ,
.Xr serviced 8
