5BSD/5BSD/usr.sbin/localnetwork/localnetwork.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt LOCALNETWORK 8
.Os
.Sh NAME
.Nm localnetwork
.Nd capability-mode kernel NetworkCmp provider
.Sh DESCRIPTION
.Nm
is the initial base-system provider for
.Dq system.Network
version
.Dq 1.0.0 .
It is installed in
.Pa /Capabilities/System/Network.cap
and launched only by
.Xr serviced 8 .
.Pp
The base provider is a connection broker.
It implements bounded DNS and TCP/UDP
.Em connect
operations using the kernel network stack through an attenuated
.Xr cap_net 3
channel, and returns the resulting connected socket to the consumer rather
than proxying its data.
Each consumer receives a private capability-mode worker enlisted in its
coalition.
The worker cannot fork, execute, or receive unrelated descriptors.
The Casper factory channel never crosses a fork; each attenuated resolver
channel survives only its worker fork and is non-transferable and locked
against exec propagation.
The Casper channel never crosses into the consumer.
.Pp
On a
.Em connect
or
.Em udp
request the worker creates a socket, connects it under the session policy, and
sends the connected descriptor back over the session channel with
.Dv SCM_RIGHTS .
Before delivery the descriptor is limited with
.Xr cap_rights_limit 2
to only the data-path rights
.Pq read, write, event, shutdown, get/set socket option, fcntl, fstat, and ioctl ,
with
.Xr cap_ioctls_limit 2
restricting ioctls to
.Dv FIONREAD , FIONBIO ,
and
.Dv FIOASYNC ,
.Xr cap_fcntls_limit 2
restricting fcntl to
.Dv F_GETFL
and
.Dv F_SETFL ,
and its transfer state latched so it can be delivered exactly once.
The delivered descriptor cannot bind, connect, listen, accept, or peel off.
The consumer owns all subsequent I/O on it.
The provider retains no socket state after delivery.
The version 1 protocol exposes only DNS, connect, and udp; protocol space for
future userspace networking is reserved but implemented as none, and any such
behavior requires a separately negotiated protocol version.
.Pp
Resolver requests cap host and service lengths, flags, address families, and
result counts.
They never read resolver configuration from the consumer filesystem.
Resolution runs on a dedicated thread with a separately attenuated
.Xr cap_net 3
channel, so a slow resolver cannot stop socket operations on the session.
At most one resolution is active per private session; an overlapping request
fails with
.Er EBUSY .
If a client abandons or times out a request, the channel reply token prevents
the eventual late result from being mistaken for another reply.
The provider also enforces a 30-second resolver deadline.
Because the resolver interface does not provide safe in-thread cancellation,
exceeding that deadline terminates only the consumer's private NetworkCmp
worker; the typed client observes peer death and may recover according to its
component lifecycle policy.
This fail-closed boundary prevents a stuck resolver from retaining resources
or making every later resolve return
.Er EBUSY
indefinitely.
.Pp
The component bootstrap carries no client-selected policy object.
The session policy is derived once at session creation from the requesting
unit's manifest and the administrative ceiling and is immutable thereafter;
the client never supplies policy on a request.
The provider-owned initial policy enables IPv4, IPv6, TCP connect, UDP connect,
and at most 16 resolver results per session.
Listener authority is not part of the version 1 client API.
Socket options are not restricted by the broker: the consumer sets them itself
on the delivered descriptor within the delegated
.Dv CAP_SETSOCKOPT
right.
.Sh SECURITY
Session creation and resolver policy decisions are recorded through OpenBSM.
Session, resolution, and rejection paths expose DTrace probes through the
.Dq localnetwork_provider
provider.
.Sh SEE ALSO
.Xr cap_net 3 ,
.Xr libnetworkcmp 3 ,
.Xr serviced 8
