5BSD/5BSD/usr.sbin/BSDLog/BSDLog.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd September 8, 2026
.Dt BSDLOG 8
.Os
.Sh NAME
.Nm BSDLog
.Nd capability-mode structured logging component
.Sh DESCRIPTION
.Nm
is the base provider for
.Dq system.Log
version
.Dq 5.0.0 .
It runs only from
.Pa /Capabilities/System/Log.cap .
Each global service connection creates an isolated worker and bounded
single-producer record ring.
The client sends an edge-coalesced wakeup when a shared ring changes from
empty to nonempty, and the worker drains the burst through
.Xr kqueue 2 .
A bounded periodic timer is retained only as a lost-wakeup fallback, so record
publication requires neither polling latency nor a control message per record.
An explicit flush drains all records published before the request, drains the
worker's bounded internal storage ring, and synchronizes the LogCmp store
before replying.
The worker runs in capability mode and is itself the plane's log authority:
validated records are persisted only to the LogCmp store and are never mirrored
to a separate log sink.
On installer or live media where the root ZFS pool does not yet exist,
.Nm
uses its private switchboard runtime container as an explicitly ephemeral store
and logs a warning.
Installed systems use the persistent, label-scoped
.Dq state
claim supplied by
.Xr bsdfilesystem 8 .
Durable records cross from the worker to the storage manager
through a second single-producer shared-memory ring; its socket carries only
edge notifications, lifecycle control, and explicit flush barriers.
The storage manager drains active rings in bounded round-robin batches, so a
continuously active producer cannot prevent other sessions from making
progress.
.Pp
Retained-record queries are served from the private store and are always
restricted to the authenticated switchboard client label associated with the
session.
The protocol has no identity override flag and no fallback to an all-system
view.
A query may additionally narrow the result within that own-label scope by
subsystem and by category, each matched either as an exact string or as a
substring, and by an event-timestamp range with a
.Va from_ns
lower bound and a
.Va to_ns
upper bound in nanoseconds; a zero bound is unset, and an inverted range
.Pq Va from_ns No greater than a nonzero Va to_ns
is rejected.
These filters only further restrict the label-scoped result; they can never
widen it beyond the session's own records.
Long scans are divided into bounded record, byte, and segment slices so one
query cannot monopolize the storage-manager event loop.
The typed client hides those internal continuations while preserving one
overall operation deadline.
.Pp
The provider adds the trusted service label, component instance, provider
sequence, realtime receive timestamp, and monotonic receive timestamp at the
sink.
Clients supply a subsystem, category, normalized severity, privacy class,
message text, an optional event timestamp, and bounded typed non-reserved
attributes.
The provider overwrites both receive clocks before any record reaches retained
storage, so a client cannot forge ingestion ordering.
Private fields are retained as the literal
.Dq <private> .
Private-hash fields are retained as a 128-bit hexadecimal digest keyed with a
random 256-bit storage-manager epoch key.
The key is never written to the store and is erased when the manager exits, so
equal values can be correlated only within one running storage epoch and
cannot be compared across restarts.
Neither private representation exposes its source value through a retained
query.
Ring exhaustion is explicit and observable through total and per-severity
drop counters; it never overwrites unread records.
Each session also has an administrator-configured fixed-window ingestion
budget.  Records below the configured severity threshold and records beyond
the session budget advance sequence accounting but do not reach the
private store.  Separate filtered and rate-limited counters make
these deliberate losses distinguishable from malformed records and
client-ring exhaustion.
.Pp
At startup the provider reads
.Pa /etc/BSDLog.conf .
The file must be a regular, non-symlink file owned by root or the daemon's
effective user, must not be group- or world-writable, and is limited to 64 KiB.
The strict UCL configuration accepts only
.Va ring_size ,
a power of two from 64 KiB through 64 MiB, and
.Va fallback_drain_ms ,
from 1 through 1000 milliseconds.  The default one-second scan is a
lost-wakeup safety net; normal ingestion is edge-woken and hot rings are
rescheduled through a bounded fair-work queue,
.Va segment_size ,
from 64 KiB through 1 GiB, and
.Va max_segments ,
from 1 through 1024 completed segments,
.Va minimum_severity ,
from 1 through 24, and the paired
.Va rate_limit_interval_ms
and
.Va rate_limit_burst
values.
The rate interval is at most one hour and the burst at most one million
records.  Both rate values may be zero to disable limiting; setting only one
to zero is invalid.
The default retains 64 completed segments plus the active segment.
The optional
.Va retention_max_age ,
a count of seconds up to one hundred years, and
.Va retention_max_bytes ,
a byte budget for the whole store, bound how long and how large the retained
log may grow.
Either value may be zero, which disables that dimension and keeps all
segments; both default to zero, so retention pruning is off unless configured.
Unknown keys, incorrect types, and values outside those bounds prevent
startup.
.Pp
When retention is enabled the store enforces the policy by pruning completed
segments oldest-first: first any completed segment whose age exceeds
.Va retention_max_age ,
then, if the whole store
.Pq the active segment included in the byte accounting
still exceeds
.Va retention_max_bytes ,
successive oldest completed segments until it no longer does.
Only whole completed
.Pa segment-*.log
files are candidates; the active segment is never pruned and no partial record
is ever dropped, since a pruned segment's records were by definition already
outside policy.
.Pp
Segment rotation synchronizes both file contents and directory namespace
changes.  On restart, the store reconstructs the next generation from
completed segment names if a crash occurred after rotating the old active
segment or after creating an empty successor.  Incomplete trailing records in
the active segment are truncated to the last checksummed boundary; corruption
inside a complete record fails closed.
.Sh SECURITY
Workers cannot open files, sockets, or other sinks.
They cannot fork or execute, and ring consumer descriptors cannot be
transferred to the client.
The global provider remains outside consumer coalitions.
Session creation and rejected records are audited through OpenBSM.
Lifecycle, accepted-record, drop, flush, persistence, rotation, corruption,
and scoped-query paths expose DTrace probes.
.Sh DTRACE PROBES
The
.Dq bsdlog_provider
provider exports
.Sy session-start ,
.Sy record-write ,
.Sy record-drop ,
.Sy wakeup-receive ,
.Sy batch-drain ,
.Sy flush-complete ,
.Sy storage-persist ,
.Sy storage-rotate ,
.Sy storage-corruption ,
.Sy query-complete ,
.Sy query-filter ,
and
.Sy retention-prune .
The
.Sy query-filter
probe reports, per scoped query, the number of records scanned and the number
that matched the subsystem, category, and time-range filters.
The
.Sy retention-prune
probe fires once per pruned segment with its generation and the record and byte
counts reclaimed; its reason argument is positive for a byte-budget prune and
negative for an age prune.
Result and error arguments are zero on success or an
.Xr errno 2
value on failure.
Record payloads and private field values are never probe arguments.
.Sh ENVIRONMENT
.Bl -tag -width BSDLOG_RECLAIM_INTERVAL
.It Ev BSDLOG_RECLAIM_INTERVAL
Seconds between the timer passes of the owner reconcile
.Pq which seal the records of bundles no longer installed or running ,
and therefore the grace window an uninstalled bundle is given before its
records are sealed.
Default 30; values outside 10 to 86400 are ignored.
Set through the unit manifest's
.Va environment .
.El
.Sh SEE ALSO
.Xr liblogcmp 3 ,
.Xr libshmring 3 ,
.Xr capsicum 4 ,
.Xr switchboard 8
