5BSD/5BSD/usr.sbin/sysctlcmpctl/sysctlcmpctl.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd September 5, 2026
.Dt SYSCTLCMPCTL 8
.Os
.Sh NAME
.Nm sysctlcmpctl
.Nd command-line client for the system.Sysctl capability
.Sh SYNOPSIS
.Nm
.Cm get Ar name
.Nm
.Cm set Ar name Ar value
.Nm
.Cm fmt Ar name
.Nm
.Cm descr Ar name
.Nm
.Cm list Op Ar start-name
.Sh DESCRIPTION
.Nm
reads and writes kernel
.Xr sysctl 3
variables through the
.Dq system.Sysctl
capability provided by
.Xr bsdsysctl 8 ,
subject to the caller's per-label policy.
.Cm get
prints the value of
.Ar name ;
.Cm set
assigns the string
.Ar value
to
.Ar name .
.Cm fmt
prints the type/format string of
.Ar name ,
and
.Cm descr
prints its description.
.Cm list
enumerates variable names in order, beginning at
.Ar start-name
or, when it is omitted, at the root.
Every subcommand is subject to the caller's per-label read or write policy.
.Sh SEE ALSO
.Xr sysctl 8 ,
.Xr libsysctlcmp 3 ,
.Xr bsdsysctl 8
