5BSD/5BSD/usr.sbin/switchboardctl/switchboardctl.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd September 12, 2026
.Dt SWITCHBOARDCTL 8
.Os
.Sh NAME
.Nm switchboardctl
.Nd control and inspect switchboard
.Sh SYNOPSIS
.Nm
.Cm status | services | reload | bundles
.Nm
.Cm start | stop | restart Ar label
.Nm
.Cm install Ar path.cap
.Nm
.Cm verify Ar path.cap ...
.Nm
.Cm deps Ar program
.Nm
.Cm graph Op Fl -text | Fl -dot | Fl -json
.Op Fl -lint
.Op Fl -root Ar dir
.Sh DESCRIPTION
.Nm
is the administrative client for
.Xr switchboard 8 .
.Sh COMMANDS
.Bl -tag -width "verify path.cap ..."
.It Cm status
Show daemon and service state.
.It Cm services
List loaded service runtimes.
.It Cm reload
Transactionally rescan bundles, validate the dependency graph, and apply
additions, changes, and removals.
Requires the
.Dq Li system.switchboard.admin
anointment on the caller's session
.Pq Xr switchboard 5 , Xr anoint 1 ,
not root.
.It Cm start Ar label
Start a loaded stopped unit immediately and reset its restart backoff.
Requires the
.Dq Li system.switchboard.admin
anointment on the caller's session
.Pq Xr switchboard 5 , Xr anoint 1 ,
not root.
.It Cm stop Ar label
Gracefully stop a runtime, escalating after its configured timeout.
Requires the
.Dq Li system.switchboard.admin
anointment on the caller's session
.Pq Xr switchboard 5 , Xr anoint 1 ,
not root.
.It Cm restart Ar label
Stop the unit and then start it again, driving the same control operations as
.Cm stop
and
.Cm start .
A unit that is already stopped is simply started.
Requires the
.Dq Li system.switchboard.admin
anointment on the caller's session
.Pq Xr switchboard 5 , Xr anoint 1 ,
not root.
.It Cm install Ar path.cap
Verify and copy a bundle into
.Pa /Capabilities/System
as a root-owned policy tree; the bundle is installed once its directory is in
place.
.Ev SWITCHBOARD_LIFECYCLE_ROOT
selects an offline root and defaults to
.Pa / .
Requires root.
.It Cm verify Ar path.cap ...
Strictly validate bundle structure, manifests, executables, unique provided
names, and the combined dependency graph.
The printed effective view shows activation and local descriptors.
.It Cm deps Ar program
Inspect an ELF program and print an advisory
.Va descriptors
object for linked FileSystemCmp, NetworkCmp, and CryptoCmp clients.
Global service libraries require no manifest declaration and are ignored.
.It Cm bundles
List bundles installed in
.Pa /Capabilities/System
and
.Pa /Capabilities .
.It Cm graph Oo Fl -text | Fl -dot | Fl -json Oc Oo Fl -lint Oc Oo Fl -root Ar dir Oc
Draw the IPC anointment reach graph from the bundle registry on disk.
No running
.Xr switchboard 8
is consulted.
The nodes are every unit in
.Pa /Capabilities/System
and
.Pa /Capabilities
.Po or the single directory named by
.Fl -root
.Pc ,
each endpoint those units publish, and two session classes:
.Li session.default ,
the set
.Pa /Capabilities/Config/principal-policy.ucl
grants uid 65534 with no groups, and
.Li session.admin ,
the set it grants uid 0.
An absent or malformed policy applies the historical rule
.Po root holds every name, everyone else none
.Pc
and is noted on standard error.
.Pp
An edge runs from a consumer to an endpoint when the endpoint is open
.Po no
.Va requires
.Pc
or the consumer's anointments cover every name the endpoint requires.
A unit never reaches its own endpoints.
For open endpoints
.Li session.default
additionally follows the provider's
.Va resolvable_by :
it sees only providers that opted into user resolution, while
.Li session.admin
sees every name.
A gated endpoint is reachable by whoever covers it regardless of
.Va resolvable_by .
Units are shown as
.Ar bundle-id Ns / Ns Ar unit .
.Pp
.Fl -text ,
the default, prints one line per edge,
.Dq Li CONSUMER -> ENDPOINT [open]
or
.Dq Li CONSUMER -> ENDPOINT [via a.b,c.d] ,
followed by a summary line.
.Fl -dot
prints a Graphviz digraph: units as boxes, sessions as ellipses, endpoints
as nodes labelled with their name and requires, providers joined to their
endpoints by dotted lines, and anointed edges labelled with the names.
.Fl -json
prints an object with the keys
.Li units , sessions , endpoints , edges
and
.Li warnings ,
in that order, sorted so that identical registries print identical output.
.Pp
.Fl -lint
reports two kinds of mistake, which the JSON form always includes under
.Li warnings :
an endpoint requiring a name that no unit declares and no principal is
granted
.Pq unreachable ,
and a unit declaring, or a principal being granted, a name that no endpoint
requires
.Pq dead declaration .
A session's
.Ql *
grant is not a declaration.
With
.Fl -lint
the exit status is 2 when any warning was reported; text mode prints the
warnings before the summary and DOT mode prints them on standard error.
Without
.Fl -lint
the exit status is 0 whenever the registry parsed.
.Pp
The environment variables
.Ev SWITCHBOARD_BUNDLE_DIR_SYSTEM ,
.Ev SWITCHBOARD_BUNDLE_DIR_USER
and
.Ev SWITCHBOARD_PRINCIPAL_POLICY
override the registry directories and the policy file.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
.Bd -literal -offset indent
# switchboardctl verify /path/to/MyApp.cap
# switchboardctl install /path/to/MyApp.cap
# switchboardctl reload
# switchboardctl graph --lint
# switchboardctl graph --dot | dot -Tsvg > anointments.svg
.Ed
.Sh SEE ALSO
.Xr mac_capability 4 ,
.Xr switchboard 5 ,
.Xr switchboard 8
