5BSD/5BSD/usr.sbin/tzfs-flavors/tzfs-flavors.7
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd August 15, 2026
.Dt TZFS-FLAVORS 7
.Os
.Sh NAME
.Nm tzfs-flavors
.Nd OS-image flavor catalog for tzfsd
.Sh DESCRIPTION
.Xr tzfsd 8
is a storage and capability broker: it hands out ZFS datasets as
capability descriptors and, on request, provisions a new dataset as a
copy-on-write clone of a named
.Em template
instead of a blank one.
The broker deliberately knows nothing about any particular operating system.
.Pp
.Nm
is the separately packaged catalog that contributes
.Em OS-image
flavors \(em such as
.Ql linux
and
.Ql freebsd
\(em to the broker as data, so that curating and shipping a distribution
rootfs stays decoupled from the broker itself and can be versioned or removed
independently.
The catalog consists of two parts:
.Bl -tag -width Ds
.It Pa /Capabilities/Config/tzfsd.d/flavors.ucl
A configuration drop-in that declares each flavor and the baked ZFS
send-stream artifact it is built from.
.Xr tzfsd 8
reads every
.Pa *.ucl
fragment in
.Pa /Capabilities/Config/tzfsd.d/
after its main configuration, so the catalog contributes flavors without the
broker's own defaults naming any distribution.
.It The artifacts
Compressed ZFS send streams under
.Pa /usr/share/tzfs/
(for example
.Pa rocky9.zfs.zst
and
.Pa freebsd.zfs.zst )
produced by the tools below.
On first start
.Xr tzfsd 8
receives each artifact into its templates and thereafter clones it,
copy-on-write, per request.
.El
.Pp
A flavor whose artifact is absent is simply not offered; installing the
catalog before the artifacts are produced is harmless.
.Sh ARTIFACT PRODUCTION
The artifacts are produced at build or administration time \(em they require
network access and a live ZFS pool \(em by:
.Bl -tag -width Ds
.It Xr tzfs-flavor-linux 8
Fetches the official Rocky Linux minimal container base rootfs and writes
.Pa /usr/share/tzfs/rocky9.zfs.zst .
The caller must pin both the downloaded archive SHA-256 and the OCI layer
SHA-256; the tool refuses unverified or ambiguous image content.
.It Xr tzfs-flavor-freebsd 8
Builds the
.Ql freebsd
artifact from a base userland tree (an installed
.Va DESTDIR
or an extracted
.Pa base.txz )
and writes
.Pa /usr/share/tzfs/freebsd.zfs.zst .
.El
.Pp
Both are thin wrappers around
.Xr tzfs-mkflavor 8 ,
which does the actual dataset population and
.Nm zfs Cm send .
An output path must match the
.Va source
its flavor declares in
.Pa flavors.ucl .
.Sh FILES
.Bl -tag -width "/Capabilities/Config/tzfsd.d/flavors.ucl" -compact
.It Pa /Capabilities/Config/tzfsd.d/flavors.ucl
flavor declarations read by
.Xr tzfsd 8
.It Pa /usr/share/tzfs/
baked flavor artifacts
.It Pa /usr/libexec/tzfs-flavor-linux
.It Pa /usr/libexec/tzfs-flavor-freebsd
artifact producers
.El
.Sh SEE ALSO
.Xr tzfs.conf 5 ,
.Xr tzfs-mkflavor 8 ,
.Xr tzfsctl 8 ,
.Xr tzfsd 8
.Sh AUTHORS
.An Kory Heard
