5BSD/5BSD/usr.sbin/kldmgrd/kldmgrd.8
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd July 31, 2026
.Dt KLDMGRD 8
.Os
.Sh NAME
.Nm kldmgrd
.Nd kernel module loading manager
.Sh DESCRIPTION
.Nm
is a
.Xr serviced 8
system service that brokers controlled kernel module loading,
unloading, and listing.
It registers the service name
.Dq org.5bsd.system.kldmgr
with
.Xr serviced 8 .
.Pp
Applications use the typed
.Xr libkldmgr 3
API; it discovers the service, creates an independent session, and validates
the versioned protocol and every list entry.
The
.Xr serviced 8
naming layer authenticates the provider name but does not authorize
callers.
Therefore
.Nm
authorizes each client by service label before serving requests.
.Pp
Allowed client labels are read from
.Pa /etc/kldmgrd.allow .
The file contains one service label per line.
Blank lines and comments beginning with
.Ql #
are ignored.
Wildcard entries are rejected; privileged authority must always be granted
to explicit authenticated service labels.
The file must be a regular file owned by the daemon's effective user, must not
be group- or world-writable, is opened without following symbolic links, and
must not exceed 64 KiB or contain embedded NUL bytes.
If the file is missing, all requests are denied.
An entry grants that label all three protocol operations and permits loading
or unloading any name accepted by the protocol grammar; it is not a
per-module allow list.
.Pp
At startup,
.Xr libservice 3
validates and activates the bundle's inherited system token before applying
the daemon's self-selected capprotect shield, registering its name, or
reporting readiness.
Token activation failure is fatal.
.Nm
intentionally runs as root because the system capability gate is an
additional authorization check and does not replace the kernel's traditional
module-loading or audit-submission privilege checks.
After initialization it is in capability mode.
Each client worker prohibits fork, IPC, incoming descriptor transfer, exec,
and new sockets.
The supervisor admits at most 256 concurrent workers, retains their process
descriptors, and observes exit through
.Dv EVFILT_PROCDESC .
Managed shutdown stops admission, gives workers five seconds to exit after
.Dv SIGTERM ,
then kills stragglers and reaps every worker before acknowledging quiesce to
.Xr serviced 8 .
.Sh PROTOCOL
The protocol is owned by
.Xr libkldmgr 3
and uses an exact typed header with magic, version, opcode, flags, and
negative errno status.
.Bl -tag -width KLDMGR_OP_UNLOAD
.It Dv KLDMGR_OP_LOAD Pq 1
Load the kernel module named in
.Va name .
The name must be NUL-terminated and contain only letters, digits,
.Ql _ ,
.Ql - ,
or
.Ql \&. .
.It Dv KLDMGR_OP_UNLOAD Pq 2
Unload the kernel module named in
.Va name .
.It Dv KLDMGR_OP_LIST Pq 3
List up to
.Dv KLDMGR_LIST_MAX
loaded kernel modules in kernel enumeration order.
Enumeration and status failures are returned to the caller rather than
reported as a successful partial list.
.El
.Pp
Malformed frames terminate the session.
Policy and backend failures are returned as negative errno status values.
.Sh OBSERVABILITY
The
.Dq kldmgrd
DTrace provider exposes
.Fn session-start ,
.Fn session-end ,
.Fn request ,
and
.Fn malformed
probes.
The request and session-end probes report zero for success or an
.Xr errno 2
value for failure.
Module load and unload attempts, including policy denials and backend
failures, generate
.Dv AUE_MODLOAD
or
.Dv AUE_MODUNLOAD
OpenBSM audit records containing the authenticated client service label.
.Sh BUNDLE
.Nm
is installed as a system
.Pa .cap
bundle:
.Bd -literal -offset indent
/Capabilities/System/Kldmgr.cap/
  bin/kldmgrd
  etc/kldmgrd.ucl
.Ed
.Pp
The bundle manifest declares:
.Bd -literal -offset indent
bundle_id = "org.5bsd.system.kldmgr";
program = "kldmgrd";
provides = ["org.5bsd.system.kldmgr"];
user = "root";
capabilities {
    system = ["kldload", "kldunload", "kldstat"];
}
.Ed
.Sh FILES
.Bl -tag -width "/etc/kldmgrd.allow"
.It Pa /etc/kldmgrd.allow
Client service-label allow list.
.El
.Sh SEE ALSO
.Xr kldload 2 ,
.Xr kldstat 2 ,
.Xr kldunload 2 ,
.Xr libchannel 3 ,
.Xr libkldmgr 3 ,
.Xr libservice 3 ,
.Xr kldmgrctl 8 ,
.Xr serviced 8
