5BSD/5BSD/usr.sbin/kldmgrd/kldmgrd.8
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd July 19, 2026
.Dt KLDMGRD 8
.Os
.Sh NAME
.Nm kldmgrd
.Nd kernel module loading manager
.Sh DESCRIPTION
.Nm
is a
.Xr serviced 8
system service that brokers controlled kernel module loading,
unloading, and listing.
It registers the service name
.Dq org.5bsd.system.kldmgr
with
.Xr serviced 8 .
.Pp
Clients connect with
.Fn service_lookup
from
.Xr libservice 3 .
The
.Xr serviced 8
naming layer authenticates the provider name but does not authorize
callers.
Therefore
.Nm
authorizes each client by service label before serving requests.
.Pp
Allowed client labels are read from
.Pa /etc/kldmgrd.allow .
The file contains one service label per line.
Blank lines and comments beginning with
.Ql #
are ignored.
The special label
.Ql *
allows all clients and should only be used on systems where the
service name is otherwise protected.
If the file is missing, all requests are denied.
.Pp
At startup,
.Xr libcapability 3
validates and activates the bundle's inherited system token before applying
the daemon's self-selected capprotect shield, registering its name, or
reporting readiness.
Token activation failure is fatal.
.Sh PROTOCOL
Requests use
.Vt struct kldmgr_req .
.Bl -tag -width KLDMGR_OP_UNLOAD
.It Dv KLDMGR_OP_LOAD Pq 1
Load the kernel module named in
.Va name .
The name must be NUL-terminated and contain only letters, digits,
.Ql _ ,
.Ql - ,
or
.Ql \&. .
.It Dv KLDMGR_OP_UNLOAD Pq 2
Unload the kernel module named in
.Va name .
.It Dv KLDMGR_OP_LIST Pq 3
List loaded kernel modules.
.El
.Pp
Malformed requests receive
.Dv KLDMGR_STATUS_ERR .
Denied requests receive
.Dv KLDMGR_STATUS_PERM .
.Sh BUNDLE
.Nm
is installed as a system
.Pa .cap
bundle:
.Bd -literal -offset indent
/Capabilities/System/Kldmgr.cap/
  bin/kldmgrd
  etc/kldmgrd.ucl
.Ed
.Pp
The bundle manifest declares:
.Bd -literal -offset indent
bundle_id = "org.5bsd.system.kldmgr";
program = "kldmgrd";
provides = ["org.5bsd.system.kldmgr"];
capabilities {
    system = ["kldload", "kldunload", "kldstat"];
}
.Ed
.Sh FILES
.Bl -tag -width "/etc/kldmgrd.allow"
.It Pa /etc/kldmgrd.allow
Client service-label allow list.
.El
.Sh SEE ALSO
.Xr kldload 2 ,
.Xr kldunload 2 ,
.Xr kldstat 2 ,
.Xr libcapability 3 ,
.Xr libservice 3 ,
.Xr serviced 8
