5BSD/5BSD/usr.sbin/rebootd/rebootd.8
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd July 30, 2026
.Dt REBOOTD 8
.Os
.Sh NAME
.Nm rebootd
.Nd reboot and shutdown manager
.Sh DESCRIPTION
.Nm
is a
.Xr serviced 8
system service that brokers controlled reboot and shutdown requests.
It registers the service name
.Dq org.5bsd.system.reboot
with
.Xr serviced 8 .
.Pp
Clients connect with
.Fn service_lookup
from
.Xr libservice 3 .
The
.Xr serviced 8
naming layer authenticates the provider name but does not authorize
callers.
Therefore
.Nm
authorizes mutating requests by service label.
.Pp
Allowed client labels are read from
.Pa /etc/rebootd.allow .
The file contains one service label per line.
Blank lines and comments beginning with
.Ql #
are ignored.
The special label
.Ql *
allows all clients and should only be used on systems where the
service name is otherwise protected.
If the file is missing, reboot and shutdown requests are denied.
.Pp
At startup,
.Xr libservice 3
validates and activates the bundle's inherited reboot token before applying
the daemon's self-selected capprotect shield, registering its name, or
reporting readiness.
Token activation failure is fatal.
.Sh PROTOCOL
Requests use
.Vt struct reboot_req .
.Bl -tag -width REBOOT_OP_SHUTDOWN
.It Dv REBOOT_OP_REBOOT Pq 1
Reboot the system.
The
.Va flags
field may contain only
.Dv RB_HALT ,
.Dv RB_POWEROFF ,
or
.Dv RB_REROOT .
Unknown flags are rejected.
.It Dv REBOOT_OP_SHUTDOWN Pq 2
Perform a clean shutdown
.Pq Dv RB_HALT | RB_POWEROFF .
.It Dv REBOOT_OP_STATUS Pq 3
Query whether this daemon has initiated shutdown.
This operation does not require an allow-list entry.
.El
.Pp
Malformed requests receive
.Dv REBOOT_STATUS_ERR .
Denied reboot and shutdown requests receive
.Dv REBOOT_STATUS_PERM .
.Sh OBSERVABILITY
The
.Dq rebootd
DTrace provider exposes
.Fn session-start ,
.Fn session-end ,
.Fn request ,
and
.Fn malformed
probes.
The request and session-end probes report zero for success or an
.Xr errno 2
value for failure.
Reboot and shutdown attempts, including policy denials and backend failures,
also generate
.Dv AUE_REBOOT
OpenBSM audit records containing the authenticated client service label.
.Sh BUNDLE
.Nm
is installed as a system
.Pa .cap
bundle:
.Bd -literal -offset indent
/Capabilities/System/Reboot.cap/
  bin/rebootd
  etc/rebootd.ucl
.Ed
.Pp
The bundle manifest declares:
.Bd -literal -offset indent
bundle_id = "org.5bsd.system.reboot";
program = "rebootd";
provides = ["org.5bsd.system.reboot"];
capabilities {
    system = ["reboot"];
}
.Ed
.Sh FILES
.Bl -tag -width "/etc/rebootd.allow"
.It Pa /etc/rebootd.allow
Client service-label allow list for reboot and shutdown.
.El
.Sh SEE ALSO
.Xr reboot 2 ,
.Xr libchannel 3 ,
.Xr libservice 3 ,
.Xr serviced 8
