5BSD/5BSD/usr.sbin/rebootd/rebootd.8
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd July 31, 2026
.Dt REBOOTD 8
.Os
.Sh NAME
.Nm rebootd
.Nd reboot and shutdown manager
.Sh DESCRIPTION
.Nm
is a
.Xr serviced 8
system service that brokers controlled reboot and shutdown requests.
It registers the service name
.Dq org.5bsd.system.reboot
with
.Xr serviced 8 .
.Pp
Applications use the typed
.Xr librebootctl 3
API; it discovers the service, creates an independent session, and validates
the versioned protocol.
The
.Xr serviced 8
naming layer authenticates the provider name but does not authorize
callers.
Therefore
.Nm
authorizes mutating requests by service label.
.Pp
Allowed client labels are read from
.Pa /etc/rebootd.allow .
The file contains one service label per line.
Blank lines and comments beginning with
.Ql #
are ignored.
Wildcard entries are rejected; reboot authority must always be granted to
explicit authenticated service labels.
The file must be a regular file owned by the daemon's effective user, must not
be group- or world-writable, is opened without following symbolic links, and
must not exceed 64 KiB or contain embedded NUL bytes.
If the file is missing, reboot and shutdown requests are denied.
.Pp
At startup,
.Xr libservice 3
validates and activates the bundle's inherited reboot token before applying
the daemon's self-selected capprotect shield, registering its name, or
reporting readiness.
Token activation failure is fatal.
.Nm
intentionally runs as root because the system capability gate is an
additional authorization check and does not replace the kernel's traditional
reboot or audit-submission privilege checks.
After initialization it is in capability mode.
The daemon uses one bounded kqueue coordinator rather than a process per
client.  It prohibits fork, new IPC creation, exec, and new sockets after
initialization; received session descriptors are immediately made
non-transferable.
.Sh PROTOCOL
The protocol is owned by
.Xr librebootctl 3
and uses an exact typed header with magic, version, opcode, flags, and
negative errno status.
.Bl -tag -width REBOOTCTL_OP_SHUTDOWN
.It Dv REBOOTCTL_OP_REBOOT Pq 1
Reboot the system.
The
.Va flags
field may contain only
.Dv RB_HALT ,
.Dv RB_POWEROFF ,
or
.Dv RB_REROOT .
Unknown flags are rejected.
Only one reboot or shutdown operation may be pending in the daemon's
authoritative scheduler; a competing request fails with
.Er EALREADY .
.It Dv REBOOTCTL_OP_SHUTDOWN Pq 2
Perform a clean shutdown
.Pq Dv RB_HALT | RB_POWEROFF .
.It Dv REBOOTCTL_OP_STATUS Pq 3
Query whether this daemon has initiated shutdown.
This operation does not require an allow-list entry.
Every client observes the same scheduler state.  The schedule survives the
requesting client's disconnect and records trusted request, execution, and
monotonic timing data.
The scheduler writes a versioned, checksummed record through the process's
private FileSystemCmp persistent namespace before acknowledging an operation.
It uses a synced temporary object, atomic rename, and directory sync as the
durability boundary.  After a daemon crash, the coordinator reconstructs its
monotonic deadline from the persisted real-time deadline and republishes the
scheduled state before accepting clients.  Corrupt state fails startup closed.
.It Dv REBOOTCTL_OP_CANCEL Pq 4
Cancel the pending operation.  Cancellation is authorized by the same
exact-label policy as reboot and shutdown and fails with
.Er ENOENT
when no operation is pending.
.El
.Pp
Malformed frames terminate the session.
Policy and backend failures are returned as negative errno status values.
.Sh OBSERVABILITY
The
.Dq rebootd
DTrace provider exposes
.Fn session-start ,
.Fn session-end ,
.Fn request ,
and
.Fn malformed
probes.
The request and session-end probes report zero for success or an
.Xr errno 2
value for failure.
Reboot and shutdown attempts, including policy denials and backend failures,
also generate
.Dv AUE_REBOOT
OpenBSM audit records containing the authenticated client service label.
.Sh BUNDLE
.Nm
is installed as a system
.Pa .cap
bundle:
.Bd -literal -offset indent
/Capabilities/System/Reboot.cap/
  bin/rebootd
  etc/rebootd.ucl
.Ed
.Pp
The bundle manifest declares:
.Bd -literal -offset indent
bundle_id = "org.5bsd.system.reboot";
components = ["filesystem"];
program = "rebootd";
provides = ["org.5bsd.system.reboot"];
user = "root";
capabilities {
    system = ["reboot"];
}
.Ed
.Sh FILES
.Bl -tag -width "/etc/rebootd.allow"
.It Pa /etc/rebootd.allow
Client service-label allow list for reboot and shutdown.
.El
.Sh SEE ALSO
.Xr reboot 2 ,
.Xr libchannel 3 ,
.Xr librebootctl 3 ,
.Xr libservice 3 ,
.Xr rebootctl 8 ,
.Xr serviced 8
