5BSD/5BSD/usr.sbin/switchboard/switchboard.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd September 25, 2026
.Dt SWITCHBOARD 5
.Os
.Sh NAME
.Nm switchboard
.Nd capability bundle and unit manifest format
.Sh DESCRIPTION
.Xr switchboard 8
loads literal UCL from self-contained
.Pa .cap
directories.
The bundle root contains
.Pa Bundle.ucl ,
optional
.Pa Shared ,
and
.Pa Units .
Each declared unit is
.Pa Units/name.unit
with
.Pa Unit.ucl ,
.Pa bin/name ,
and optional
.Pa Config
and
.Pa Resources
directories.
Other root or unit entries, undeclared units, symlinks, and special objects
are rejected.
.Pp
Manifests are regular files no larger than 1 MiB.
Unknown and duplicate keys, directives, includes, macros, variables, and
implicit arrays fail closed.
The verified tree is limited to 4096 entries, 512 MiB per file, and 2 GiB in
total.
.Sh BUNDLE.UCL
Required keys are:
.Bl -tag -width schema_version
.It Va schema
Must be
.Dq org.5bsd.capability-bundle .
.It Va schema_version
Integer 1.
.It Va bundle_id
Globally unique reverse-domain identity.
.It Va version
Display version string.
.It Va sequence
Positive, monotonically increasing 64-bit installation order.
.It Va units
Exact array of one through 32 lower-case unit names.
.It Va groups
Optional array of at most four group-container names the bundle is a member
of.
Each unit of the bundle may then claim storage in the cross-bundle group
container
.Pa Data/Shared/<group>/
through
.Xr service_storage_open_group 3 ;
the container is reaped only when no installed bundle claims the group
(docs/capability-container-model.md).
A name is a single safe component: letters, digits,
.Ql \&. ,
.Ql - ,
.Ql _ ;
1 to 63 characters; not starting or ending with
.Ql \&.
or
.Ql - .
.El
.Pp
Optional
.Va author
and
.Va publisher
are display metadata.
.Sh UNIT.UCL
The default program is
.Pa bin/name .
The optional
.Va program
is one filename in that directory, never a path.
.Va arguments
and
.Va environment
contain at most 32 literal entries each.
Reserved bootstrap environment names, including
.Ev SERVICE_BOOTSTRAP_FD
and
.Ev CAPABILITY_UNIT_DIR ,
are rejected.
.Va user
and
.Va group
default to
.Dq capability .
.Pp
Every unit requires an
.Va activation
object.
.Va boot
is a Boolean and
.Va ipc
is one name or an array of at most eight entries.
Each entry is either a bare reverse-domain name or an object with the closed
keys
.Va name
and
.Va requires .
The bare form, an object without
.Va requires ,
and an object whose
.Va requires
is empty all publish an open endpoint; an object whose
.Va requires
lists anointment names publishes a gated one (see
.Sx IPC ANOINTMENTS ) .
.Va requires
is a string or an array of at most eight unique reverse-domain names.
.Va timer
is an object with a single
.Va interval
key, an unsigned count of monotonic seconds; the unit is activated on demand
every interval while it is stopped.
Only monotonic intervals are supported here; use
.Va schedule
for wall-clock times.
.Va schedule
is a calendar string that activates the unit on demand at matching local times:
a five-field cron expression
.Pq Dq Ar min hour mday month wday , No each a number or Dq * ,
or a named alias
.Pq Dq hourly , Dq daily , Dq weekly , Dq monthly , No or Dq yearly .
Every specified field must match
.Pq launchd Ns -style AND semantics ,
so
.Dq 0 0 13 \(** 5
is a Friday that is also the 13th.
.Va persistent
is a Boolean that requires a
.Va schedule ;
when true, a matching time that elapsed while
.Nm
was not running triggers one catch-up activation at startup.
.Va timer
and
.Va schedule
are mutually exclusive.
.Va path
is an object with a single absolute
.Va path
string; a change to that path
.Pq Dv NOTE_WRITE , NOTE_DELETE , NOTE_RENAME , NOTE_EXTEND , NOTE_ATTRIB
activates the unit on demand.
Path events are only hints: after activation the unit must inspect the current
state of the path itself.
.Va queue_directory
is an absolute directory; while it holds any entry the unit is activated to
drain it and re-activated after each exit until the directory empties.
.Va on_mount
is a Boolean that activates the unit whenever a filesystem is mounted.
.Va helper
is a Boolean marking the unit a private helper (XPC-style): it is launched only
on request by a sibling unit in the same bundle, never publishes a
.Ql system.
name, and is never boot-activated.
A helper unit therefore declares no other activation source and no
.Va ipc .
.Va socket
is a single object, or an array of at most four objects, each with a
.Va name
(the logical name the listener is delivered under), a
.Va listen
string of the form
.Dq tcp:ADDR:PORT ,
.Dq tcp6:ADDR:PORT ,
.Dq udp:ADDR:PORT ,
.Dq udp6:ADDR:PORT ,
or
.Dq unix:/abs/path
.Po
.Va ADDR
may be
.Dq *
or empty for any address
.Pc ,
and an optional
.Va backlog
.Pq 1 Ns .. Ns 1024 , default 128 .
.Nm
itself binds and
.Xr listen 2 Ns s
the socket and holds it open; the first inbound connection activates the unit on
demand.
Because the listener is owned by
.Nm
it survives the unit's stop, idle-stop, and restart cycles with its backlog
intact, and it is delivered to the launched process as a bootstrap capability of
type
.Dq socket
retrieved with
.Xr service_activation_socket 3 .
At least one trigger
.Pq Va boot , ipc , timer , schedule , path , queue_directory , on_mount , helper , No or Va socket
is required.
Publishing IPC does not imply boot activation, and a demand source does not
launch the unit at boot; it stays stopped until the source fires.
.Pp
.Va restart
is
.Dq never ,
.Dq on-failure ,
or
.Dq always .
.Va control
selects the unit's management class and is
.Dq core ,
.Dq system ,
or
.Dq user ;
it defaults to
.Dq system
when the key is absent.
The class governs who may stop, restart, unload, or disable the unit at
runtime, and is checked before any privilege.
A
.Dq core
unit cannot be stopped or unloaded at runtime by anyone, including the
superuser; only the boot and shutdown lifecycle, and an in-place restart when
its manifest changes, may act on it.
A
.Dq system
unit is managed only by a session holding operator authority
.Pq the Va admin_rights No grant of the principal policy ,
which a bare uid 0 login does not carry by default.
A
.Dq user
unit is managed by its owning uid or by an operator; a bundle loaded from a
per-user agent directory is forced to this class whatever it declares.
.Pp
.Va visible
is an optional list of the domain kinds that may resolve this unit's
.Va ipc
names, each
.Dq user
or
.Dq system .
.Dq system
is always implied; listing
.Dq user
opts the unit's names into resolution through a narrowed USER-domain lookup
channel, as held by a login or
.Xr ssh 1
session.
When the key is absent the names are SYSTEM-only: a user session never
discovers them and a lookup returns
.Er ENOENT ,
indistinguishable from an unregistered name.
This per-provider policy replaces the former allow-list built into
.Nm ;
a value is also accepted as a bare string.
.Pp
.Va domain
is the operating domain the unit's OWN service lookups run in \(em the scope
.Nm
applies to names the unit resolves over its bootstrap channel, distinct from
.Va visible ,
which controls who may resolve the unit.
It is
.Dq system
or
.Dq user .
When the key is absent the bundle class decides: a base-system bundle under
.Pa /Capabilities/System
operates in the SYSTEM domain (resolves every registered name, as today) and an
application bundle operates in the least-privilege USER domain (resolves only
user-visible names).
A USER-domain unit cannot mint session domains.
.Pp
.Va holds
is an optional top-level string or array of at most 32 unique reverse-domain
names (anointments) the unit holds when it looks endpoints up (see
.Sx IPC ANOINTMENTS ) .
Absent means the empty set.
.Pp
.Va stop_timeout
is 1 through 300 seconds and
.Va max_failures
is 1 through 100.
.Pp
The optional
.Va watchdog
object takes a single
.Va interval
key (1 through 86400 seconds) and opts the unit into a liveness deadline.
Once the unit is running, its program must call
.Fn service_heartbeat
at least every
.Va interval
seconds; each heartbeat resets the timer, and a missed interval causes
.Nm
to kill the wedged process so its
.Va restart
policy relaunches it.
The deadline is armed when the unit reaches the running state, not at the first
heartbeat, so a program that hangs during start-up is also caught.
It applies to
.Dv SYSTEM
and
.Dv USER
units alike and is disabled unless declared.
The legacy
.Va kmod_requires
key is rejected.
Services request allowed kernel modules through
.Xr BSDExtension 8
using
.Fn service_ensure_extension ;
Capsule does not load modules on their behalf.
.Pp
The optional
.Va limits
object sets pre-exec resource ceilings applied with
.Xr setrlimit 2 :
.Va memory
.Pq Dv RLIMIT_AS ,
.Va cpu , nproc , nofile , stack , fsize ,
and
.Va core .
Byte quantities accept a
.Dq K , M , G , No or Dq T
suffix; an unset limit is inherited from
.Nm ,
and
.Va core
defaults to 0 (no core dumps).
.Va umask
is an octal string or integer file-creation mask, default
.Dq 0077 .
.Va level
is the service level
.Dq background , Dq standard No (the default), or Dq interactive ,
applied as a process
.Xr nice 3
priority.
The
.Dq interactive
boost is a privilege: it is honoured only for a unit of a base-system bundle
and is clamped to
.Dq standard
for an application or per-user agent.
All three are applied in the child after
.Xr pdfork 2
and before the program image runs.
.Pp
A unit does not declare a jail in its manifest.
If it wants to be jailed it confines itself at runtime via
.Xr service_enter_namespace 3
.Pq the Dq system.Namespace broker, Xr BSDNamespace 8 ,
scoped to its own unforgeable channel label.
.Sh IPC ANOINTMENTS
An anointment is a dotted name like a bundle id, lower-case by convention,
that names a privilege to reach an endpoint.
A provider gates an endpoint by listing the anointments a connecting program
must hold in that entry's
.Va requires ;
with several names, all of them are needed.
A program declares the anointments it holds in its top-level
.Va holds
list.
.Nm
compares the two at lookup, after the existing domain rules: a requester whose
set does not cover the endpoint's
.Va requires
is refused with
.Er ENOENT ,
indistinguishable from an unregistered name, the refusal is audited, and the
provider is not activated on demand for it.
.Pp
An endpoint without
.Va requires
is open: anyone the domain rules let see the name may connect, exactly as
before this key existed.
A unit without
.Va holds
holds nothing and can still reach every open endpoint.
The wildcard
.Dq *
is not a valid name in either list of a bundle policy file (manifest); it is
legal only in the auth agent's principal policy, which decides what a login
session holds.
.Pp
A gated endpoint is visible to any unit or session whose set covers it,
regardless of the provider's
.Va visible :
the provider gated it, so it said who may reach it.
Open endpoints keep the
.Va visible
rule.
.Pp
A login session has no policy file.
Its set is fixed when
.Xr login 1 ,
.Xr su 1
or
.Xr sshd 8
asks the auth agent for the session channel, from the principal policy in
.Pa /Capabilities/Config/principal-policy.ucl ,
and every process under the session shares it; a bundle launched from a shell
does not inherit it but starts with its own policy-file set.
The same policy decides, separately from reach, whether connections from the
session carry the administrative rights bit
.Pq Dv SVC_RIGHTS_ADMIN
that providers use as an in-endpoint bypass; a unit never carries it.
The boot channel
.Nm
installs ahead of
.Xr rc 8
holds every anointment and the bypass.
.Nm Ns 's
own control endpoints
.Pq Ql system.switchboard , Ql system.lifecycle
require
.Ql system.switchboard.admin .
.Pp
Every refusal is recorded in the audit trail
.Pq Dv AUE_SWITCHBOARD_ANOINT
with the requester's label, the endpoint and the missing names, beside the
.Ql anoint-deny
DTrace probe.
.Bd -literal -offset indent
# provider: two endpoints, one gated
activation {
    ipc = [
        "system.Notify",                                 # open
        { name = "system.Notify.System";
          requires = ["system.notify.system"]; }         # gated
    ];
}

# consumer
holds = ["system.notify.system"];
.Ed
.Sh STORAGE
A unit does not declare storage in its manifest.
It obtains mutable state at runtime by opening the
.Dq system.Filesystem
service
.Pq Xr BSDFilesystem 8
by name;
.Xr BSDFilesystem 8
derives the dataset from the consumer's unforgeable channel label and returns
it as a rights-limited
.Vt zfshandle
that the unit mounts itself with
.Xr service_storage_open 3 .
Dataset paths are never supplied by the manifest.
.Sh CAPABILITIES
A unit declares no resource capabilities in its manifest: no paths, devices,
network endpoints, storage, jails, or kernel modules are granted at launch.
The manifest describes only how to launch the program
.Pq Va program , Va user , Va activation , Va restart , Va limits , ... .
A unit acquires whatever it needs at runtime, by name, and every grant is
resolved on demand and scoped by the unit's own unforgeable channel label:
.Bl -tag -width Ds
.It a filesystem path or device
.Xr service_open_isolated 3 ;
the filesystem daemon
.Pq Xr BSDFilesystem 8
opens it under its own per-label policy and returns a rights-limited descriptor.
.It mutable storage
.Xr service_storage_open 3 ;
see
.Sx STORAGE .
.It a jail
.Xr service_enter_namespace 3 .
.It a kernel module
.Xr service_ensure_extension 3 .
.El
.Pp
Network access is default-open, with listeners supplied by socket-activation, so
it too is never declared.
.Pp
The one declaration that remains is the optional
.Va capabilities
object, which names the
.Xr mac_capability 4
system gates a born-in-capability-mode broker holds.
It is used only by the base-system providers that perform a privileged
kernel operation on behalf of their clients
.Pq Xr BSDTime 8 , Xr BSDSysctl 8 , Xr BSDExtension 8 , Xr BSDNamespace 8 ;
an application never needs it.
Its closed keys are:
.Bl -tag -width isolate
.It Va system
An array of distinct gate names, each one of
.Dq kldload ,
.Dq kldunload ,
.Dq reboot ,
.Dq swapon ,
.Dq swapoff ,
.Dq sysctl ,
.Dq kenv ,
.Dq kenv_read ,
.Dq acct ,
.Dq audit ,
.Dq settime ,
or
.Dq jail
.Pq the same names Xr capsule.conf 5 No accepts in Va claims.system .
An unknown or duplicated name rejects the manifest.
At launch
.Nm
asks
.Xr capsule 8
to mint one system-gate token carrying exactly the declared gates and delivers
it as a bootstrap capability of type
.Dq system ;
the program authorizes it with
.Xr service_provider_authorize_capabilities 3
and performs the gated operation through the matching
.Fn service_system_*
call, so the raw system call stays refused in capability mode.
The declaration is the grant: the manifest is opened with
.Dv O_VERIFY ,
so under
.Xr veriexec 4
a unit's gate set is exactly what its verified bundle declares.
.It Va isolate
An array of at most 64 sysctl OID names, each non-empty and shorter than 128
bytes, accepted only when
.Va system
lists
.Dq sysctl .
.Nm
resolves each name with
.Xr sysctlnametomib 3
at launch and has the token minted in its scoped form, so the unit becomes the
sole writer of exactly those OIDs outside
.Xr capsule 8 :
any other process's direct
.Xr sysctl 3
write to an isolated OID is denied by the kernel and must go through the broker
.Pq docs/capability-sysctl-isolation.md .
A
.Dq sysctl
gate is delegated only in this scoped form: a bare
.Dq sysctl
gate with no
.Va isolate
list, or
.Dq sysctl
combined with another gate, is refused at launch.
.El
.Pp
The
.Va capabilities
object is stripped from a unit loaded from a per-user agent directory, and
a unit that declares it counts one extra bootstrap token descriptor.
.Bd -literal -offset indent
# a sysctl broker: holds the gate, sole writer of two tunables
capabilities {
    system  = ["sysctl"];
    isolate = ["kern.maxfiles", "kern.maxproc"];
}
.Ed
.Sh EXAMPLE
.Bd -literal -offset indent
# App.cap/Bundle.ucl
schema = "org.5bsd.capability-bundle";
schema_version = 1;
bundle_id = "org.example.app";
version = "2.0.0";
sequence = 12;
units = ["worker"];

# App.cap/Units/worker.unit/Unit.ucl
arguments = ["--foreground"];
activation { boot = true; ipc = ["org.example.app.worker"]; }
restart = "on-failure";
.Ed
.Pp
A unit needs no manifest declaration to use a capability service: it links the
matching library
.Pq Xr libnetworkcmp 3 , Xr libcryptocmp 3 , Xr liblogcmp 3 , ...
and reaches the service lazily at first use over
.Xr service_connect 3 .
.Sh SEE ALSO
.Xr libcapbundle 3 ,
.Xr libservice 3 ,
.Xr service_storage_open 3 ,
.Xr BSDFilesystem 8 ,
.Xr switchboard 8 ,
.Xr switchboardctl 8
