5BSD/5BSD/usr.sbin/warden/warden.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd September 1, 2026
.Dt WARDEN 8
.Os
.Sh NAME
.Nm warden
.Nd namespace (jail) broker
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
daemon owns construction of jails
.Pq Xr jail_set 2 ,
a duty removed from
.Xr init 8
and the capability
.Xr authority 8 .
It is a socket-free capability-plane service: it exposes the well-known name
.Dq Li system.Namespace
and serves each client on its own
.Xr mac_capability 4
channel.
The discovery
.Em domain
layer resolves
.Dq Li system.Namespace
only for SYSTEM-domain clients.
Jailing is
.Em consumer self-service :
a program confines itself at runtime by calling
.Xr service_enter_namespace 3 ,
whose library resolves
.Nm
and drives it.
.Nm
is never driven by
.Xr serviced 8
on a unit's behalf, and a unit does not declare a jail in its manifest.
.Pp
.Nm
holds no standing jail authority of its own, and self-jailing needs no
per-caller token: because confining oneself is self-confinement,
.Nm
scopes each jail by the caller's unforgeable channel label, so one consumer
can never name or reuse another's jail.
.Nm
creates the jail rooted at the requested path with
.Dv JAIL_OWN_DESC
and returns an owning descriptor whose stored credential
.Pq root, from Nm
authorizes the non-root consumer's own
.Xr jail_attach_jd 2 ,
so the consumer attaches itself before exec.
.Pp
.Nm
is launched and supervised by
.Xr serviced 8
from the
.Pa /Capabilities/System/Namespace.cap
bundle; it is not started by
.Xr init 8 ,
and it is not intended to be run from the command line.
.Ss Operation
.Nm
runs as root and, unlike most capability-plane providers, NOT in capability
mode:
.Xr jail_set 2
needs the classic
.Dv PRIV_JAIL_SET
privilege and resolves the jail root path against the global namespace, both of
which capsicum forbids.
Its authority is the caller's channel label, not the capsicum sandbox.
A request carries the jail root path and optionally a hostname and
IPv4 address; the jail name is derived from the caller's channel label.
If a matching jail already exists (a persistent execution
container reused across relaunches) its descriptor is returned unchanged.
.Sh FILES
.Bl -tag -width ".Pa /Capabilities/System/Namespace.cap" -compact
.It Pa /Capabilities/System/Namespace.cap
capability bundle shipping
.Nm
.El
.Sh SEE ALSO
.Xr jail_set 2 ,
.Xr jail_attach_jd 2 ,
.Xr pdfork 2 ,
.Xr service_enter_namespace 3 ,
.Xr mac_capability 4 ,
.Xr authority 8 ,
.Xr jail 8 ,
.Xr serviced 8 ,
.Xr sysextd 8
.Sh HISTORY
The
.Nm
daemon appeared in
.Fx 5BSD .
It takes over jail construction formerly performed inside the capability
authority
.Pq Xr authority 8
as part of moving privileged work out of PID 1 and behind named,
domain-restricted, socket-free services.
.Sh AUTHORS
.An Kory Heard
