5BSD/5BSD/usr.sbin/oeslogger/oeslogger.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd August 15, 2026
.Dt OESLOGGER 8
.Os
.Sh NAME
.Nm oeslogger
.Nd log OpenEndpointSecurity events as JSON
.Sh SYNOPSIS
.Nm
.Op Fl p
.Op Fl o Ar file
.Op Ar event_type ...
.Nm
.Fl l
.Sh DESCRIPTION
.Nm
is a passive
.Xr oes 4
client which writes observed security events as newline-delimited JSON.
With no event types it subscribes to all notification events.
Named event types restrict the subscription, for example
.Cm exec ,
.Cm open ,
.Cm create ,
.Cm unlink ,
.Cm fork ,
and
.Cm exit .
.Pp
.Nm
never authorizes or blocks an operation.
It uses notification mode and mutes itself to avoid logging its own activity.
Each JSON record includes the event name, process information, event data, a
timestamp, and whether the event type has an authorization-capable variant.
.Bl -tag -width indent
.It Fl l
List accepted event names and exit.
.It Fl o Ar file
Append JSON output to
.Ar file
instead of standard output.
.It Fl p
Pretty-print JSON instead of emitting one compact object per line.
.El
.Sh EXAMPLES
Log all observable events:
.Bd -literal -offset indent
oeslogger
.Ed
.Pp
Log selected events to a file:
.Bd -literal -offset indent
oeslogger -o /var/log/oes.ndjson exec open create unlink
.Ed
.Pp
Format the normal NDJSON output with
.Xr jq 1 :
.Bd -literal -offset indent
oeslogger exec open | jq .
.Ed
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr jq 1 ,
.Xr oes 4 ,
.Xr liboes 3
.Sh HISTORY
.Nm
was added as the OpenEndpointSecurity event logging tool in
.Dx 16.0 .
