5BSD/5BSD/usr.sbin/BSDPower/BSDPower.8
.\" SPDX-License-Identifier: BSD-2-Clause
.\" Copyright (c) 2026 Kory Heard
.Dd September 19, 2026
.Dt BSDPOWER 8
.Os
.Sh NAME
.Nm BSDPower
.Nd system.Power capability provider
.Sh DESCRIPTION
.Nm
is the
.Dq system.Power
capability provider: the trusted broker for ACPI power management.
A holder of a system.Power channel queries the supported sleep states or, when
policy permits, requests the machine enter one, instead of driving
.Pa /dev/acpi
directly.
Clients use
.Xr libpowercmp 3 .
Reboot and halt stay with
.Xr capsule 8 ;
.Nm
owns sleep.
.Pp
.Nm
is
.Em born in capability mode :
switchboard execs it already inside the Capsicum cage.
It reaches
.Dv ACPIIO_REQSLPSTATE
only through a
.Pa /dev/acpi
descriptor that switchboard delivered and that
.Nm
narrows with
.Xr cap_ioctls_limit 2
to that single ioctl, so the sandbox exposes exactly the one privileged
operation and nothing else.
It is launched by
.Xr switchboard 8
as the
.Pa /Capabilities/System/Power.cap
bundle and never started by hand; each client is served by a
.Xr pdfork 2
worker that drops inherited authority.
.Sh POLICY
Querying the supported sleep states is unprivileged and allowed to every holder.
Suspending is
.Em default-deny :
a label may put the machine to sleep only if
.Pa Config/power.conf
grants it.
The file is UCL:
.Bd -literal -offset indent
default { suspend = false; }
clients {
	"org.5bsd.powerd" { suspend = true; }
}
.Ed
.Pp
A label matches by exact string; an unlisted label falls back to
.Va default .
A missing or malformed
.Pa power.conf
is fail-soft: the built-in default-deny stands.
An unexpected suspend is a denial of service, so grant
.Va suspend
only to a trusted power manager.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr acpiconf 8 ,
.Xr libpowercmp 3 ,
.Xr switchboard 8
.Sh AUTHORS
.An Kory Heard
