5BSD/5BSD/usr.sbin/tzfsd/tzfs.conf.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd August 14, 2026
.Dt TZFS.CONF 5
.Os
.Sh NAME
.Nm tzfs.conf
.Nd configuration file for the tzfsd storage daemon
.Sh DESCRIPTION
.Pa /Capabilities/Config/tzfsd.ucl
configures
.Xr tzfsd 8 .
It is a
.Xr libucl 3
document; every key is optional, and a missing file leaves the built-in
opinionated defaults in force.
Unknown keys are ignored so the schema can grow.
An existing configuration file must be a regular file owned by the daemon's
effective user and must not be writable by its group or by other users.
Symbolic links, malformed input, truncated values, and invalid types are fatal
startup errors.
.Sh KEYS
.Bl -tag -width ".Va ephemeral.sync"
.It Va pool
Name of the ZFS pool that backs
.Pa /Capabilities .
Setting it recomputes the root layout below unless those are overridden
explicitly.
Default
.Ql zroot .
.It Va roots.base
Base dataset for the capability storage tree.
Default
.Ql <pool>/Capabilities .
.It Va roots.persistent
Parent of persistent per-application datasets.
Default
.Ql <base>/persistent .
.It Va roots.ephemeral
Parent of ephemeral datasets, created on service start and destroyed on stop.
Default
.Ql <base>/ephemeral .
.It Va roots.mountpoint
Filesystem location of the base.
Default
.Ql /Capabilities .
.It Va ephemeral.sync
The
.Ql sync
property applied to ephemeral datasets.
Default
.Ql disabled
for throughput.
.El
.Sh FILES
.Bl -tag -width ".Pa /Capabilities/Config/tzfsd.ucl" -compact
.It Pa /Capabilities/Config/tzfsd.ucl
the file described here
.El
.Sh EXAMPLES
Back
.Pa /Capabilities
with a dedicated pool:
.Bd -literal -offset indent
pool = "tank";
ephemeral { sync = "standard"; }
.Ed
.Sh SEE ALSO
.Xr libtzfsd 3 ,
.Xr trustedzfs 3 ,
.Xr tzfsctl 8 ,
.Xr tzfsd 8
.Sh AUTHORS
.An Kory Heard
