5BSD/5BSD/usr.sbin/servicectl/servicectl.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt SERVICECTL 8
.Os
.Sh NAME
.Nm servicectl
.Nd control interface to serviced
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Cm status | services | reload
.Nm
.Op Fl s Ar socket
.Cm stop Ar label
.Nm
.Op Fl s Ar socket
.Cm install Ar path.cap
.Nm
.Op Fl s Ar socket
.Cm verify Ar path.cap
.Nm
.Op Fl s Ar socket
.Cm bundles
.Sh DESCRIPTION
.Nm
is the administrative command-line interface to
.Xr serviced 8 .
Each invocation opens a connection to the
.Xr serviced 8
control socket, sends one command, prints the result, and exits.
.Sh COMMANDS
.Bl -tag -width "check manifest"
.It Cm status
Display the overall status of
.Xr serviced 8
and a table of all loaded services.
For each service, the output includes the label, current state
.Pq running, stopped, starting, or stopping ,
PID (if running), restart policy, and restart count.
Available to any user.
.It Cm services
List all loaded services.
The output is identical to the
.Cm status
command.
Available to any user.
.It Cm reload
Reload service manifests from disk.
New manifests are loaded and their services started, changed
manifests trigger a graceful restart of the affected service,
and manifests removed from disk cause the corresponding service
to be gracefully stopped.
The dependency graph is re-validated before any changes are
applied; if the new graph would contain a cycle, the reload
is rejected and running services are unaffected.
.Pp
Requires root privileges.
.It Cm stop Ar label
Gracefully stop a running service.
Sends SIGTERM and waits for the service's configured
.Va stop_timeout
before escalating to SIGKILL.
.Pp
Requires root privileges.
.It Cm install Ar path.cap
Install a
.Pa .cap
bundle to
.Pa /Capabilities/ .
The bundle is verified before installation.
After copying, run
.Cm servicectl reload
to register the new services.
.Pp
Requires root privileges.
.It Cm verify Ar path.cap
Validate a
.Pa .cap
bundle's integrity.
Checks that the bundle structure is correct, all Service.ucl files
parse successfully, binaries exist and are executable, provides names
are unique, and no self-dependencies exist.
Prints a summary of the bundle's services on success.
.It Cm bundles
List all installed bundles from
.Pa /Capabilities/System/
and
.Pa /Capabilities/ ,
showing bundle ID, version, and service count for each.
.El
.Sh OPTIONS
.Bl -tag -width "-s socket"
.It Fl s Ar socket
Connect to the
.Xr serviced 8
control socket at
.Ar socket
instead of the default
.Pa /var/run/serviced.sock .
.El
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits 0 on success and >0 if an error occurred.
An exit status of
.Dv EX_UNAVAILABLE
(69) indicates that the control socket could not be reached,
typically because
.Xr serviced 8
is not running.
.Sh EXAMPLES
Check whether
.Xr serviced 8
is running and list services:
.Bd -literal -offset indent
# servicectl status
.Ed
.Pp
Reload manifests after adding a new service:
.Bd -literal -offset indent
# servicectl reload
.Ed
.Pp
Install and activate a bundle:
.Bd -literal -offset indent
# servicectl install /path/to/MyApp.cap
# servicectl reload
.Ed
.Pp
Verify a bundle's integrity:
.Bd -literal -offset indent
# servicectl verify /path/to/MyApp.cap
.Ed
.Pp
Connect to an alternate control socket:
.Bd -literal -offset indent
# servicectl -s /tmp/test-serviced.sock status
.Ed
.Sh SEE ALSO
.Xr serviced 5 ,
.Xr serviced 8
.Sh HISTORY
.Nm
first appeared in 5BSD.
