5BSD/5BSD/usr.sbin/servicectl/servicectl.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt SERVICECTL 8
.Os
.Sh NAME
.Nm servicectl
.Nd control interface to serviced
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Cm status | services | reload
.Nm
.Op Fl s Ar socket
.Cm check Ar manifest
.Nm
.Op Fl s Ar socket
.Cm load Ar manifest
.Sh DESCRIPTION
.Nm
is the administrative command-line interface to
.Xr serviced 8 .
Each invocation opens a connection to the
.Xr serviced 8
control socket, sends one command, prints the result, and exits.
.Sh COMMANDS
.Bl -tag -width "check manifest"
.It Cm status
Display the overall status of
.Xr serviced 8
and a table of all loaded services.
For each service, the output includes the label, current state
.Pq running, stopped, starting, or stopping ,
PID (if running), restart policy, and restart count.
Available to any user.
.It Cm services
List all loaded services.
The output is identical to the
.Cm status
command.
Available to any user.
.It Cm reload
Reload service manifests from disk.
New manifests are loaded and their services started, changed
manifests trigger a graceful restart of the affected service,
and manifests removed from disk cause the corresponding service
to be gracefully stopped.
The dependency graph is re-validated before any changes are
applied; if the new graph would contain a cycle, the reload
is rejected and running services are unaffected.
.Pp
Requires root privileges.
.It Cm check Ar manifest
Validate a service manifest file without loading it.
.Ar manifest
is a filename relative to the manifest directory
.Pq typically Pa /etc/oracled.d/ .
Checks that the program exists and is executable, that the
specified user and group exist, and that the manifest parses
correctly.
.Pp
Requires root privileges.
.It Cm load Ar manifest
Load a service manifest and start the service.
.Ar manifest
is a filename relative to the manifest directory.
The service is added to the running set, the dependency graph
is re-sorted, and the service is launched.
.Pp
Requires root privileges.
.El
.Sh OPTIONS
.Bl -tag -width "-s socket"
.It Fl s Ar socket
Connect to the
.Xr serviced 8
control socket at
.Ar socket
instead of the default
.Pa /var/run/serviced.sock .
.El
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits 0 on success and >0 if an error occurred.
An exit status of
.Dv EX_UNAVAILABLE
(69) indicates that the control socket could not be reached,
typically because
.Xr serviced 8
is not running.
.Sh EXAMPLES
Check whether
.Xr serviced 8
is running and list services:
.Bd -literal -offset indent
# servicectl status
.Ed
.Pp
Reload manifests after adding a new service:
.Bd -literal -offset indent
# servicectl reload
.Ed
.Pp
Validate a manifest before loading:
.Bd -literal -offset indent
# servicectl check myservice.ucl
.Ed
.Pp
Load and start a new service:
.Bd -literal -offset indent
# servicectl load myservice.ucl
.Ed
.Pp
Connect to an alternate control socket:
.Bd -literal -offset indent
# servicectl -s /tmp/test-serviced.sock status
.Ed
.Sh SEE ALSO
.Xr serviced 5 ,
.Xr serviced 8
.Sh HISTORY
.Nm
first appeared in 5BSD.
