5BSD/5BSD/usr.sbin/tzfsctl/tzfsctl.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd August 14, 2026
.Dt TZFSCTL 8
.Os
.Sh NAME
.Nm tzfsctl
.Nd inspect and exercise the bsdfilesystem storage daemon
.Sh SYNOPSIS
.Nm
.Cm ping
.Nm
.Cm request
.Op Fl l Ar lifetime
.Op Fl r Ar rights
.Op Fl m
.Ar name
.Nm
.Cm release
.Ar name
.Sh DESCRIPTION
.Nm
is the operator command-line interface to
.Xr bsdfilesystem 8 ,
the
.Sy [TZFS]
storage daemon.
It connects the daemon socket and issues one request.
.Pp
The commands are:
.Bl -tag -width ".Cm release"
.It Cm ping
Report whether the daemon is answering.
.It Cm request Oo Fl l Ar lifetime Oc Oo Fl r Ar rights Oc Oo Fl m Oc Ar name
Ask for a storage handle named
.Ar name
and print the resolved dataset.
.Fl l
is
.Ar persistent ,
.Ar cache ,
.Ar boot ,
or
.Ar lease
.Pq default: lease ;
.Fl r
is a comma-separated rights list
.Pq for example Ar mount,snapshot,props_read , or Ar all ;
and
.Fl m
additionally mounts the handle and prints the directory descriptor.
.Nm
is a demonstration and health tool: it exits immediately, closing the handle
(and unmounting), so it does not hold storage open.
.It Cm release Ar name
Destroy the lease claim previously granted under
.Ar name .
Idempotent.
.El
.Sh EXAMPLES
Get a bare dataset as a mounted directory:
.Bd -literal -offset indent
tzfsctl request -l lease -m rootfs
.Ed
.Sh SEE ALSO
.Xr libbsdfilesystem 3 ,
.Xr trustedzfs 3 ,
.Xr tzfs.conf 5 ,
.Xr bsdfilesystem 8
.Sh AUTHORS
.An Kory Heard
