5BSD/5BSD/usr.sbin/networkcmp/networkcmp.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt NETWORKCMP 8
.Os
.Sh NAME
.Nm networkcmp
.Nd capability-mode kernel NetworkCmp provider
.Sh DESCRIPTION
.Nm
is the initial base-system provider for
.Dq org.5bsd.network
version
.Dq 1.0.0 .
It is installed in
.Pa /Capabilities/System/NetworkCmp.cap
and launched only by
.Xr serviced 8 .
.Pp
The base provider implements bounded DNS and TCP/UDP socket and data operations
using the kernel network stack through an attenuated
.Xr cap_net 3
channel.
Each consumer receives a private capability-mode worker enlisted in its
coalition.
The worker cannot fork, execute, or receive unrelated descriptors.
The Casper factory channel never crosses a fork; each attenuated resolver
channel survives only its worker fork and is non-transferable and locked
against exec propagation.
Kernel socket descriptors and the Casper channel never cross into the
consumer.
Connected TCP streams and UDP sockets use bounded inline messages as the
baseline data path.
Every provider socket operation, including receive, is nonblocking.
The typed client library implements receive deadlines with bounded
nonblocking requests so one wait cannot stall unrelated session RPCs.
Datagram truncation and stream EOF are reported explicitly.
Bulk stream and connected-datagram traffic will use role-separated shared
rings.
Until ring attachment is enabled, the provider does not advertise
.Dv NETWORKCMP_FEATURE_SHM_RINGS .
.Pp
Resolver requests cap host and service lengths, flags, address families, and
result counts.
They never read resolver configuration from the consumer filesystem.
.Pp
The component bootstrap carries no manifest-selected policy object.
The provider-owned initial policy enables IPv4, IPv6, outbound connections,
and at most 16 resolver results and 64 sockets per session.
Bind, listen, and accept authority is denied.
Socket options are restricted to bounded buffer sizes and an explicit
allow-list including
.Dv SO_KEEPALIVE ,
.Dv SO_REUSEADDR ,
.Dv TCP_NODELAY ,
and
.Dv IPV6_V6ONLY .
.Sh SECURITY
Session creation and resolver policy decisions are recorded through OpenBSM.
Session, resolution, and rejection paths expose DTrace probes through the
.Dq networkcmp_provider
provider.
.Sh SEE ALSO
.Xr cap_net 3 ,
.Xr libnetworkcmp 3 ,
.Xr serviced 8
