5BSD/5BSD/lib/libsys/cap_xfer_capmode.2
.\"
.\" Copyright (c) 2026 Kory Heard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 27, 2026
.Dt CAP_XFER_CAPMODE 2
.Os
.Sh NAME
.Nm cap_xfer_capmode
.Nd restrict descriptor transfer to capability-mode connections
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In sys/capsicum.h
.Ft int
.Fn cap_xfer_capmode "int fd"
.Sh DESCRIPTION
The
.Fn cap_xfer_capmode
system call sets a monotonic per-descriptor flag that restricts how the
descriptor may be transferred via
.Xr sendmsg 2
with an
.Dv SCM_RIGHTS
control message.
Once set, the descriptor may only be sent over a
.Ux Ns -domain
socket that has the
.Dv LOCAL_CAP_SOCKET
attribute
.Pq see Xr unix 4 ,
meaning both endpoints were created in capability mode.
If the sending socket lacks
.Dv LOCAL_CAP_SOCKET ,
.Xr sendmsg 2
fails with
.Er ENOTCAPABLE
and the descriptor is not delivered.
.Pp
The flag is monotonic: once set it cannot be cleared.
Calling
.Fn cap_xfer_capmode
on a descriptor that already has the flag set is permitted and has no
effect.
.Pp
This system call controls
.Em which connections
may be used to transfer the descriptor.
It is orthogonal to
.Xr cap_xfer_limit 2 ,
which controls
.Em how many times
the descriptor may be transferred, and may be combined with it freely.
.Pp
.Sy Flag propagation:
when a process successfully receives the descriptor, the new descriptor
installed in the receiver's file descriptor table inherits the flag.
Subsequent transfers of the received descriptor are therefore also
restricted to sockets with
.Dv LOCAL_CAP_SOCKET .
The flag cannot be cleared by the receiving process.
.Pp
This system call is allowed in capability mode
.Pq see Xr cap_enter 2 .
.Sh SECURITY CONSIDERATIONS
Combined with
.Xr cap_xfer_limit 2
.Pq Dv CAP_XFER_ONCE ,
.Xr cap_cloexec_limit 2
.Pq Dv CAP_CLOEXEC_LOCKED ,
and
.Xr cap_clofork_limit 2
.Pq Dv CAP_CLOFORK_LOCKED ,
.Fn cap_xfer_capmode
creates a closed security boundary: the descriptor can be transferred
exactly once, only over a connection where both endpoints are in
capability mode, and will be closed on exec or fork in the receiving
process.
This pattern is appropriate when delegating a sensitive resource to a
sandboxed worker that must not be able to exfiltrate it further.
.Pp
Descriptors marked with the
.Dv UF_CAP_SUFFICIENT
flag
.Pq set via Xr socketpair 2 with Dv SOCK_CAPMODE or directly
bypass ambient authority checks when used by a capability-mode process,
providing capability-sufficient access without requiring additional
ambient authority.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
.Fn cap_xfer_capmode
succeeds unless:
.Bl -tag -width Er
.It Bq Er EBADF
The
.Fa fd
argument is not a valid active descriptor.
.It Bq Er ENOSYS
The running kernel was compiled without
.Cd "options CAPABILITIES" .
.El
.Sh SEE ALSO
.Xr cap_clofork_limit 2 ,
.Xr cap_cloexec_limit 2 ,
.Xr cap_enter 2 ,
.Xr cap_rights_limit 2 ,
.Xr cap_xfer_limit 2 ,
.Xr sendmsg 2 ,
.Xr socketpair 2 ,
.Xr capsicum 4 ,
.Xr unix 4
.Sh HISTORY
The
.Fn cap_xfer_capmode
system call first appeared in
.Fx 16.0 .
