5BSD/5BSD/lib/libsys/cap_cloexec_limit.2
.\"
.\" Copyright (c) 2026 Kory Heard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 11, 2026
.Dt CAP_CLOEXEC_LIMIT 2
.Os
.Sh NAME
.Nm cap_cloexec_limit
.Nd lock close-on-exec for a file descriptor
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In sys/capsicum.h
.Ft int
.Fn cap_cloexec_limit "int fd" "int state"
.Sh DESCRIPTION
The
.Fn cap_cloexec_limit
system call provides a monotonic close-on-exec guarantee for a file
descriptor that cannot be undone by the process holding it.
.Pp
This operates independently from the traditional
.Dv FD_CLOEXEC
flag managed by
.Xr fcntl 2 .
The process can freely set or clear
.Dv FD_CLOEXEC
via
.Dv F_SETFD
without affecting the lock.
When
.Xr execve 2
is called, the kernel closes the descriptor if
.Em either
the
.Dv FD_CLOEXEC
flag is set
.Em or
the cloexec lock is
.Dv CAP_CLOEXEC_LOCKED .
.Pp
The
.Fa state
argument must be one of:
.Bl -tag -width CAP_CLOEXEC_UNLOCKED
.It Dv CAP_CLOEXEC_UNLOCKED
No lock.
Close-on-exec is governed solely by the
.Dv FD_CLOEXEC
flag.
This is the default state for newly created descriptors.
.It Dv CAP_CLOEXEC_LOCKED
The descriptor will be closed on
.Xr execve 2
regardless of the
.Dv FD_CLOEXEC
flag.
.El
.Pp
The lock state is monotonically increasing: once locked, it cannot be
unlocked.
Setting
.Dv CAP_CLOEXEC_LOCKED
on a descriptor that is already locked is permitted and has no effect.
.Pp
The lock state is inherited across
.Xr dup 2
and
.Xr fork 2 .
A duplicated descriptor inherits the lock from its source.
Closing and reopening the underlying file resets the state to
.Dv CAP_CLOEXEC_UNLOCKED .
.Pp
This system call is designed for use by supervisor processes that
delegate file descriptors to children.
Combined with
.Xr cap_xfer_limit 2 ,
it allows a supervisor to guarantee that a delegated descriptor
cannot escape to another process via
.Xr sendmsg 2
.Pq prevented by Dv CAP_XFER_NONE
or via
.Xr execve 2
.Pq prevented by Dv CAP_CLOEXEC_LOCKED .
.Pp
This system call is allowed in capability mode
.Pq see Xr cap_enter 2 .
.Sh RETURN VALUES
.Rv -std
.Sh EXAMPLES
Lock a process descriptor so it cannot survive exec:
.Bd -literal
#include <sys/capsicum.h>
#include <sys/procdesc.h>

int pd;
pid_t pid;

pid = pdfork(&pd, 0);
if (pid == 0) {
	/* child */
	_exit(0);
}

/* Lock the descriptor: child cannot clear CLOEXEC. */
if (cap_cloexec_limit(pd, CAP_CLOEXEC_LOCKED) < 0)
	err(1, "cap_cloexec_limit");

/* Also prevent transfer via SCM_RIGHTS. */
if (cap_xfer_limit(pd, CAP_XFER_NONE) < 0)
	err(1, "cap_xfer_limit");

/* Descriptor topology is now fixed:
 *   - cannot be sent to another process
 *   - cannot survive exec
 *   - FD_CLOEXEC can still be set/cleared without error,
 *     but the lock overrides it at exec time
 */
.Ed
.Sh ERRORS
.Fn cap_cloexec_limit
succeeds unless:
.Bl -tag -width Er
.It Bq Er EBADF
The
.Fa fd
argument is not a valid active descriptor.
.It Bq Er EINVAL
The
.Fa state
argument is not a valid lock state.
.It Bq Er ENOTCAPABLE
The requested
.Fa state
is less restrictive than the current lock state.
The lock can only be tightened, never relaxed.
.It Bq Er ENOSYS
The running kernel was compiled without
.Cd "options CAPABILITY_MODE" .
.El
.Sh SEE ALSO
.Xr cap_clofork_limit 2 ,
.Xr cap_enter 2 ,
.Xr cap_rights_limit 2 ,
.Xr cap_xfer_limit 2 ,
.Xr dup 2 ,
.Xr execve 2 ,
.Xr fcntl 2 ,
.Xr fork 2 ,
.Xr pdfork 2 ,
.Xr capsicum 4
.Sh HISTORY
The
.Fn cap_cloexec_limit
system call first appeared in
.Fx 16.0 .
