5BSD/5BSD/usr.sbin/networkcmpctl/networkcmpctl.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt NETWORKCMPCTL 8
.Os
.Sh NAME
.Nm networkcmpctl
.Nd inspect an injected NetworkCmp component
.Sh SYNOPSIS
.Nm
.Cm config
.Nm
.Cm info
.Nm
.Cm listen
.Nm
.Cm connect
.Ar addr Ar port
.Nm
.Cm udp
.Ar addr Ar port
.Nm
.Cm resolve
.Ar host
.Op Ar service
.Sh DESCRIPTION
.Nm
is a bounded diagnostic client for a NetworkCmp session injected by
.Xr switchboard 8 .
All live operations reach the broker through
.Xr libnetworkcmp 3
and receive no additional network authority; the
.Cm listen
self-test additionally opens one ordinary loopback socket to drive the
listener it was handed.
.Pp
The commands are:
.Bl -tag -width resolve
.It Cm config
Print the canonical service-manifest declaration for this local component.
.It Cm info
Print the negotiated protocol version, feature mask, and resolver result
bound.
.It Cm listen
Exercise the listening-endpoint capability end to end: obtain a listening
descriptor on an OS-assigned loopback port from the broker, connect to it,
accept the connection, and verify a byte flows.
Requires the label's
.Cm listen
policy.
.It Cm connect Ar addr Ar port
Exercise the connect capability: ask the broker to open a connected TCP
socket to the numeric
.Ar addr
and
.Ar port
(bounded by a short timeout).
Subject to the label's connect policy and the internal-destination (SSRF)
filter.
.It Cm udp Ar addr Ar port
Exercise the datagram capability: ask the broker to open a connected
.Dv SOCK_DGRAM
socket to the numeric
.Ar addr
and
.Ar port .
Proves the born-in-capmode broker reaches the UDP connect path (a connected
descriptor, or an ordinary network error, never
.Er ECAPMODE ) .
Subject to the label's connect policy and the internal-destination filter.
.It Cm resolve Ar host Op Ar service
Resolve a name through the component's bounded resolver and print each typed
endpoint.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr libnetworkcmp 3 ,
.Xr switchboard 5 ,
.Xr bsdnetwork 8 ,
.Xr switchboard 8
