5BSD/5BSD/usr.sbin/serviced/serviced.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd August 23, 2026
.Dt SERVICED 8
.Os
.Sh NAME
.Nm serviced
.Nd 5BSD capability-based service manager
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
is the service manager for 5BSD.
It is started by
.Xr authorityd 8
as a single child process via
.Xr pdfork 2
and inherits a mac_capability channel for requesting activation tokens,
channels, coalitions, named capability-service descriptors, and pre-exec
kernel-module prerequisites from the authority.
.Pp
.Nm
scans capability bundles from
.Pa /Capabilities/System
and
.Pa /Capabilities ,
topologically sorts services by dependency, and launches each via
.Xr pdfork 2 .
It supervises service lifecycle through
.Xr kqueue 2
process descriptors, enforces restart policies with linear backoff
and circuit-breaker protection, and operates a naming registry that
allows services to discover and connect to each other by
reverse-domain names.
.Pp
At startup,
.Nm
raises its soft and hard
.Dv RLIMIT_NOFILE
limits to the kernel's
.Va kern.maxfilesperproc
ceiling before launching any program.
Managed programs inherit that ceiling and may lower their own limits with
.Xr setrlimit 2 ;
there is no per-program manifest field.
This raises capacity but grants no additional filesystem or networking
authority to a capability-mode process.
.Pp
At startup,
.Nm
reserves eight confined descriptors that are never available to ordinary
service launches or client sessions.
Before launching a service or brokering a global connection it probes for the
complete required descriptor headroom beyond that reserve and fails the
operation with
.Er EMFILE
or
.Er ENFILE
before partially allocating it.
When descriptor exhaustion prevents an administrative control-connection accept,
one reserve slot is temporarily released to accept and close a queued
connection, preventing a persistent readable-event spin, and is then restored.
The control status output reports the effective soft and hard descriptor
limits, reserve count, denied admissions, and shed control connections.
The
.Dq fd-reserve
and
.Dq fd-pressure
DTrace probes expose initialization and pressure events.
.Pp
Administrative commands are sent via
.Xr servicectl 8
over the
.Ql system.serviced
capability discovery name;
.Nm
binds no control socket.
.Ss Startup Sequence
.Nm
executes the following phases during startup:
.Bl -enum
.It
Inherit the channel fd from the
.Ev AUTHORITYD_CHANNEL_FD
environment variable and optional delegated service instance fds from
.Ev SERVICED_CHANNEL_SVC_FD ,
.Ev SERVICED_COALITION_SVC_FD ,
and
.Ev SERVICED_CAPPROTECT_FD .
.It
Create a
.Xr kqueue 2
and register the authority channel fd for EOF detection (authority death).
.It
Self-serve the
.Ql system.serviced
control name through the naming registry; no filesystem control socket is bound.
.It
Register signal handlers for
.Dv SIGTERM ,
.Dv SIGINT ,
.Dv SIGHUP ,
and
.Dv SIGCHLD .
.It
Apply an inherited capprotect shield, hardening the process against
ptrace, ambient signals (including
.Dv SIGKILL
and
.Dv SIGCONT ) ,
wait, scheduler manipulation, core dumps, and ktrace.
The shield fd is retained for the lifetime of
.Nm ;
failure to activate it is fatal.
.Xr authorityd 8
retains explicit signal authority through the process descriptor returned by
.Xr pdfork 2 ,
so
.Xr pdkill 2
does not require a capprotect authorization token.
.It
Send
.Dv AUTHORITY_OP_READY
to
.Xr authorityd 8
on the channel only after descriptor confinement and protection are active.
.It
Scan application bundles, topologically sort services
by dependency, and fork/exec each service via
.Xr pdfork 2 .
.It
Enter the event loop, monitoring services via process descriptors,
channels, coalition events, adopted in-process control connections, signals,
and restart timers.
.El
.Sh INHERITED FILE DESCRIPTORS
.Nm
inherits the following file descriptors from
.Xr authorityd 8 :
.Bl -tag -width "capprotect (fd 6)"
.It channel (fd 3)
Mac_capability channel back to
.Xr authorityd 8 .
Used to request activation tokens, channels, coalitions, named
capability-service descriptors, and pre-exec kernel-module prerequisites.
Always required.
.It channel_svc (fd 4)
Delegated mac_capability channel service instance.
Allows
.Nm
to create channels for its children directly, without
round-tripping through
.Xr authorityd 8 .
Optional.
.It coalition_svc (fd 5)
Delegated mac_capability coalition service instance.
Allows
.Nm
to create coalitions for process grouping.
Optional.
.It capprotect (fd 6)
Delegated capprotect service instance.
.Nm
uses this to apply an integrity shield at startup and retains it because
closing the descriptor would revoke the shield.
Required.
.El
.Pp
After exec, all manager-owned descriptors are irreversibly restricted against
transfer, fork inheritance, and exec inheritance.
Descriptors intentionally delegated to a service cross only that service's
fork/exec boundary and are non-transferable.
.Sh ENVIRONMENT
.Bl -tag -width "SERVICED_COALITION_SVC_FD"
.It Ev AUTHORITYD_CHANNEL_FD
File descriptor number for the mac_capability channel back to
.Xr authorityd 8 .
Always 3.
Required.
.It Ev SERVICED_CHANNEL_SVC_FD
File descriptor number for the delegated channel service instance.
Optional.
.It Ev SERVICED_COALITION_SVC_FD
File descriptor number for the delegated coalition service instance.
Optional.
.It Ev SERVICED_CAPPROTECT_FD
File descriptor number for the delegated capprotect service instance.
Required.
.It Ev SERVICED_BUNDLE_DIR_SYSTEM
Override the system bundle directory.
Default:
.Pa /Capabilities/System .
Primarily useful for testing.
.It Ev SERVICED_BUNDLE_DIR_USER
Override the user bundle directory.
Default:
.Pa /Capabilities .
Primarily useful for testing.
.El
.Sh SERVICE MANIFESTS
Service manifests are UCL files embedded in capability bundles under
.Pa etc/ .
Each
.Pa *.ucl
file declares one service.
Files are parsed strictly and topologically sorted before launch.
The schema identifier and version are mandatory.
UCL directives, includes, interpolation, implicit arrays, and duplicate keys
are disabled.
An unknown key, wrong type, invalid capability, excess entry, unknown
dependency, duplicate provided name, or dependency cycle rejects the bundle set;
authority declarations are never silently dropped.
.Pp
The authoritative schema, including literal arguments, environment variables,
restart policy, limits, activation, and capability-service discovery, is
documented in
.Xr serviced 5 .
A unit declares no capabilities in its manifest.
.Sh SERVICE BOOTSTRAP
Each launched service receives one versioned, fixed-layout bootstrap object as
a sealed, write-once
.Xr envfd_create 2
environment descriptor at fd 5.
It contains the manifest label and typed tables for the service channel,
optional capprotect instance, activation tokens, and capability services.
The descriptor may cross exactly one fork and one exec boundary, is
non-transferable, becomes close-on-fork and close-on-exec locked in the new
image, and is closed by
.Fn service_acquire
after strict validation.
The non-authoritative
.Ev SERVICE_BOOTSTRAP_FD=5
entry provides classic environment-based discovery.
No token or capability-service descriptor table is encoded in
environment strings.
.Pp
The service channel is fd 3, optional capprotect is fd 4, and authority
descriptors occupy a contiguous range beginning at fd 6: activation tokens
first, then capability-service descriptors.
Because a unit declares no capabilities in its manifest, no path, network, or
system-gate tokens are minted at launch; a service acquires such grants at
runtime by name.
All requested descriptors are installed before
.Xr execve 2 ;
failure to construct or validate the complete set prevents normal service
initialization.
.Pp
A unit reaches network, crypto, and other peers lazily as global services:
the typed library calls
.Fn service_connect
on demand, and
.Nm
activates the peer provider and returns a new direct channel session.
.Nm
is not a data-plane proxy for these sessions.
.Pp
.Fn service_acquire ,
.Fn service_authorize_capabilities ,
.Fn service_capability_open ,
.Fn service_connect ,
.Fn service_worker_protect ,
and
.Fn service_label
from
.Xr libservice 3
are the supported interfaces to this state.
Applications normally use a service-specific typed library, which calls
the one acquisition function appropriate to its fixed scope and hides
descriptor ownership and the wire protocol.
Global discovery and private bundle-local helpers are the only discovery paths.
.Sh SERVICE ENVIRONMENT
Each launched service receives a minimal, non-authority environment:
.Bl -tag -width "PATH"
.It Ev PATH
.Pa /sbin:/bin:/usr/sbin:/usr/bin
.It Ev USER
Set if
.Va user
is specified in the manifest.
.It Ev HOME
Home directory of the service user.
Only set when
.Va user
is specified.
.It Ev CAPABILITY_UNIT_DIR
Absolute path of the selected immutable
.Pa Units/name.unit
directory.
Managed programs use it to locate their bundled
.Pa Config
and
.Pa Resources
content without assuming a registry or versioned installation path.
.It Ar manifest environment
String values declared by the manifest are included.
They may override the default
.Ev PATH ,
.Ev USER ,
and
.Ev HOME
values, but not reserved
.Ev AUTHORITYD_*
or
.Ev SERVICED_*
namespaces,
.Ev SERVICE_BOOTSTRAP_FD ,
or
.Ev CAPABILITY_UNIT_DIR .
.El
.Pp
Standard I/O (fds 0, 1, 2) is redirected to
.Pa /dev/null .
All file descriptors above the bootstrap authority range are closed via
.Xr closefrom 2 .
.Sh SERVICE LIFECYCLE
.Ss Dependency Sorting
Before launch, manifests are topologically sorted using Kahn's
algorithm so that providers start before their dependents.
.Dq AUTHORITYD
is an implicit provider that is always satisfied.
.Pp
Duplicate runtime identities or
.Va activation.ipc
names across manifests are fatal.
A dependency cycle is a fatal error; no services are started.
Unknown providers are rejected before services are launched.
.Ss Fork, Exec, and Coalitions
Each service is launched with
.Xr pdfork 2 ,
yielding a process descriptor that
.Nm
monitors via
.Dv EVFILT_PROCDESC
for
.Dv NOTE_EXEC
(exec confirmed),
.Dv NOTE_CAPMODE
(capability sandbox entered), and
.Dv NOTE_EXIT
(process exited).
The process descriptor is limited to
.Dv CAP_EVENT ,
.Dv CAP_PDGETPID ,
and
.Dv CAP_PDKILL ;
it is non-transferable and locked against later fork or exec propagation.
.Pp
Each service is enlisted in a coalition.
The process descriptor is set as the coalition leader, providing
resource grouping for the service and any children it creates.
Assigned workers are enlisted before the leader is released.
A provider returns either a worker procdesc or a nested worker coalition;
the consuming process never receives coalition-management authority.
.Ss Service States
A service transitions through the following states:
.Bl -tag -width "STOPPING (3)" -compact
.It STOPPED (0)
Not running.
.It STARTING (1)
Process created via
.Xr pdfork 2 ,
awaiting
.Dv NOTE_CAPMODE .
.It RUNNING (2)
.Dv NOTE_CAPMODE
received and independently confirmed with
.Xr pdincapmode 2 ;
the service is executing inside its capability sandbox.
.It STOPPING (3)
Graceful shutdown in progress.
.El
.Ss Restart Policies
.Bl -tag -width "on-failure"
.It Dq never
The service is not restarted.
.It Dq always
The service is restarted unconditionally after exit.
.It Dq on-failure
The service is restarted only if it exited with a non-zero status
or was killed by a signal.
.El
.Ss Linear Backoff
If a service dies within 5 seconds of starting (a rapid restart),
the restart is delayed with linear backoff: the delay is
.Va restart_count
multiplied by 2 seconds (i.e., 2, 4, 6, 8, ...), capped at
30 seconds.
If the service runs for at least 60 seconds, the restart counter
is reset.
.Ss Circuit Breaker
After
.Va max_failures
consecutive rapid failures (default 10), the service is permanently
disabled and not restarted.
A manifest reload via
.Dv SIGHUP
or the
.Cm reload
control command will re-evaluate the manifest.
.Ss Dynamic Claims
A unit declares no capabilities in its manifest, so
.Nm
mints no path, network, or system-gate tokens on a service's behalf when it
launches, and releases none when the service exits.
A service acquires the resources it needs at runtime, by name
.Pq Xr service_open_isolated 3 , Xr service_storage_open 3 , Xr service_ensure_extension 3 , Xr service_enter_namespace 3 .
.Pp
.Xr authorityd 8
remains the isolation authority for the network endpoints claimed at runtime:
if the requested endpoint is not already claimed it auto-claims it with a global
reference count, rejects a claim that overlaps a foreign owner, and releases the
claim from the kernel when its refcount reaches zero.
Policy claims
.Pq from Xr authorityd.conf 5
survive across
.Nm
restarts.
.Ss Graceful Shutdown
When stopping a service,
.Nm
sends
.Dv SIGTERM
via
.Xr pdkill 2
and starts a timer for the service's
.Va stop_timeout
(default 5 seconds).
If the service has not exited when the timer fires,
.Dv SIGKILL
is sent.
.Pp
During daemon shutdown, services are stopped in reverse dependency
order.
The kevent loop is drained for up to 60 seconds, after which
.Nm
exits.
.Sh NAMING REGISTRY
.Nm
provides a naming registry that allows services to discover
and connect to each other using reverse-domain names
(e.g.,
.Dq org.5bsd.sshd ) .
.Pp
The registry is implemented as a hash table with 64 buckets.
Names may be up to 255 characters long.
Each manifest may provide up to eight names.
All names in one declaration map to the same runtime but have independent
provider listeners.
A lookup of any provided name activates that runtime; concurrent requests for
the same runtime, including requests for different names, coalesce onto one
launch.
.Pp
Bundle loading reserves every declared name before its provider runs.
A client lookup therefore has a stable activation target even while the
process is absent.
The first lookup launches the process if necessary; lookups for any sibling
name coalesce onto the same runtime.
Before its initial process-level
.Dv SVC_OP_READY ,
the provider checks in one listener for every declared name using
.Dv SVC_OP_NAME_CLAIM .
.Nm
rejects incomplete or undeclared check-ins.
After the complete check-in, capability-mode entry, and
.Dv SVC_OP_READY ,
.Nm
sends
.Dv SVC_OP_ACTIVATE_NAME
only for requested names.
The provider initializes that endpoint and returns
.Dv SVC_OP_NAME_RESULT .
Successful publication releases only that name's queued sessions.
A failed result fails only that name, and a later lookup may retry it without
affecting ready siblings.
If the provider exits, all pending names owned by that exact runtime fail
immediately.
.Pp
Services interact with the registry via
.Xr libservice 3
over their channel to
.Nm .
Service-specific libraries should wrap these operations so applications do
not repeat names, concurrency rules, or protocol plumbing.
The private control protocol supports:
.Bl -tag -width "ACTIVATE_NAME"
.It Dv NAME_CLAIM
A correlated provider request that checks in one listener for an exact
manifest-reserved name.
It does not publish or initialize the endpoint.
All initially declared names must be claimed before
.Dv READY
succeeds.
.It Dv ACTIVATE_NAME
An unsolicited, token-zero event asking the provider to initialize one
reserved name.
.It Dv NAME_RESULT
A correlated provider request completing one activation with zero or a
positive errno.
Unrequested, stale, undeclared, and late results are rejected.
.It Dv NAME_WITHDRAW
Withdraw one claimed name.
Only the owning service may withdraw it.
Withdrawal during activation cancels that activation, fails its queued
lookups, and makes a late
.Dv NAME_RESULT
stale.
Existing direct sessions remain open.
The manifest reservation remains, so new lookups queue until the running
provider claims a replacement listener and activates it.
.It Dv LOOKUP
Connect to a named service.
.Nm
creates a new mac_capability channel, pushes one end to the provider service
as a
.Dv SVC_OP_NEW_CLIENT
notification (which includes the requesting client's label),
and returns the other end to the requester.
The notification also includes the exact addressed name, and libservice
queues it only on that name's listener.
A service cannot look up itself
.Pq Er ELOOP .
.El
.Pp
Both ends of this private control path use
.Xr libchannel 3 .
.Nm
retains the incoming lookup request while activation is pending and responds
through that request, so the kernel channel token remains the sole correlation
identifier.
Replies and descriptor-bearing events are queued under bounded backpressure
and integrated with kqueue write readiness.
A publication acknowledgement is queued before any
.Dv SVC_OP_NEW_CLIENT
event for that name.
If a control reply cannot be queued, the channel is revoked so callers observe
peer death instead of waiting for a reply that was dropped.
.Pp
When a service exits, all of its claims and published names are automatically
removed, while manifest reservations remain available for a later process
incarnation.
Every restart begins with all names unclaimed; stale check-in or publication
state never transfers to the replacement process.
Pending requests are bound to one exact process incarnation and are freed when
that requester exits; a restarted process cannot consume a reply belonging to
its predecessor.
Loss of the manager channel wakes provider listeners.
.Xr libservice 3
provides a pollable supervisor event descriptor and terminal status query so
libraries can report manager death distinctly from an unknown service name.
.Pp
After lookup, the client and provider communicate over a fresh direct
capability channel.
.Nm
does not proxy the service data stream.
Closing or crashing either peer revokes the other endpoint.
A successful transport send means that the kernel accepted the message; it
does not prove that the provider processed or durably committed the request.
Typed protocols must use nonzero channel reply tokens and typed replies for
processing acknowledgements.
Operations may be retried after a crash only when that protocol defines them
as idempotent.
Exactly-once effects across provider restart require provider-owned durable
request deduplication.
.Sh CONTROL INTERFACE
.Nm
serves an administrative control endpoint over the capability discovery plane
under the name
.Ql system.serviced ;
it binds no filesystem control socket.
A lookup of
.Ql system.serviced
from an admin (SYSTEM-domain) session mints an in-process control connection
carrying administrative rights, which
.Nm
adopts into its own
.Xr kqueue 2 ;
a USER-domain session cannot resolve the name and is denied.
.Pp
The
.Xr servicectl 8
utility communicates with
.Nm
over this endpoint.
.Pp
The following commands are supported:
.Bl -tag -width "SCTL_OP_START_SVC (4)"
.It Dv SCTL_OP_STATUS (1)
Return daemon status and a summary of all loaded services with
their current state, PID, restart policy, and restart count.
Available to any user.
.It Dv SCTL_OP_SERVICES (2)
List all loaded services.
Same output as
.Dv SCTL_OP_STATUS .
Available to any user.
.It Dv SCTL_OP_RELOAD (3)
Reload service bundles from disk.
New services are started, changed manifests trigger a graceful
restart, and removed bundles trigger a graceful stop.
The dependency graph is re-validated before any mutations are
applied; if the new graph contains a cycle, the reload is
rejected and running services are unaffected.
Requires root.
.It Dv SCTL_OP_START_SVC (4)
Start a loaded stopped unit and reset its restart backoff.
The payload is the unit label.
Requires root.
.It Dv SCTL_OP_STOP_SVC (5)
Stop a named service.
The payload is the service label.
Requires root.
.El
Unknown flags, embedded NUL bytes, oversized payloads, and unexpected
payloads are rejected.
.Sh SIGNALS
PID-based signals from foreign program nonces are denied by capprotect.
The signals below remain available to
.Xr authorityd 8
through its exclusive process descriptor and
.Xr pdkill 2 .
.Bl -tag -width "SIGTERM"
.It Dv SIGHUP
Reload service manifests.
Equivalent to
.Dv SCTL_OP_RELOAD .
.It Dv SIGTERM , SIGINT
Initiate graceful shutdown.
All services are stopped in reverse dependency order.
.Nm
exits after all services have terminated or been killed.
.It Dv SIGCHLD
Reap stray child processes.
.El
.Sh DTRACE PROBES
.Nm
provides DTrace USDT probes under the
.Ql serviced
provider.
.Ss Service Lifecycle
.Bl -tag -width "svc-disabled(label, count)" -compact
.It Li svc-start(label, pid)
Service process created.
.It Li svc-exec(label, pid)
Service exec confirmed via
.Dv NOTE_EXEC .
.It Li svc-capmode(label, pid, protocol-ready)
Capability-mode readiness confirmed via
.Dv NOTE_CAPMODE
and
.Xr pdincapmode 2 .
.It Li svc-exit(label, pid, status)
Service process exited.
.It Li svc-restart(label, count)
Service restart initiated.
.It Li svc-stop(label, pid)
Service stop requested.
.It Li svc-load(label)
Service manifest loaded.
.It Li svc-disabled(label, count)
Service disabled by circuit breaker.
.It Li svc-count(n)
Total loaded service count changed.
.El
.Ss Manifest Reload
.Bl -tag -width "svc-removed(label)" -compact
.It Li manifest-reject(path, reason, system)
A malformed or unverifiable manifest was rejected.
.Ar system
is non-zero for the system bundle directory.
.It Li reload(nnew, nchanged, nremoved)
Manifest reload completed.
.It Li svc-removed(label)
Service removed during reload.
.It Li svc-changed(label)
Service manifest changed during reload.
.El
.Ss Naming
.Bl -tag -width "naming-unregister(name)" -compact
.It Li naming-register(name, owner)
Name registered.
.It Li naming-unregister(name)
Name unregistered.
.It Li naming-lookup(name, requester)
Name lookup performed.
.It Li naming-deny(name, errno)
Name operation denied.
.It Li naming-count(n)
Total registered name count changed.
.El
.Ss Endpoint Lifecycle
.Bl -tag -width "endpoint-withdraw(label, name, errno)" -compact
.It Li endpoint-claim(label, name, errno)
A provider attempted to check in one manifest-reserved listener.
.It Li endpoint-activate(label, name)
Client demand requested initialization of one claimed endpoint.
.It Li endpoint-withdraw(label, name, errno)
A provider attempted to withdraw one claimed listener.
.El
.Ss Control Interface
.Bl -tag -width "sctl-cmd-done(op, uid, status, duration_ns)" -compact
.It Li sctl-cmd(op, uid)
Control command received.
.It Li sctl-cmd-done(op, uid, status, duration_ns)
Control command completed.
.It Li sctl-deny(op, uid)
Control command denied (insufficient privileges).
.El
.Ss Capabilities
.Bl -tag -width "cap-service(label, name, result)" -compact
.It Li cap-mint(label, type, result)
Capability token minted.
.It Li cap-service(label, name, result)
Named capability-service descriptor acquired.
.It Li cap-channel(label, result)
Channel created.
.It Li cap-coalition(label, result)
Coalition created.
.El
.Ss Exec Setup
.Bl -tag -width "svc-exec-done(label, duration_ns, ntokens)" -compact
.It Li svc-exec-done(label, duration_ns, ntokens)
Service exec setup completed.
.It Li svc-exec-fail(label, errno)
Service exec setup failed.
.El
.Ss IPC
.Bl -tag -width "ipc-reply(label, op, status)" -compact
.It Li ipc-recv(label, op)
IPC message received from service.
.It Li ipc-reply(label, op, status)
IPC reply sent to service.
.El
.Ss Timeouts
.Bl -tag -width "timeout-fire(label, type)" -compact
.It Li timeout-arm(label, type, seconds)
Timer armed.
.It Li timeout-fire(label, type)
Timer expired.
.El
.Ss Connections
.Bl -tag -width "conn-close(nconns)" -compact
.It Li conn-accept(uid, nconns)
Control connection accepted.
.It Li conn-close(nconns)
Control connection closed.
.El
.Ss Shutdown
.Bl -tag -width "shutdown-done(duration_ns)" -compact
.It Li shutdown-start(nservices)
Graceful shutdown initiated.
.It Li shutdown-done(duration_ns)
Shutdown completed.
.El
.Ss Startup Orchestration
.Bl -tag -width "startup-begin(nservices, ntiers)" -compact
.It Li startup-begin(nservices, ntiers)
Dependency-ordered startup began.
.It Li startup-tier(tier, launched)
A dependency tier was launched.
.It Li startup-done(duration_ms)
Initial startup completed.
.El
.Ss On-Demand Launch
.Bl -tag -width "on-demand-launch(name, requester)" -compact
.It Li on-demand-launch(name, requester)
An on-demand lookup initiated a service launch.
.It Li on-demand-coalesce(name)
Another lookup joined an in-progress launch.
.It Li on-demand-ready(name, nwaiters)
The service became ready and waiting lookups were released.
.It Li on-demand-fail(name, error, nwaiters)
A provider failed before publication and its pending lookups were completed
with an error.
.It Li on-demand-cancel(requester, pid, launch_id, nwaiters)
A requester process exited and its incarnation-bound pending lookups were
discarded.
.It Li on-demand-timeout(name)
An on-demand launch exceeded its readiness deadline.
.El
.Ss Bundle Registry
.Bl -tag -width "bundle-load(name, nservices, system)" -compact
.It Li bundle-load(name, nservices, system)
A bundle was loaded.
.Ar system
is non-zero for a system bundle.
.It Li bundle-scan(dir, nbundles)
A bundle directory scan completed.
.El
.Ss Errors
.Bl -tag -width "authority-disconnected()" -compact
.It Li error(subsys, msg)
Error occurred in subsystem.
.It Li authority-disconnected()
Authority channel closed unexpectedly.
.El
.Sh FILES
.Bl -tag -width "/Capabilities/System/"
.It Pa /Capabilities/System/
System capability bundles.
.It Pa /Capabilities/
User-installed capability bundles.
.El
.Pp
Both bundle directories and all loaded bundle contents must be root-owned and
not group- or world-writable; symlinks and non-regular bundle objects are
rejected before parsing.
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits with an error if the
.Ev AUTHORITYD_CHANNEL_FD
environment variable is not set or the channel fd is invalid.
.Sh EXAMPLES
Minimal bundle and unit manifests:
.Bd -literal -offset indent
# MyService.cap/Bundle.ucl
schema = "org.5bsd.capability-bundle";
schema_version = 1;
bundle_id = "org.example.myservice";
version = "1.0";
sequence = 1;
author = "Example";
units = ["myservice"];

# MyService.cap/Units/myservice.unit/Unit.ucl
activation { boot = true; ipc = ["org.example.myservice"]; }
arguments = ["--foreground"];
environment { APP_MODE = "production"; }
restart = "always";
.Ed
.Pp
See
.Xr serviced 5
for complete capability examples.
.Sh SEE ALSO
.Xr kqueue 2 ,
.Xr pdfork 2 ,
.Xr libservice 3 ,
.Xr mac_capability 4 ,
.Xr authorityd 8 ,
.Xr servicectl 8
.Sh HISTORY
.Nm
first appeared in 5BSD as the service manager for the Authority
capability world.
