5BSD/5BSD/usr.sbin/serviced/serviced.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 30, 2026
.Dt SERVICED 5
.Os
.Sh NAME
.Nm serviced
.Nd capability bundle service manifest format
.Sh DESCRIPTION
.Xr serviced 8
loads service definitions from verified
.Pa .cap
bundles.
A service manifest is a UCL object stored below the bundle's
.Pa etc
directory.
Unknown keys are errors.
.Pp
Runtime identity and public service names are separate.
The private identity is derived from
.Va bundle_id
and
.Va program .
The
.Va provides
array contains only globally connectable endpoint names.
.Sh TOP-LEVEL KEYS
.Bl -tag -width max_failures
.It Va schema
Optional schema identifier.
When present it must be
.Dq org.5bsd.serviced.service .
.It Va schema_version
Required with
.Va schema
and currently
.Dq 1.0.0 .
.It Va bundle_id
Required globally unique bundle identifier.
.It Va version
Bundle version.
.It Va author
Bundle author.
.It Va program
Required executable name below the bundle's
.Pa bin
directory.
Absolute paths and parent traversal are rejected.
.It Va arguments
String array passed after
.Va program .
.It Va environment
Object containing the program's explicit environment.
It cannot override reserved component or bootstrap variables.
.It Va user , group
Execution credentials.
.It Va provides
A string or array of global names exposed by this program.
A provider may declare and expose several names.
Each name is routed to the listener that exposed that exact name.
The declarations form one initial check-in transaction:
the provider cannot report application readiness until every name is claimed.
No name becomes connectable until that complete check-in,
application readiness,
.Nm serviced
independently verifies capability-mode entry, and client demand successfully
activates that particular name.
Sibling names remain independently lazy after the common readiness barrier.
All public named services are launched on first connection.
There are no
.Va on_demand
or
.Va requires
options; global dependencies are acquired dynamically by typed libraries.
.It Va components
One string or an array containing
.Dq filesystem ,
.Dq network ,
or both.
No component options, provider selection, interface version, lifetime, or
sharing keys exist.
The declaration requests a required process-local authority replacement.
.Xr serviced 8
constructs the component before exec, enlists its worker in the consumer's
coalition, and injects its channel through the fixed environment variable
consumed by the typed library.
.It Va restart
One of
.Dq never ,
.Dq on-failure ,
or
.Dq always .
.It Va stop_timeout
Seconds before forced termination.
.It Va max_failures
Circuit-breaker threshold.
.It Va kmod_requires
Kernel modules that the privileged module service must ensure are loaded.
.It Va jail
Optional execution-jail object with
.Va name ,
.Va path ,
.Va hostname ,
and
.Va ip4_addr .
.It Va capabilities
Direct kernel authorities delegated by the Oracle.
Supported groups include
.Va paths ,
.Va files ,
.Va network ,
.Va jails ,
.Va vsock ,
.Va services ,
and
.Va system .
These declarations remain distinct from local components and global services.
.El
.Sh SERVICE EXAMPLE
.Bd -literal -offset indent
schema = "org.5bsd.serviced.service";
schema_version = "1.0.0";
bundle_id = "org.example.index";
version = "1.0.0";
author = "Example";

program = "indexd";
provides = [
    "org.example.index.query",
    "org.example.index.admin"
];
components = ["filesystem", "network"];
restart = "on-failure";
.Ed
.Pp
The provider calls
.Xr service_provider_expose 3
once for each declared name.
Each call checks in that name's listener with
.Nm serviced .
The two names can use different protocols and event loops.
.Sh SCOPE MODEL
.Bl -tag -width "Local component"
.It Local component
Private to one supervised consumer and its coalition.
It replaces ambient filesystem or network authority and is available before
the consumer starts.
It is never looked up by name.
.It Global service
Registered by a first- or third-party provider and connected by an agreed
name.
It runs in its own coalition and is launched on demand.
.It Capability
A kernel-enforced descriptor or token delegated directly to the process.
.El
.Pp
Application code should use a typed library.
The library author fixes the scope: FileSystem and Network use local
components; global service libraries use
.Xr service_connect 3 .
There is no fallback between scopes.
.Sh RESERVED INTERNAL NAMES
The base FileSystem and Network component factories use reserved internal
registration names.
Ordinary client lookup of those names is denied.
Their registration exists only so
.Xr serviced 8
can construct local sessions before consumer exec.
.Sh SEE ALSO
.Xr libservice 3 ,
.Xr serviced 8
