5BSD/5BSD/usr.sbin/serviced/serviced.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd August 23, 2026
.Dt SERVICED 5
.Os
.Sh NAME
.Nm serviced
.Nd capability bundle and unit manifest format
.Sh DESCRIPTION
.Xr serviced 8
loads literal UCL from self-contained
.Pa .cap
directories.
The bundle root contains
.Pa Bundle.ucl ,
optional
.Pa Shared ,
and
.Pa Units .
Each declared unit is
.Pa Units/name.unit
with
.Pa Unit.ucl ,
.Pa bin/name ,
and optional
.Pa Config
and
.Pa Resources
directories.
Other root or unit entries, undeclared units, symlinks, and special objects
are rejected.
.Pp
Manifests are regular files no larger than 1 MiB.
Unknown and duplicate keys, directives, includes, macros, variables, and
implicit arrays fail closed.
The verified tree is limited to 4096 entries, 512 MiB per file, and 2 GiB in
total.
.Sh BUNDLE.UCL
Required keys are:
.Bl -tag -width schema_version
.It Va schema
Must be
.Dq org.5bsd.capability-bundle .
.It Va schema_version
Integer 1.
.It Va bundle_id
Globally unique reverse-domain identity.
.It Va version
Display version string.
.It Va sequence
Positive, monotonically increasing 64-bit installation order.
.It Va units
Exact array of one through 32 lower-case unit names.
.El
.Pp
Optional
.Va author
and
.Va publisher
are display metadata.
The optional
.Va shared
object may contain up to eight
.Va storage
declarations with a unique
.Va name ,
optional
.Va flavor ,
and
.Va lifetime .
.Sh UNIT.UCL
The default program is
.Pa bin/name .
The optional
.Va program
is one filename in that directory, never a path.
.Va arguments
and
.Va environment
contain at most 32 literal entries each.
Reserved bootstrap environment names, including
.Ev SERVICE_BOOTSTRAP_FD
and
.Ev CAPABILITY_UNIT_DIR ,
are rejected.
.Va user
and
.Va group
default to
.Dq capability .
.Pp
Every unit requires an
.Va activation
object.
.Va boot
is a Boolean and
.Va ipc
is one name or an array of at most eight reverse-domain names.
.Va timer
is an object with a single
.Va interval
key, an unsigned count of monotonic seconds; the unit is activated on demand
every interval while it is stopped.
Only monotonic intervals are supported: calendar and cron expressions are
rejected.
.Va path
is an object with a single absolute
.Va path
string; a change to that path
.Pq Dv NOTE_WRITE , NOTE_DELETE , NOTE_RENAME , NOTE_EXTEND , NOTE_ATTRIB
activates the unit on demand.
Path events are only hints: after activation the unit must inspect the current
state of the path itself.
At least one trigger
.Pq Va boot , ipc , timer , No or Va path
is required.
Publishing IPC does not imply boot activation, and a timer or path source does
not launch the unit at boot; it stays stopped until the source fires.
.Pp
.Va restart
is
.Dq never ,
.Dq on-failure ,
or
.Dq always .
.Va stop_timeout
is 1 through 300 seconds and
.Va max_failures
is 1 through 100.
.Va kmod_requires
contains at most eight module names.
An optional
.Va jail
object supplies
.Va name , path , hostname ,
and
.Va ip4_addr .
.Sh STORAGE
The top-level unit
.Va storage
array contains at most eight objects with:
.Bl -tag -width lifetime
.It Va name
Logical descriptor name.
.It Va scope
Required
.Dq unit
or
.Dq shared .
.It Va rights
One name or an array selected from
.Dq props_read ,
.Dq props_write ,
.Dq snapshot ,
.Dq snap_destroy ,
.Dq rollback ,
.Dq clone_src ,
.Dq create ,
.Dq destroy ,
.Dq send ,
.Dq recv ,
.Dq mount ,
.Dq hold ,
and
.Dq release .
.It Va flavor
Optional for unit storage; forbidden on shared references.
.It Va lifetime
.Dq persistent ,
.Dq cache ,
.Dq boot ,
or
.Dq lease .
It is optional for unit storage and forbidden on shared references.
.El
.Pp
A shared reference must match a declaration in
.Pa Bundle.ucl .
Dataset paths are never supplied by the manifest.
.Sh DESCRIPTORS
The optional
.Va descriptors
object accepts the distinct keys
.Va filesystem , network ,
and
.Va crypto .
Network and crypto values are empty objects.
Filesystem requires
.Va storage
naming a declared storage entry with mount rights:
.Bd -literal -offset indent
descriptors {
    filesystem { storage = "data"; }
    network {}
    crypto {}
}
.Ed
.Pp
These are private authority replacements constructed before exec, not global
service names.
.Sh CAPABILITIES
The optional
.Va capabilities
object accepts these closed groups:
.Bl -tag -width services
.It Va paths
At most 16 distinct absolute paths.
.It Va files
At most 16 absolute path/action objects.
Actions are
.Dq lookup , stat , read , write , append , create , delete ,
.Dq rename_from , rename_to , link , exec , setattr , truncate ,
and
.Dq connect .
.It Va network
At most 16 typed IPv4, IPv6, or Bluetooth claims with compatible
.Va domain , protocol , address , prefix , port/ports ,
and
.Va direction
fields.
.It Va jails
At most 16 JID/name selectors with create, get, set, remove, and attach
actions.
.It Va vsock
At most 16 CID, port/range, and direction objects.
.It Va services
At most four names selected from
.Dq mount , node , accounting ,
and
.Dq identity .
.It Va system
Distinct gates selected from
.Dq kldload , kldunload , kldstat , reboot , swapon , swapoff ,
.Dq sysctl , kenv , acct , audit ,
and
.Dq kenv_read .
.El
.Pp
Storage is not a capability sub-group; it is a top-level unit declaration.
.Sh EXAMPLE
.Bd -literal -offset indent
# App.cap/Bundle.ucl
schema = "org.5bsd.capability-bundle";
schema_version = 1;
bundle_id = "org.example.app";
version = "2.0.0";
sequence = 12;
units = ["worker"];

# App.cap/Units/worker.unit/Unit.ucl
arguments = ["--foreground"];
activation { boot = true; ipc = ["org.example.app.worker"]; }
restart = "on-failure";
storage = [{ name = "data"; scope = "unit";
    lifetime = "persistent"; rights = "mount"; }];
descriptors { filesystem { storage = "data"; } network {} }
.Ed
.Sh SEE ALSO
.Xr libcapbundle 3 ,
.Xr libservice 3 ,
.Xr serviced 8 ,
.Xr servicectl 8
