5BSD/5BSD/usr.sbin/serviced/serviced.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 29, 2026
.Dt SERVICED 8
.Os
.Sh NAME
.Nm serviced
.Nd 5BSD capability-based service manager
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
is the service manager for 5BSD.
It is started by
.Xr oracled 8
as a single child process via
.Xr pdfork 2
and inherits a mac_capability channel for requesting activation tokens,
channels, coalitions, named capability-service descriptors, and pre-exec
kernel-module prerequisites from the oracle.
.Pp
.Nm
scans capability bundles from
.Pa /Capabilities/System
and
.Pa /Capabilities ,
topologically sorts services by dependency, and launches each via
.Xr pdfork 2 .
It supervises service lifecycle through
.Xr kqueue 2
process descriptors, enforces restart policies with linear backoff
and circuit-breaker protection, and operates a naming registry that
allows services to discover and connect to each other by
reverse-domain names.
.Pp
Administrative commands are sent via
.Xr servicectl 8
over a local control socket.
.Ss Startup Sequence
.Nm
executes the following phases during startup:
.Bl -enum
.It
Inherit the channel fd from the
.Ev ORACLED_CHANNEL_FD
environment variable and optional delegated service instance fds from
.Ev SERVICED_CHANNEL_SVC_FD ,
.Ev SERVICED_COALITION_SVC_FD ,
and
.Ev SERVICED_CAPPROTECT_FD .
.It
Create a
.Xr kqueue 2
and register the oracle channel fd for EOF detection (oracle death).
.It
Create a control socket at
.Pa /var/run/serviced.sock .
.It
Register signal handlers for
.Dv SIGTERM ,
.Dv SIGINT ,
.Dv SIGHUP ,
and
.Dv SIGCHLD .
.It
Apply an inherited capprotect shield, hardening the process against
ptrace, ambient signals (including
.Dv SIGKILL
and
.Dv SIGCONT ) ,
wait, scheduler manipulation, core dumps, and ktrace.
The shield fd is retained for the lifetime of
.Nm ;
failure to activate it is fatal.
.Xr oracled 8
retains explicit signal authority through the process descriptor returned by
.Xr pdfork 2 ,
so
.Xr pdkill 2
does not require a capprotect authorization token.
.It
Send
.Dv ORACLE_OP_READY
to
.Xr oracled 8
on the channel only after descriptor confinement and protection are active.
.It
Scan application bundles, topologically sort services
by dependency, and fork/exec each service via
.Xr pdfork 2 .
.It
Enter the event loop, monitoring services via process descriptors,
channels, coalition events, control socket connections, signals,
and restart timers.
.El
.Sh INHERITED FILE DESCRIPTORS
.Nm
inherits the following file descriptors from
.Xr oracled 8 :
.Bl -tag -width "capprotect (fd 6)"
.It channel (fd 3)
Mac_capability channel back to
.Xr oracled 8 .
Used to request activation tokens, channels, coalitions, named
capability-service descriptors, and pre-exec kernel-module prerequisites.
Always required.
.It channel_svc (fd 4)
Delegated mac_capability channel service instance.
Allows
.Nm
to create channels for its children directly, without
round-tripping through
.Xr oracled 8 .
Optional.
.It coalition_svc (fd 5)
Delegated mac_capability coalition service instance.
Allows
.Nm
to create coalitions for process grouping.
Optional.
.It capprotect (fd 6)
Delegated capprotect service instance.
.Nm
uses this to apply an integrity shield at startup and retains it because
closing the descriptor would revoke the shield.
Required.
.El
.Pp
After exec, all manager-owned descriptors are irreversibly restricted against
transfer, fork inheritance, and exec inheritance.
Descriptors intentionally delegated to a service cross only that service's
fork/exec boundary and are non-transferable.
.Sh ENVIRONMENT
.Bl -tag -width "SERVICED_COALITION_SVC_FD"
.It Ev ORACLED_CHANNEL_FD
File descriptor number for the mac_capability channel back to
.Xr oracled 8 .
Always 3.
Required.
.It Ev SERVICED_CHANNEL_SVC_FD
File descriptor number for the delegated channel service instance.
Optional.
.It Ev SERVICED_COALITION_SVC_FD
File descriptor number for the delegated coalition service instance.
Optional.
.It Ev SERVICED_CAPPROTECT_FD
File descriptor number for the delegated capprotect service instance.
Required.
.It Ev SERVICED_CONTROL_SOCKET
Path for the control socket.
Default:
.Pa /var/run/serviced.sock .
Optional.
.It Ev SERVICED_BUNDLE_DIR_SYSTEM
Override the system bundle directory.
Default:
.Pa /Capabilities/System .
Primarily useful for testing.
.It Ev SERVICED_BUNDLE_DIR_USER
Override the user bundle directory.
Default:
.Pa /Capabilities .
Primarily useful for testing.
.El
.Sh SERVICE MANIFESTS
Service manifests are UCL files embedded in capability bundles under
.Pa etc/ .
Each
.Pa *.ucl
file declares one service.
Files are parsed strictly and topologically sorted before launch.
An unknown key, wrong type, invalid capability, excess entry, unknown
dependency, missing or ambiguous component provider, mismatched provider pin,
duplicate provider, or dependency cycle rejects the bundle set;
authority declarations are never silently dropped.
.Pp
The authoritative schema, including literal arguments, environment variables,
restart policy, and filesystem, Internet, Bluetooth, VSOCK, jail, and system
capabilities, is documented in
.Xr serviced 5 .
.Sh SERVICE BOOTSTRAP
Each launched service receives one versioned, fixed-layout bootstrap object as
a sealed, write-once
.Xr envfd_create 2
environment descriptor at fd 5.
It contains the manifest label and typed tables for the service channel,
optional capprotect instance, activation tokens, capability services, and
component sessions.
The descriptor may cross exactly one fork and one exec boundary, is
non-transferable, becomes close-on-fork and close-on-exec locked in the new
image, and is closed by
.Fn service_init
after strict validation.
The non-authoritative
.Ev SERVICE_BOOTSTRAP_FD=5
entry provides classic environment-based discovery.
No token, component, or capability-service descriptor table is encoded in
environment strings.
When a standard component interface has an unambiguous successfully injected
local name,
.Nm
also sets
.Ev NETWORKCMP
or
.Ev FILESYSTEMCMP .
These are lookup keys into the sealed descriptor, not descriptor numbers or
provider names.
.Pp
The service channel is fd 3, optional capprotect is fd 4, and authority
descriptors occupy a contiguous range beginning at fd 6.
Tokens appear first in manifest-category order: paths, files, network
endpoints, jail operations, VSOCK endpoints, and finally one combined
system-gate token.
Capability-service descriptors follow, then component-session channels.
All requested descriptors are installed before
.Xr execve 2 ;
failure to construct or validate the complete set prevents normal service
initialization.
.Pp
Before delegation of a component session,
.Nm
performs a typed bootstrap handshake with its provider, requires a procdesc or
nested coalition descriptor for the assigned worker set, and enlists that set
in the consumer coalition.
The application-local component name is stored in the bootstrap;
provider names and options are not exposed to the child.
Component channels are non-transferable and restricted to event polling,
metadata, and the required mac_capability transport ioctls.
.Pp
.Fn service_authorize_capabilities ,
.Fn service_capability_fd ,
.Fn service_component_fd ,
.Fn service_protect ,
and
.Fn service_label
from
.Xr libservice 3
are the supported interfaces to this state.
.Sh SERVICE ENVIRONMENT
Each launched service receives a minimal, non-authority environment:
.Bl -tag -width "PATH"
.It Ev PATH
.Pa /sbin:/bin:/usr/sbin:/usr/bin
.It Ev USER
Set if
.Va user
is specified in the manifest.
.It Ev HOME
Home directory of the service user.
Only set when
.Va user
is specified.
.It Ar manifest environment
String values declared by the manifest are included.
They may override the default
.Ev PATH ,
.Ev USER ,
and
.Ev HOME
values, but not reserved
.Ev ORACLED_*
or
.Ev SERVICED_*
namespaces,
.Ev SERVICE_BOOTSTRAP_FD ,
.Ev NETWORKCMP ,
or
.Ev FILESYSTEMCMP .
.El
.Pp
Standard I/O (fds 0, 1, 2) is redirected to
.Pa /dev/null .
All file descriptors above the bootstrap authority range are closed via
.Xr closefrom 2 .
.Sh SERVICE LIFECYCLE
.Ss Dependency Sorting
Before launch, manifests are topologically sorted using Kahn's
algorithm so that providers start before their dependents.
.Dq ORACLED
is an implicit provider that is always satisfied.
.Pp
Duplicate labels or
.Va provides
names across manifests are fatal.
A dependency cycle is a fatal error; no services are started.
Unknown providers are rejected before services are launched.
.Ss Fork, Exec, and Coalitions
Each service is launched with
.Xr pdfork 2 ,
yielding a process descriptor that
.Nm
monitors via
.Dv EVFILT_PROCDESC
for
.Dv NOTE_EXEC
(exec confirmed),
.Dv NOTE_CAPMODE
(capability sandbox entered), and
.Dv NOTE_EXIT
(process exited).
The process descriptor is limited to
.Dv CAP_EVENT ,
.Dv CAP_PDGETPID ,
and
.Dv CAP_PDKILL ;
it is non-transferable and locked against later fork or exec propagation.
.Pp
Each service is enlisted in a coalition.
The process descriptor is set as the coalition leader, providing
resource grouping for the service and any children it creates.
Assigned component workers are enlisted before the leader is released.
A provider returns either a worker procdesc or a nested worker coalition;
the consuming process never receives coalition-management authority.
.Ss Service States
A service transitions through the following states:
.Bl -tag -width "STOPPING (3)" -compact
.It STOPPED (0)
Not running.
.It STARTING (1)
Process created via
.Xr pdfork 2 ,
awaiting
.Dv NOTE_CAPMODE .
.It RUNNING (2)
.Dv NOTE_CAPMODE
received and independently confirmed with
.Xr pdincapmode 2 ;
the service is executing inside its capability sandbox.
.It STOPPING (3)
Graceful shutdown in progress.
.El
.Ss Restart Policies
.Bl -tag -width "on-failure"
.It Dq never
The service is not restarted.
.It Dq always
The service is restarted unconditionally after exit.
.It Dq on-failure
The service is restarted only if it exited with a non-zero status
or was killed by a signal.
.El
.Ss Linear Backoff
If a service dies within 5 seconds of starting (a rapid restart),
the restart is delayed with linear backoff: the delay is
.Va restart_count
multiplied by 2 seconds (i.e., 2, 4, 6, 8, ...), capped at
30 seconds.
If the service runs for at least 60 seconds, the restart counter
is reset.
.Ss Circuit Breaker
After
.Va max_failures
consecutive rapid failures (default 10), the service is permanently
disabled and not restarted.
A manifest reload via
.Dv SIGHUP
or the
.Cm reload
control socket command will re-evaluate the manifest.
.Ss Dynamic Claims
When
.Nm
launches a service, it mints capability tokens via the oracle
channel.
If the requested resource is not already claimed by the oracle,
the oracle auto-claims it dynamically with a global reference count.
.Pp
When a service exits,
.Nm
releases all capabilities from the service's manifest via the
channel.
Release messages are sent for every path, network endpoint, jail,
and system gate in the manifest.
The oracle decrements refcounts for dynamic claims; claims whose
refcount reaches zero are released from the kernel.
Policy claims
.Pq from Xr oracled.conf 5
return
.Er EPERM
on release, which is silently ignored.
.Pp
If
.Nm
itself exits or crashes, the oracle sweeps all dynamic claims,
releasing them from the kernel.
Policy claims survive across
.Nm
restarts.
.Pp
Releases use a batched send-then-drain pattern: all release messages
are sent in a burst, then replies are drained in a single blocking
window, regardless of how many capabilities are being released.
.Ss Graceful Shutdown
When stopping a service,
.Nm
sends
.Dv SIGTERM
via
.Xr pdkill 2
and starts a timer for the service's
.Va stop_timeout
(default 5 seconds).
If the service has not exited when the timer fires,
.Dv SIGKILL
is sent.
.Pp
During daemon shutdown, services are stopped in reverse dependency
order.
The kevent loop is drained for up to 60 seconds, after which
.Nm
closes the control socket and exits.
.Sh NAMING REGISTRY
.Nm
provides a naming registry that allows services to discover
and connect to each other using reverse-domain names
(e.g.,
.Dq org.5bsd.sshd ) .
.Pp
The registry is implemented as a hash table with 64 buckets.
Names may be up to 255 characters long.
Each service may register up to 32 names.
.Pp
Services interact with the registry via
.Xr libservice 3
over their channel to
.Nm .
The following operations are supported:
.Bl -tag -width "UNREGISTER"
.It Dv REGISTER
Register a reverse-domain name.
The name must contain at least one dot and consist only of
alphanumerics, dots, hyphens, and underscores.
The name must appear in the service's
.Va label
or
.Va provides
array; registration is denied otherwise.
Duplicate names are rejected with
.Er EEXIST .
.It Dv UNREGISTER
Remove a previously registered name.
Only the owning service may unregister a name.
.It Dv LOOKUP
Connect to a named service.
.Nm
creates a new mac_capability channel, pushes one end to the provider service
as a
.Dv SVC_OP_NEW_CLIENT
notification (which includes the requesting client's label),
and returns the other end to the requester.
A service cannot look up itself
.Pq Er ELOOP .
.El
.Pp
When a service exits, all names it registered are automatically
removed.
.Sh CONTROL SOCKET
.Nm
listens on a
.Ux Ns -domain
stream socket at
.Pa /var/run/serviced.sock
(mode 0700).
A maximum of 16 simultaneous connections are accepted, each with
a 2-second timeout.
.Pp
The
.Xr servicectl 8
utility communicates with
.Nm
over this socket.
.Pp
The following commands are supported:
.Bl -tag -width "SCTL_OP_STOP_SVC (6)"
.It Dv SCTL_OP_STATUS (1)
Return daemon status and a summary of all loaded services with
their current state, PID, restart policy, and restart count.
Available to any user.
.It Dv SCTL_OP_SERVICES (2)
List all loaded services.
Same output as
.Dv SCTL_OP_STATUS .
Available to any user.
.It Dv SCTL_OP_RELOAD (3)
Reload service bundles from disk.
New services are started, changed manifests trigger a graceful
restart, and removed bundles trigger a graceful stop.
The dependency graph is re-validated before any mutations are
applied; if the new graph contains a cycle, the reload is
rejected and running services are unaffected.
Requires root.
.It Dv SCTL_OP_CHECK (4)
Legacy op, no longer supported.
Returns
.Er ENOTSUP .
Use
.Cm servicectl verify
instead.
.It Dv SCTL_OP_LOAD (5)
Legacy op, no longer supported.
Returns
.Er ENOTSUP .
Use
.Cm servicectl install
+
.Cm reload
instead.
.It Dv SCTL_OP_STOP_SVC (6)
Stop a named service.
The payload is the service label.
Requires root.
.El
.Sh SIGNALS
PID-based signals from foreign program nonces are denied by capprotect.
The signals below remain available to
.Xr oracled 8
through its exclusive process descriptor and
.Xr pdkill 2 .
.Bl -tag -width "SIGTERM"
.It Dv SIGHUP
Reload service manifests.
Equivalent to
.Dv SCTL_OP_RELOAD .
.It Dv SIGTERM , SIGINT
Initiate graceful shutdown.
All services are stopped in reverse dependency order.
.Nm
exits after all services have terminated or been killed.
.It Dv SIGCHLD
Reap stray child processes.
.El
.Sh DTRACE PROBES
.Nm
provides DTrace USDT probes under the
.Ql serviced
provider.
.Ss Service Lifecycle
.Bl -tag -width "svc-disabled(label, count)" -compact
.It Li svc-start(label, pid)
Service process created.
.It Li svc-exec(label, pid)
Service exec confirmed via
.Dv NOTE_EXEC .
.It Li svc-capmode(label, pid, protocol-ready)
Capability-mode readiness confirmed via
.Dv NOTE_CAPMODE
and
.Xr pdincapmode 2 .
.It Li svc-exit(label, pid, status)
Service process exited.
.It Li svc-restart(label, count)
Service restart initiated.
.It Li svc-stop(label, pid)
Service stop requested.
.It Li svc-load(label)
Service manifest loaded.
.It Li svc-disabled(label, count)
Service disabled by circuit breaker.
.It Li svc-count(n)
Total loaded service count changed.
.El
.Ss Manifest Reload
.Bl -tag -width "svc-removed(label)" -compact
.It Li manifest-reject(path, reason, system)
A malformed or unverifiable manifest was rejected.
.Ar system
is non-zero for the system bundle directory.
.It Li reload(nnew, nchanged, nremoved)
Manifest reload completed.
.It Li svc-removed(label)
Service removed during reload.
.It Li svc-changed(label)
Service manifest changed during reload.
.El
.Ss Naming
.Bl -tag -width "naming-unregister(name)" -compact
.It Li naming-register(name, owner)
Name registered.
.It Li naming-unregister(name)
Name unregistered.
.It Li naming-lookup(name, requester)
Name lookup performed.
.It Li naming-deny(name, errno)
Name operation denied.
.It Li naming-count(n)
Total registered name count changed.
.El
.Ss Control Socket
.Bl -tag -width "sctl-cmd-done(op, uid, status, duration_ns)" -compact
.It Li sctl-cmd(op, uid)
Control command received.
.It Li sctl-cmd-done(op, uid, status, duration_ns)
Control command completed.
.It Li sctl-deny(op, uid)
Control command denied (insufficient privileges).
.El
.Ss Capabilities
.Bl -tag -width "cap-service(label, name, result)" -compact
.It Li cap-mint(label, type, result)
Capability token minted.
.It Li cap-service(label, name, result)
Named capability-service descriptor acquired.
.It Li cap-channel(label, result)
Channel created.
.It Li cap-coalition(label, result)
Coalition created.
.El
.Ss Components
.Bl -tag -width "component-resolve(label, name, provider, scope)" -compact
.It Li component-resolve(label, name, provider, scope)
Provider resolution began.
.It Li component-session(label, name, provider, result)
Bootstrap, membership validation, and session setup completed or failed.
.It Li component-inject(label, name, fd)
An attenuated component client channel was selected for exec.
.El
.Ss Exec Setup
.Bl -tag -width "bootstrap-create(label, ntokens, ndescriptors, result)" -compact
.It Li bootstrap-create(label, ntokens, ndescriptors, result)
Typed bootstrap descriptor creation completed or failed.
.It Li svc-exec-done(label, duration_ns, ntokens)
Service exec setup completed.
.It Li svc-exec-fail(label, errno)
Service exec setup failed.
.El
.Ss IPC
.Bl -tag -width "ipc-reply(label, op, status)" -compact
.It Li ipc-recv(label, op)
IPC message received from service.
.It Li ipc-reply(label, op, status)
IPC reply sent to service.
.El
.Ss Timeouts
.Bl -tag -width "timeout-fire(label, type)" -compact
.It Li timeout-arm(label, type, seconds)
Timer armed.
.It Li timeout-fire(label, type)
Timer expired.
.El
.Ss Connections
.Bl -tag -width "conn-close(nconns)" -compact
.It Li conn-accept(uid, nconns)
Control socket connection accepted.
.It Li conn-close(nconns)
Control socket connection closed.
.El
.Ss Shutdown
.Bl -tag -width "shutdown-done(duration_ns)" -compact
.It Li shutdown-start(nservices)
Graceful shutdown initiated.
.It Li shutdown-done(duration_ns)
Shutdown completed.
.El
.Ss Startup Orchestration
.Bl -tag -width "startup-begin(nservices, ntiers)" -compact
.It Li startup-begin(nservices, ntiers)
Dependency-ordered startup began.
.It Li startup-tier(tier, launched)
A dependency tier was launched.
.It Li startup-done(duration_ms)
Initial startup completed.
.El
.Ss On-Demand Launch
.Bl -tag -width "on-demand-launch(name, requester)" -compact
.It Li on-demand-launch(name, requester)
An on-demand lookup initiated a service launch.
.It Li on-demand-coalesce(name)
Another lookup joined an in-progress launch.
.It Li on-demand-ready(name, nwaiters)
The service became ready and waiting lookups were released.
.It Li on-demand-timeout(name)
An on-demand launch exceeded its readiness deadline.
.El
.Ss Bundle Registry
.Bl -tag -width "bundle-load(name, nservices, system)" -compact
.It Li bundle-load(name, nservices, system)
A bundle was loaded.
.Ar system
is non-zero for a system bundle.
.It Li bundle-scan(dir, nbundles)
A bundle directory scan completed.
.El
.Ss Errors
.Bl -tag -width "oracle-disconnected()" -compact
.It Li error(subsys, msg)
Error occurred in subsystem.
.It Li oracle-disconnected()
Oracle channel closed unexpectedly.
.El
.Sh FILES
.Bl -tag -width "/var/run/serviced.sock"
.It Pa /Capabilities/System/
System capability bundles.
.It Pa /Capabilities/
User-installed capability bundles.
.It Pa /var/run/serviced.sock
Control socket (mode 0700).
.El
.Pp
Both bundle directories and all loaded bundle contents must be root-owned and
not group- or world-writable; symlinks and non-regular bundle objects are
rejected before parsing.
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits with an error if the
.Ev ORACLED_CHANNEL_FD
environment variable is not set or the channel fd is invalid.
.Sh EXAMPLES
Minimal bundle service manifest:
.Bd -literal -offset indent
# myservice.ucl
bundle_id = "org.example.myservice";
version = "1.0";
author = "Example";
program = "myservice";
provides = ["org.example.myservice"];
arguments = ["--foreground"];
environment { APP_MODE = "production"; }
restart = "always";
.Ed
.Pp
See
.Xr serviced 5
for complete capability examples.
.Sh SEE ALSO
.Xr kqueue 2 ,
.Xr pdfork 2 ,
.Xr libservice 3 ,
.Xr mac_capability 4 ,
.Xr oracled 8 ,
.Xr servicectl 8
.Sh HISTORY
.Nm
first appeared in 5BSD as the service manager for the Oracle
capability world.
