5BSD/5BSD/usr.sbin/logd/logd.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt LOGD 8
.Os
.Sh NAME
.Nm logd
.Nd capability-mode structured logging component
.Sh DESCRIPTION
.Nm
is the base provider for
.Dq system.Log
version
.Dq 5.0.0 .
It runs only from
.Pa /Capabilities/System/Log.cap .
Each global service connection creates an isolated worker and bounded
single-producer record ring.
The client sends an edge-coalesced wakeup when a shared ring changes from
empty to nonempty, and the worker drains the burst through
.Xr kqueue 2 .
A bounded periodic timer is retained only as a lost-wakeup fallback, so record
publication requires neither polling latency nor a control message per record.
An explicit flush drains all records published before the request, submits
their redacted representations to the syslog capability, drains the worker's
bounded internal storage ring, and synchronizes the LogCmp store before
replying.  It does not claim that syslogd has committed its separate copy to
stable storage.
The worker enters capability mode and forwards validated records through a
separately limited
.Dq system.syslog
Casper channel.  Durable records cross from the worker to the storage manager
through a second single-producer shared-memory ring; its socket carries only
edge notifications, lifecycle control, and explicit flush barriers.
The storage manager drains active rings in bounded round-robin batches, so a
continuously active producer cannot prevent other sessions from making
progress.
.Pp
Retained-record queries are served from the private store and are always
restricted to the authenticated serviced client label associated with the
session.
The protocol has no identity override flag and no fallback to an all-system
view.
Long scans are divided into bounded record, byte, and segment slices so one
query cannot monopolize the storage-manager event loop.
The typed client hides those internal continuations while preserving one
overall operation deadline.
.Pp
The provider adds the trusted service label, component instance, provider
sequence, realtime receive timestamp, and monotonic receive timestamp at the
sink.
Clients supply a subsystem, category, normalized severity, privacy class,
message text, an optional event timestamp, and bounded typed non-reserved
attributes.
The provider overwrites both receive clocks before any record reaches syslog
or retained storage, so a client cannot forge ingestion ordering.
Private fields are retained as the literal
.Dq <private> .
Private-hash fields are retained as a 128-bit hexadecimal digest keyed with a
random 256-bit storage-manager epoch key.
The key is never written to the store and is erased when the manager exits, so
equal values can be correlated only within one running storage epoch and
cannot be compared across restarts.
Neither private representation exposes its source value through syslog or a
retained query.
Ring exhaustion is explicit and observable through total and per-severity
drop counters; it never overwrites unread records.
Each session also has an administrator-configured fixed-window ingestion
budget.  Records below the configured severity threshold and records beyond
the session budget advance sequence accounting but do not reach either the
private store or syslog.  Separate filtered and rate-limited counters make
these deliberate losses distinguishable from malformed records and
client-ring exhaustion.
.Pp
At startup the provider reads
.Pa /etc/logd.conf .
The file must be a regular, non-symlink file owned by root or the daemon's
effective user, must not be group- or world-writable, and is limited to 64 KiB.
The strict UCL configuration accepts only
.Va ring_size ,
a power of two from 64 KiB through 64 MiB, and
.Va fallback_drain_ms ,
from 1 through 1000 milliseconds.  The default one-second scan is a
lost-wakeup safety net; normal ingestion is edge-woken and hot rings are
rescheduled through a bounded fair-work queue,
.Va segment_size ,
from 64 KiB through 1 GiB, and
.Va max_segments ,
from 1 through 1024 completed segments,
.Va minimum_severity ,
from 1 through 24, and the paired
.Va rate_limit_interval_ms
and
.Va rate_limit_burst
values.
The rate interval is at most one hour and the burst at most one million
records.  Both rate values may be zero to disable limiting; setting only one
to zero is invalid.
The default retains 64 completed segments plus the active segment.
Unknown keys, incorrect types, and values outside those bounds prevent
startup.
.Pp
Segment rotation synchronizes both file contents and directory namespace
changes.  On restart, the store reconstructs the next generation from
completed segment names if a crash occurred after rotating the old active
segment or after creating an empty successor.  Incomplete trailing records in
the active segment are truncated to the last checksummed boundary; corruption
inside a complete record fails closed.
.Sh SECURITY
Workers cannot open files, sockets, or other sinks.
They cannot fork or execute and neither the syslog capability nor ring
consumer descriptors can be transferred to the client.
The global provider remains outside consumer coalitions.
Session creation and rejected records are audited through OpenBSM.
Lifecycle, accepted-record, drop, flush, persistence, rotation, corruption,
and scoped-query paths expose DTrace probes.
.Sh DTRACE PROBES
The
.Dq logd_provider
provider exports
.Sy session-start ,
.Sy record-write ,
.Sy record-drop ,
.Sy wakeup-receive ,
.Sy batch-drain ,
.Sy flush-complete ,
.Sy storage-persist ,
.Sy storage-rotate ,
.Sy storage-corruption ,
and
.Sy query-complete .
Result and error arguments are zero on success or an
.Xr errno 2
value on failure.
Record payloads and private field values are never probe arguments.
.Sh SEE ALSO
.Xr liblogcmp 3 ,
.Xr libshmring 3 ,
.Xr capsicum 4 ,
.Xr serviced 8 ,
.Xr syslogd 8
