5BSD/5BSD/usr.sbin/filesystemcmpctl/filesystemcmpctl.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt FILESYSTEMCMPCTL 8
.Os
.Sh NAME
.Nm filesystemcmpctl
.Nd inspect an injected FileSystemCmp component
.Sh SYNOPSIS
.Nm
.Cm config
.Nm
.Cm info
.Nm
.Cm stat
.Ar namespace path
.Sh DESCRIPTION
.Nm
is a bounded diagnostic client for a FileSystemCmp session injected by
.Xr serviced 8 .
All live operations use
.Xr libfilesystemcmp 3 ;
the utility never discovers a global provider and receives no additional
filesystem authority.
.Pp
The commands are:
.Bl -tag -width config
.It Cm config
Print the canonical service-manifest declaration for this local component.
.It Cm info
Print the negotiated protocol version, feature mask, byte ceiling, and object
ceiling.
.It Cm stat Ar namespace path
Resolve and report one object in the
.Dq scratch ,
.Dq persistent ,
or
.Dq bundle
namespace.
Resolution is confined to the delegated namespace root.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr libfilesystemcmp 3 ,
.Xr serviced 5 ,
.Xr localfilesystem 8 ,
.Xr serviced 8
