5BSD/5BSD/usr.sbin/filesystemcmp/filesystemcmp.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 29, 2026
.Dt FILESYSTEMCMP 8
.Os
.Sh NAME
.Nm filesystemcmp
.Nd capability-mode scratch FileSystemCmp provider
.Sh DESCRIPTION
.Nm
is the base-system provider for
.Dq org.5bsd.cmp.filesystem
version
.Dq 1.0.0 .
It is installed and executed only as
.Pa /Capabilities/System/FileSystemCmp.cap/bin/filesystemcmp ;
it is not an ambient
.Pa /usr/sbin
daemon.
.Pp
For each private component request,
.Nm
creates a separate worker and in-memory store.
The worker enters Capsicum capability mode before accepting filesystem
operations, returns its process descriptor to
.Xr serviced 8 ,
and is enlisted in the consuming service coalition before that service
executes.
No vnode or backing-store descriptor is exposed to the consumer.
Session and readiness descriptors are non-transferable, survive only the
single worker fork, and are locked against exec propagation.
.Pp
The component request
.Va options
object accepts
.Va max_bytes ,
.Va max_objects ,
and
.Va max_file_bytes .
Unknown options and non-private scopes are rejected.
.Sh SECURITY
Object handles contain a generation number to reject stale handles.
Names are single path components: empty names,
.Ql \&. ,
.Ql .. ,
slashes, embedded NUL bytes, and names longer than 255 bytes are rejected.
Modes are reduced to owner-only permissions.
All mutating policy decisions and rejected sessions are available to the
OpenBSM audit subsystem, and protocol activity is observable through the
FileSystemCmp DTrace provider.
.Sh SEE ALSO
.Xr libfilesystemcmp 3 ,
.Xr capsicum 4 ,
.Xr serviced 5 ,
.Xr serviced 8
