5BSD/5BSD/usr.sbin/filesystemcmp/filesystemcmp.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt FILESYSTEMCMP 8
.Os
.Sh NAME
.Nm filesystemcmp
.Nd capability-mode FileSystemCmp provider
.Sh DESCRIPTION
.Nm
is the base-system provider for
.Dq org.5bsd.filesystem
version
.Dq 1.0.0 .
It is installed and executed only as
.Pa /Capabilities/System/FileSystemCmp.cap/bin/filesystemcmp ;
it is not an ambient
.Pa /usr/sbin
daemon.
.Pp
For each private component request,
.Nm
creates a separate worker with three isolated namespaces:
.Bl -tag -width persistent
.It Cm scratch
A quota-bounded in-memory tree destroyed with the worker.
.It Cm persistent
A quota-bounded directory tree that survives worker and consumer restarts.
.It Cm bundle
A read-only tree rooted at the verified consumer
.Pa .cap
bundle.
.El
.Pp
The broker passes the persistent and bundle roots as attenuated directory
descriptors during the provider bootstrap.
The worker enters Capsicum capability mode before accepting filesystem
operations or traversing either tree, returns its process descriptor to
.Xr serviced 8 ,
and is enlisted in the consuming service coalition before that service
executes.
No vnode or backing-store descriptor is exposed to the consumer.
All disk-backed lookup remains descriptor-relative and rejects symbolic links
and non-file, non-directory objects.
Cross-namespace rename fails with
.Er EXDEV ,
and every mutation of the bundle namespace fails with
.Er EROFS .
Session and readiness descriptors are non-transferable, survive only the
single worker fork, and are locked against exec propagation.
.Pp
The component bootstrap carries no manifest-selected options or scope.
The provider fixes the initial limits at 64 MiB total, 4096 objects, and
16 MiB per file.
The byte quota for the persistent namespace includes files present when the
worker starts; file growth is checked before each write.
.Pp
An explicit sync request calls
.Xr fsync 2
on the provider-owned object descriptor.
Clients sync a file for data and metadata durability and sync affected
directories after namespace mutations.
Scratch sync is a no-op.
.Pp
The wire protocol remains handle-relative.
The
.Xr libfilesystemcmp 3
path-context API implements independent logical current directories by
decomposing paths into these component operations.
It never changes the worker's process cwd.
An explicit duplicate operation creates an independently closeable handle,
so the library does not expose the root or cwd handles it retains internally.
.Sh SECURITY
Object handles contain a generation number to reject stale handles.
Names are single path components: empty names,
.Ql \&. ,
.Ql .. ,
slashes, embedded NUL bytes, and names longer than 255 bytes are rejected.
Modes are reduced to owner-only permissions.
All mutating policy decisions and rejected sessions are available to the
OpenBSM audit subsystem, and protocol activity is observable through the
.Dq filesystemcmp_provider
DTrace provider.
.Sh SEE ALSO
.Xr fsync 2 ,
.Xr libfilesystemcmp 3 ,
.Xr capsicum 4 ,
.Xr serviced 5 ,
.Xr serviced 8
