5BSD/5BSD/usr.sbin/oraclectl/oraclectl.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd May 27, 2026
.Dt ORACLECTL 8
.Os
.Sh NAME
.Nm oraclectl
.Nd control interface for oracled
.Sh SYNOPSIS
.Nm
.Op Fl s Ar socket
.Cm status
.Nm
.Op Fl s Ar socket
.Cm services Op Fl v
.Nm
.Op Fl s Ar socket
.Cm verify
.Nm
.Op Fl s Ar socket
.Cm shutdown
.Nm
.Op Fl s Ar socket
.Cm reload
.Nm
.Op Fl s Ar socket
.Cm kldload Ar module
.Nm
.Op Fl s Ar socket
.Cm kldunload Ar module
.Nm
.Op Fl s Ar socket
.Cm reboot
.Sh DESCRIPTION
.Nm
sends administrative commands to a running
.Xr oracled 8
instance via its control socket.
.Pp
The
.Fl s
option specifies an alternate socket path (default:
.Pa /var/run/oracled.sock ) .
This is needed when
.Xr oracled 8
is configured with a non-default
.Va control_socket
path.
Each invocation connects, sends a single command, prints the
result, and exits.
.Pp
The following commands are available:
.Bl -tag -width "kldunload module"
.It Cm status
Query the daemon's status and uptime.
The output includes:
.Bl -tag -width "SERVICED" -compact
.It Sy CONFIG
Configuration file path and service manager binary.
.It Sy INTEGRITY
Active
.Xr cap_rt_capprotect 4
shield flags.
.It Sy CLAIMS
All active resource claims, grouped by type (paths, network, jails,
system gates).
Each claim is annotated with its provenance:
.Ql [policy]
for claims from
.Xr oracled.conf 5
or
.Ql [service, refcount=N]
for dynamic claims created at runtime.
Each claim is verified against the kernel via
.Dv FI_OP_QUERY ;
claims the kernel no longer holds are marked
.Ql [NOT HELD] .
.It Sy SERVICED
Ready/not-ready status and PID of
.Xr serviced 8 .
.El
.Pp
This command does not require root privileges.
.It Cm services Op Fl v
List all loaded services with their current state, process ID,
uptime, and restart policy.
If
.Fl v
is specified, also show each service's program path, user,
group, capability paths, network claims, system gates,
provides, and requires.
Services with manifests on disk but not yet loaded are shown
in a separate
.Dq AVAILABLE
section.
This command does not require root privileges.
.It Cm verify
Cross-check
.Xr oracled.conf 5
claims against all service manifests in the manifest directory.
Reports capability paths, network endpoints, jails, and system gates
requested by services that are not covered by any active oracle claim.
Checks against all active claims, including dynamic claims held at the
time of the query.
This command does not require root privileges.
.It Cm shutdown
Request a graceful shutdown of
.Xr oracled 8 .
The daemon terminates its process subtree, releases all capability
runtime resources, and exits.
Requires root.
.It Cm reload
Re-scan the manifest directory and diff against running services.
New manifests are loaded and started, changed manifests cause
a graceful restart, and removed manifests cause a graceful stop.
Prints a summary of what was added, changed, and removed.
Requires root.
.It Cm kldload Ar module
Load a kernel module through
.Xr oracled 8 .
The module is loaded by the daemon process, which may hold
privileges or isolation claims that the caller does not.
Requires root.
.It Cm kldunload Ar module
Unload a kernel module through
.Xr oracled 8 .
Requires root.
.It Cm reboot
Initiate a system reboot through
.Xr oracled 8 .
The daemon performs a graceful shutdown before rebooting.
Requires root.
.El
.Sh EXIT STATUS
.Ex -std
.Pp
Privileged commands return
.Er EX_NOPERM
when executed by a non-root user.
If
.Xr oracled 8
is not running,
.Nm
exits with
.Er EX_UNAVAILABLE .
.Sh FILES
.Bl -tag -width "/var/run/oracled.sock"
.It Pa /var/run/oracled.sock
Unix domain socket used to communicate with
.Xr oracled 8 .
.El
.Sh SEE ALSO
.Xr kldload 8 ,
.Xr oracled 8 ,
.Xr reboot 8 ,
.Xr servicectl 8
.Sh HISTORY
.Nm
first appeared in 5BSD.
