5BSD/5BSD/usr.sbin/kldmgrctl/kldmgrctl.8
." SPDX-License-Identifier: BSD-2-Clause
.Dd July 31, 2026
.Dt KLDMGRCTL 8
.Os
.Sh NAME
.Nm kldmgrctl
.Nd validate kldmgrd policy and inspect modules through its typed service
.Sh SYNOPSIS
.Nm
.Cm configtest
.Op Ar file
.Nm
.Cm list
.Nm
.Cm load
.Ar module
.Nm
.Cm unload
.Ar module
.Sh DESCRIPTION
.Cm configtest
validates the explicit-label allow list used by
.Xr kldmgrd 8 ,
defaulting to
.Pa /etc/kldmgrd.allow .
A missing or empty file is valid and means default deny.
.Cm list
uses
.Xr libkldmgr 3
to request the bounded module list.
.Cm load
and
.Cm unload
request the corresponding privileged operation and print the resulting kernel
linker identifier.
The daemon's exact-label policy remains authoritative for every operation.
.Sh SEE ALSO
.Xr libkldmgr 3 ,
.Xr kldmgrd 8
