5BSD/5BSD/usr.sbin/waspnest/waspnest.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.Dd September 6, 2026
.Dt WASPNEST 8
.Os
.Sh NAME
.Nm waspnest
.Nd virtual-machine component
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
daemon is the virtual-machine authority.
Its eventual role is to run full virtual machines under
.Xr bhyve 8 ,
which remains the underlying hypervisor engine;
today it brokers
.Em vsock
.Pq VM socket
endpoints, a duty removed from
.Xr serviced 8
when the manifest capability block was removed entirely.
It is a socket-free capability-plane service: it exposes the well-known name
.Dq Li system.Waspnest
and serves each client on its own
.Xr mac_capability 4
channel.
The discovery
.Em domain
layer resolves
.Dq Li system.Waspnest
only for SYSTEM-domain clients.
.Pp
Obtaining a vsock is
.Em consumer self-service :
a program asks for one at runtime by calling
.Xr service_vsock_listen 3
or
.Xr service_vsock_connect 3 ,
whose library resolves
.Nm
and drives it.
A process in capability mode cannot bind or connect a vsock address itself
.Pq it names a global namespace ;
.Nm ,
which owns the vsock transport, performs the operation on the caller's behalf
and returns the resulting descriptor:
.Bl -tag -width ".Sy VSOCK_CONNECT"
.It Sy VSOCK_BIND
Bind and listen a host-local
.Pq Dv VMADDR_CID_LOCAL
.Dv AF_VSOCK
socket and return the listening descriptor to
.Xr accept 2
on.
The wire
.Va port
is only an
.Em index
into the caller's own label-scoped port window, never a concrete port; the
reply echoes the concrete host-local CID and port bound, which a peer can then
dial.
.It Sy VSOCK_CONNECT
Dial a concrete
.Pq Va cid , Va port
a peer advertised from its own
.Sy VSOCK_BIND
reply and return the connected
.Dv AF_VSOCK
socket.
Here
.Va port
is the concrete advertised port
.Pq not a window index ,
and
.Va cid
must name a real peer, never the wildcard
.Dv VMADDR_CID_ANY .
.It Sy VSOCK_LIST
Report the caller's own port window: the host-local
.Pq Dv VMADDR_CID_LOCAL
CID, the window's base port, its exclusive upper bound, and the number of ports
in it.
The answer is drawn strictly from the window the parent's registry resolved for
this connecting label, so a worker can only ever report its own label's window
and never another's.
This operation is data-only; no descriptor rides the reply.
.El
.Pp
.Nm
is never driven by
.Xr serviced 8
on a unit's behalf, and a unit does not declare a vsock in its manifest.
.Pp
.Nm
is a
.Em broker ,
not a second isolation authority: it holds the vsock transport and re-delivers
endpoints, but mints no isolation claims of its own.
It scopes each caller to a
.Em port window
derived from the caller's unforgeable channel label; the wire request names only
an index within that window, so one consumer can never name or bind another's
port.
.Pp
.Nm
is launched and supervised by
.Xr serviced 8
from the
.Pa /Capabilities/System/Waspnest.cap
bundle on demand
.Pq the first consumer that asks for a vsock pulls it up ;
it is not started by
.Xr init 8 ,
and it is not intended to be run from the command line.
.Ss Operation
.Nm
runs as root and, unlike most capability-plane providers, NOT in capability
mode: the vsock transport and
.Xr bhyve 8
management need device access and a global-namespace lookup
.Pq Xr loadat 2 / Xr openat 2 of the tool and its libraries ,
both of which capsicum forbids.
Its authority is the caller's channel label, not the capsicum sandbox.
Each accepted client is served on its own
.Xr pdfork 2 Ns 'd
worker.
.Sh FILES
.Bl -tag -width ".Pa /Capabilities/System/Waspnest.cap" -compact
.It Pa /Capabilities/System/Waspnest.cap
capability bundle shipping
.Nm
.El
.Sh DTRACE PROBES
The
.Dq waspnest
provider exports
.Sy vsock-list ,
which fires when a
.Sy VSOCK_LIST
request is answered with the client label and the caller's window base and
exclusive upper-bound ports, together with the result.
The result argument is zero on success or an
.Xr errno 2
value on failure.
.Sh SEE ALSO
.Xr pdfork 2 ,
.Xr socket 2 ,
.Xr service_vsock_connect 3 ,
.Xr service_vsock_listen 3 ,
.Xr mac_capability 4 ,
.Xr vsock 4 ,
.Xr bhyve 8 ,
.Xr serviced 8 ,
.Xr warden 8
.Sh HISTORY
The
.Nm
daemon appeared in
.Fx 5BSD .
It takes over vsock brokering formerly performed by
.Xr serviced 8
as part of moving privileged work out of PID 1 and behind named,
domain-restricted, socket-free services, and is the foundation for running full
virtual machines as a capability-plane component.
.Sh AUTHORS
.An Kory Heard
