5BSD/5BSD/usr.sbin/oracled/oracled.conf.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt ORACLED.CONF 5
.Os
.Sh NAME
.Nm oracled.conf
.Nd configuration file for the Oracle authority daemon
.Sh DESCRIPTION
The
.Nm
file configures the
.Xr oracled 8
daemon.
It uses
UCL format.
The default location is
.Pa /etc/oracled.conf .
.Pp
If the configuration file does not exist,
compiled-in defaults are used.
Syntax errors in the configuration file are fatal and cause
.Xr oracled 8
to exit.
Unknown keys are silently ignored.
.Ss General
The following top-level keys are recognized:
.Bl -tag -width "serviced_control_socket"
.It Va pidfile
Path to the pidfile.
Default:
.Pa /var/run/oracled.pid .
.It Va control_socket
Path to the control socket.
Default:
.Pa /var/run/oracled.sock .
.It Va control_socket_mode
Quoted octal file mode for the control socket.
Default:
.Dq 0700 .
.It Va manifest_dir
Legacy service manifest directory used by control-command policy
verification.
Default:
.Pa /etc/serviced.d .
.It Va service_manager
Path to the first managed process started by
.Xr oracled 8 .
Default:
.Pa /usr/libexec/serviced .
If set to an empty string, no service manager is started.
May be overridden with
.Xr oracled 8 Ns 's
.Fl b
option.
.It Va serviced_control_socket
Path to the control socket for
.Xr serviced 8 ,
passed via the
.Ev SERVICED_CONTROL_SOCKET
environment variable.
Default: empty (serviced uses its compiled-in default).
.El
.Ss Integrity
The
.Va integrity
section is an object whose keys are booleans controlling
.Xr cap_rt_capprotect 4
shield flags that protect the
.Xr oracled 8
process from external interference.
.Bl -tag -width "visible"
.It Va ptrace
Block ptrace attach from foreign nonces.
Maps to
.Dv CP_SF_PTRACE .
Default: true.
.It Va signal
Block all signals except
.Dv SIGKILL
and
.Dv SIGCONT
from foreign nonces.
Maps to
.Dv CP_SF_SIGNAL .
Default: false.
Enabling this prevents
.Xr rc 8
from stopping
.Xr oracled 8
via signals; use the control socket for shutdown instead.
.It Va visible
Hide
.Xr oracled 8
from
.Xr ps 1 ,
.Xr top 1 ,
and procfs enumeration.
Maps to
.Dv CP_SF_VISIBLE .
Default: false.
.It Va wait
Block
.Xr wait4 2
from non-parent processes.
Maps to
.Dv CP_SF_WAIT .
Default: true.
.It Va sched
Block scheduler priority and CPU affinity manipulation.
Maps to
.Dv CP_SF_SCHED .
Default: true.
.It Va core
Suppress core dumps to prevent leaking secrets from process memory.
Maps to
.Dv CP_SF_CORE .
Default: false.
.It Va ktrace
Block passive syscall tracing via
.Xr ktrace 1 .
Maps to
.Dv CP_SF_KTRACE .
Default: true.
.El
.Ss Claims
The
.Va claims
section lists resources to be claimed exclusively by
.Xr oracled 8
at boot via the
.Xr cap_rt_isolation 4
service.
Once claimed, MACF hooks deny access from all other processes,
including root.
.Pa /dev/cap_rt
is always claimed automatically regardless of configuration.
.Pp
Claims declared here are
.Em policy claims
.Pq Dv CLAIM_SOURCE_POLICY .
They are acquired at boot, survive
.Xr serviced 8
restarts, and cannot be released via the pair channel.
.Pp
Resources requested by services but not listed here are auto-claimed
dynamically at runtime with reference counting.
These
.Em dynamic claims
are released from the kernel when no service needs them.
.Xr oraclectl 8
.Cm status
shows
.Ql [policy]
for manifest claims and
.Ql [service, refcount=N]
for dynamic claims.
.Pp
Claim limits: at most 64 paths, 32 network claims, and 32 jail claims.
.Bl -tag -width "network"
.It Va paths
Array of absolute paths to files or directories to claim.
Claiming a file blocks open, stat, chmod, chown, and other
vnode operations.
Claiming a directory blocks lookup into the subtree,
preventing access to all files within.
Paths on network filesystems (NFS, FUSE) may block at boot if the
server is unreachable; to protect a network mount point, claim the
parent directory instead.
Default: empty.
.It Va network
Array of network endpoint objects to claim.
Each object supports the following keys:
.Bl -tag -width "direction"
.It Va port Pq or Va ports
Port number, range, or wildcard.
May be an integer, a range string
.Pq e.g., Dq 80-8000 ,
.Dq *
for all ports (0\(en65535), or
.Dq .\&<1024
for privileged ports (0\(en1023).
Optional; default is all ports (0\(en65535).
.Va ports
is accepted as an alias for
.Va port .
.It Va protocol
.Dq tcp ,
.Dq udp ,
.Dq any ,
or
.Dq * .
Default:
.Dq tcp .
.It Va direction
.Dq bind ,
.Dq connect ,
.Dq any ,
or
.Dq * .
Default:
.Dq bind .
.It Va domain
.Dq inet ,
.Dq inet6 ,
.Dq any ,
or
.Dq * .
Default:
.Dq inet .
.It Va address
IP address or CIDR prefix.
An IPv4 or IPv6 address without a prefix length matches a single host.
CIDR notation
.Pq e.g., Dq 192.0.2.0/24 No or Dq 2001:db8::/32
matches a network.
.Dq *
matches any address.
Optional; if omitted, any address is matched.
.El
.Pp
Foreign nonces receive
.Er EACCES
on bind or connect to claimed endpoints.
Default: empty.
.It Va jails
Array of jail claims.
Each element may be:
.Bl -dash -compact
.It
An integer jail ID (all actions are claimed).
.It
A string jail name (all actions are claimed).
.It
An object with the following keys:
.Bl -tag -width "actions" -compact
.It Va jid
Integer jail ID.
0 or omitted means not specified.
.It Va name
String jail name.
Empty or omitted means not specified.
.It Va actions
.Dq *
or
.Dq all
for all actions, or an array of:
.Dq create ,
.Dq get ,
.Dq set ,
.Dq remove ,
.Dq attach .
.It Va path
Allowed root path prefix for jail creation.
Optional.
.El
.El
.Pp
Default: empty.
.It Va system
Array of system gate names to claim via the
.Xr cap_rt_system 4
service.
Once claimed, the gated operation is denied to all processes
unless they hold an authorized token from
.Xr oracled 8 .
Available gate names:
.Dq kldload ,
.Dq kldunload ,
.Dq kldstat ,
.Dq reboot ,
.Dq swapon ,
.Dq swapoff ,
.Dq sysctl ,
.Dq kenv ,
.Dq kenv_read ,
.Dq acct ,
.Dq audit .
Default: empty.
.El
.Sh EXAMPLES
Minimal configuration relying on compiled-in defaults:
.Bd -literal -offset indent
pidfile = "/var/run/oracled.pid";
control_socket = "/var/run/oracled.sock";
manifest_dir = "/etc/serviced.d";
service_manager = "/usr/libexec/serviced";
.Ed
.Pp
Full integrity hardening.
Note that enabling
.Va signal
prevents
.Xr rc 8
from sending signals to
.Xr oracled 8 :
.Bd -literal -offset indent
integrity {
    ptrace = true;
    signal = true;
    visible = true;
    wait = true;
    sched = true;
    core = true;
    ktrace = true;
}
.Ed
.Pp
Claim sensitive files, a privileged port range on a specific subnet,
jail resources, and system operations:
.Bd -literal -offset indent
claims {
    paths = [
        "/dev/mem",
        "/dev/kmem",
        "/etc/master.passwd",
        "/boot/kernel",
    ];
    network = [
        {
            port = ".<1024";
            protocol = "tcp";
            direction = "bind";
            domain = "inet";
            address = "192.0.2.0/24";
        },
        {
            port = 8443;
            protocol = "tcp";
            direction = "bind";
            domain = "inet6";
            address = "2001:db8::/32";
        },
    ];
    jails = [
        "webjail",
        {
            name = "dbjail";
            actions = ["create", "attach"];
            path = "/usr/local/jails/dbjail";
        },
    ];
    system = ["kldload", "kldunload", "reboot", "sysctl"];
}
.Ed
.Sh SEE ALSO
.Xr cap_rt 4 ,
.Xr cap_rt_capprotect 4 ,
.Xr cap_rt_isolation 4 ,
.Xr cap_rt_system 4 ,
.Xr oracled 8 ,
.Xr oraclectl 8 ,
.Xr serviced 8
