5BSD/5BSD/usr.sbin/oracled/oracled.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd May 27, 2026
.Dt ORACLED 8
.Os
.Sh NAME
.Nm oracled
.Nd Oracle capability-world service manager
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl f Ar conffile
.Op Fl p Ar pidfile
.Op Fl T
.Sh DESCRIPTION
.Nm
is the system authority for the Oracle capability world \(em a thin
layer that claims system resources via the
.Xr cap_rt 4
capability runtime and delegates them to services by fork/exec'ing
declared programs and passing capability tokens.
.Nm
does not implement system operations itself; it starts programs that do.
.Pp
It is started by
.Xr rc 8 .
The default installation ships a standard set of system services
(kernel module loading, reboot, sysctl, etc.) in
.Pa /usr/libexec/oracled/ ,
each with a manifest in
.Pa /etc/oracled.d/ .
Developers may replace any service by providing their own binary
and manifest.
.Pp
During startup,
.Nm
executes the following phases:
.Bl -enum
.It
Load configuration from
.Pa /etc/oracled.conf
(or the path given with
.Fl f ) ,
open syslog, acquire pidfile.
.It
Daemonize (unless foreground mode).
.It
Harden the process via
.Xr procctl 2
(subtree reaper, OOM protection, trace disable, signal-exit logging).
.It
Open
.Pa /dev/cap_rt
and, if configured, claim it via the isolation service so that only
.Nm
can access the device.
.It
Activate the capprotect shield with the flags specified in the
configuration file.
.It
Create a control socket for administrative commands.
.It
Enter the event loop.
.El
.Pp
Administrative commands are sent via
.Xr oraclectl 8 .
.Sh OPTIONS
.Bl -tag -width "-f conffile"
.It Fl d
Run in the foreground and log to standard error as well as syslog.
.It Fl f Ar conffile
Read configuration from
.Ar conffile
instead of
.Pa /etc/oracled.conf .
.It Fl p Ar pidfile
Write the process ID to
.Ar pidfile
instead of the configured pidfile path.
Overrides the
.Va pidfile
setting in the configuration file.
.It Fl T
Test mode.
Run without requiring root, without daemonizing, and without
applying privileged process controls, capability runtime setup,
or the control socket.
Intended for automated tests.
.El
.Sh CONFIGURATION
.Nm
reads its configuration from
.Pa /etc/oracled.conf
in UCL format.
The configuration file is optional \(em if it does not exist,
compiled-in defaults are used.
Syntax errors are fatal.
.Pp
The following keys are supported:
.Bl -tag -width "control_socket_mode"
.It Va pidfile
Path to the pidfile.
Default:
.Pa /var/run/oracled.pid .
.It Va control_socket
Path to the control socket.
Default:
.Pa /var/run/oracled.sock .
.It Va control_socket_mode
File mode for the control socket.
Default: 0700 (root only).
.El
.Ss Integrity
The
.Va integrity
section controls capprotect flags that protect
.Nm
from external interference.
Each key is a boolean (true/false).
.Bl -tag -width "visible"
.It Va ptrace
Block ptrace attach from foreign nonces.
Default: true.
.It Va signal
Block all signals except SIGKILL and SIGCONT from foreign nonces.
Default: false.
Enabling this prevents
.Xr rc 8
from stopping
.Nm
via signals; use
.Xr oraclectl 8
for shutdown instead.
.It Va visible
Hide
.Nm
from
.Xr ps 1 ,
.Xr top 1 ,
and procfs enumeration.
Default: false.
.It Va wait
Block wait4 from non-parent processes.
Default: true.
.It Va sched
Block scheduler priority and CPU affinity manipulation.
Default: true.
.It Va core
Suppress core dumps to prevent leaking secrets from process memory.
Default: false.
.It Va ktrace
Block passive syscall tracing via
.Xr ktrace 1 .
Default: true.
.El
.Ss Claims
The
.Va claims
section lists resources under oracle control.
Resources listed here are claimed exclusively by
.Nm
at boot via the cap_rt isolation service.
Once claimed, MACF hooks deny access from all other processes,
including root.
.Pa /dev/cap_rt
is always claimed automatically.
.Bl -tag -width "network"
.It Va paths
Array of file and directory paths to claim.
Claiming a file blocks open, stat, chmod, chown, and other
vnode operations.
Claiming a directory blocks lookup into the subtree,
preventing access to all files within.
Default: empty.
.It Va network
Array of network endpoint objects to claim.
Each object has:
.Va port
(integer),
.Va protocol
("tcp" or "udp"),
.Va direction
("bind", "connect", or "any"),
and optionally
.Va domain
("inet6" or "any"; default is IPv4).
Foreign nonces receive
.Er EACCES
on bind or connect to claimed endpoints.
Default: empty.
.It Va system
Array of system operation names to gate via the
.Xr cap_rt_system 4
service.
Once claimed, even root is denied unless holding an authorized
token from
.Nm .
Available operations:
.Dq kldload ,
.Dq kldunload ,
.Dq kldstat ,
.Dq reboot ,
.Dq swapon ,
.Dq swapoff ,
.Dq sysctl ,
.Dq kenv ,
.Dq acct ,
.Dq audit ,
.Dq kenv_read .
Default: empty (no system operations gated).
.El
.Sh FILES
.Bl -tag -width "/usr/libexec/oracled/"
.It Pa /etc/oracled.conf
Configuration file (UCL format).
Optional.
.It Pa /etc/oracled.d/
Service manifest directory.
Each
.Pa *.ucl
file declares a service for
.Nm
to start, its dependencies, and the capability tokens it requires.
.It Pa /usr/libexec/oracled/
Default system service binaries.
These implement system operations (kldload, reboot, sysctl, etc.)
and are started by
.Nm
at boot.
Replaceable by providing alternate manifests in
.Pa /etc/oracled.d/ .
.It Pa /var/run/oracled.pid
Default pidfile.
.It Pa /var/run/oracled.sock
Default control socket (mode 0700).
.It Pa /dev/cap_rt
CAP_RT control device, isolated by
.Nm
when configured.
.El
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits with an error if the configuration file contains syntax errors.
.Sh EXAMPLES
Minimal configuration with full integrity hardening:
.Bd -literal -offset indent
integrity {
    ptrace = true;
    signal = true;
    visible = true;
    wait = true;
    sched = true;
    core = true;
    ktrace = true;
}
.Ed
.Pp
Claim sensitive files and a privileged port:
.Bd -literal -offset indent
claims {
    paths = [
        "/dev/mem",
        "/boot/kernel",
    ];
    network = [
        { port = 443; protocol = "tcp"; direction = "bind"; },
    ];
}
.Ed
.Sh SEE ALSO
.Xr kqueue 2 ,
.Xr procctl 2 ,
.Xr cap_rt 4 ,
.Xr oraclectl 8 ,
.Xr rc 8
.Sh HISTORY
.Nm
first appeared in 5BSD as the initial Oracle userspace service manager.
