5BSD/5BSD/usr.sbin/oracled/oracled.8
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt ORACLED 8
.Os
.Sh NAME
.Nm oracled
.Nd Oracle authority daemon
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl b Ar bootstrap
.Op Fl f Ar conffile
.Op Fl p Ar pidfile
.Op Fl T
.Sh DESCRIPTION
.Nm
is the system authority daemon for the Oracle capability world.
It claims system resources exclusively via the
.Xr cap_rt 4
capability runtime, protects its own integrity via
.Xr cap_rt_capprotect 4 ,
and manages a single bootstrap child process, typically
.Xr serviced 8 ,
which reads capability bundles and supervises individual services.
.Pp
.Nm
does not start or manage services directly.
It mints capability tokens on request from
.Xr serviced 8
via the oracle protocol, a message-passing channel over a cap_rt
pair descriptor.
.Pp
.Nm
is started by
.Xr rc 8 .
.Pp
During startup,
.Nm
executes the following phases:
.Bl -enum
.It
Load configuration from
.Pa /etc/oracled.conf
(or the path given with
.Fl f ) ,
open syslog, acquire pidfile.
.It
Daemonize (unless
.Fl d
or
.Fl T
is given).
.It
Harden the process via
.Xr procctl 2
(subtree reaper, OOM protection, trace disable, signal-exit logging).
.It
Open
.Pa /dev/cap_rt
and claim configured resources via the
.Xr cap_rt_isolation 4
service.
.It
Claim system gates via the
.Xr cap_rt_system 4
service.
.It
Activate the
.Xr cap_rt_capprotect 4
shield with the flags specified in the configuration file.
.It
Create a control socket for administrative commands.
.It
Start
.Xr serviced 8
as a single child process via
.Xr pdfork 2 .
.It
Enter the event loop, monitoring the serviced process descriptor
and control socket connections via
.Xr kqueue 2 .
.El
.Sh OPTIONS
.Bl -tag -width "-b bootstrap"
.It Fl b Ar bootstrap
Start
.Ar bootstrap
as the first managed process instead of the configured
.Va service_manager .
.It Fl d
Run in the foreground and log to standard error as well as syslog.
.It Fl f Ar conffile
Read configuration from
.Ar conffile
instead of
.Pa /etc/oracled.conf .
.It Fl p Ar pidfile
Write the process ID to
.Ar pidfile
instead of the configured pidfile path.
Overrides the
.Va pidfile
setting in the configuration file.
.It Fl T
Test mode.
Run in the foreground without daemonizing, without
.Xr cap_rt 4
or control socket hardening.
Manifests are parsed but services are not launched.
Intended for automated tests.
.El
.Sh CONFIGURATION
.Nm
reads its configuration from
.Pa /etc/oracled.conf
in UCL format.
The configuration file is optional \(em if it does not exist,
compiled-in defaults are used.
Syntax errors are fatal.
.Pp
The following keys are supported:
.Bl -tag -width "serviced_control_socket"
.It Va pidfile
Path to the pidfile.
Default:
.Pa /var/run/oracled.pid .
.It Va control_socket
Path to the control socket.
Default:
.Pa /var/run/oracled.sock .
.It Va control_socket_mode
File mode for the control socket.
Default: 0700 (root only).
.It Va service_manager
Path to the first managed process started by
.Nm
at bootstrap.
Default:
.Pa /usr/libexec/serviced .
If empty, no service manager is started.
May be overridden with
.Fl b .
.It Va serviced_control_socket
Path to the control socket for
.Xr serviced 8 .
Passed via the
.Ev SERVICED_CONTROL_SOCKET
environment variable.
Default: empty.
.El
.Ss Integrity
The
.Va integrity
section controls
.Xr cap_rt_capprotect 4
flags that protect
.Nm
from external interference.
Each key is a boolean (true/false).
The default integrity flags are
.Dv CP_SF_PTRACE | CP_SF_WAIT | CP_SF_SCHED | CP_SF_KTRACE .
.Bl -tag -width "visible"
.It Va ptrace
Block ptrace attach from foreign nonces.
Default: true.
.It Va signal
Block all signals except SIGKILL and SIGCONT from foreign nonces.
Default: false.
Enabling this prevents
.Xr rc 8
from stopping
.Nm
via signals; use the control socket for shutdown instead.
.It Va visible
Hide
.Nm
from
.Xr ps 1 ,
.Xr top 1 ,
and procfs enumeration.
Default: false.
.It Va wait
Block wait4 from non-parent processes.
Default: true.
.It Va sched
Block scheduler priority and CPU affinity manipulation.
Default: true.
.It Va core
Suppress core dumps to prevent leaking secrets from process memory.
Default: false.
.It Va ktrace
Block passive syscall tracing via
.Xr ktrace 1 .
Default: true.
.El
.Ss Claims
The
.Va claims
section lists resources under oracle control.
Resources listed here are
.Em policy claims :
claimed exclusively by
.Nm
at boot via the
.Xr cap_rt_isolation 4
service.
Once claimed, MACF hooks deny access from all other processes,
including root.
.Pa /dev/cap_rt
is always claimed automatically.
.Pp
Claim limits: at most 64 paths, 32 network claims, and 32 jail claims.
.Pp
.Bf -symbolic
Paths on network filesystems (NFS, FUSE) may block during
.Xr open 2
if the server is unreachable.
.Nm
opens claimed paths with
.Dv O_NONBLOCK ,
which prevents blocking on FIFOs and device nodes, but does not
help with network filesystems because the block occurs during
VFS name resolution.
To protect a network mount point without contacting the server,
claim the parent directory instead (e.g.,
.Pa /mnt
rather than
.Pa /mnt/nfs ) .
A future
.Dv FI_OP_CLAIM_PATH
operation that performs path resolution kernel-side with
.Dv NOCROSSMOUNT
would resolve this limitation.
.Ef
.Ss Dynamic Claims
Resources not pre-declared in
.Nm oracled.conf
are
.Em auto-claimed
on the first mint request from
.Xr serviced 8 .
These
.Em dynamic claims
.Pq Dv CLAIM_SOURCE_SERVICE
are reference-counted: each mint or explicit claim bumps the
refcount; each release decrements it.
When the refcount reaches zero, the kernel claim is released and the
entry is removed from the oracle's state.
.Pp
Policy claims
.Pq from Nm oracled.conf
are immortal and cannot be released via the pair channel.
Release attempts return
.Er EPERM ,
which
.Xr serviced 8
silently ignores.
.Pp
When
.Xr serviced 8
exits or crashes, all dynamic claims are swept: released from the
kernel and removed from the oracle's state.
Policy claims survive across serviced restarts.
.Pp
On configuration reload
.Pq Dv SIGHUP ,
dynamic claims are carried forward.
If a dynamic claim now appears in the reloaded configuration, it is
upgraded to a policy claim and becomes immortal.
.Pp
.Xr oraclectl 8
.Cm status
annotates each claim with its provenance:
.Ql [policy]
for manifest claims or
.Ql [service, refcount=N]
for dynamic claims.
.Bl -tag -width "network"
.It Va paths
Array of file and directory paths to claim.
Claiming a file blocks open, stat, chmod, chown, and other
vnode operations.
Claiming a directory blocks lookup into the subtree,
preventing access to all files within.
Default: empty.
.It Va network
Array of network endpoint objects to claim.
Each object has:
.Va port
(integer, range string such as
.Dq 80-8000 ,
.Dq *
for all ports, or
.Dq .\&<1024
for privileged ports),
.Va protocol
.Pq Dq tcp , Dq udp , Dq any , No or Dq * ,
.Va direction
.Pq Dq bind , Dq connect , Dq any , No or Dq * ,
and optionally
.Va domain
.Pq Dq inet , Dq inet6 , Dq any , No or Dq * ; No default is Dq inet
and
.Va address
(CIDR notation or
.Dq * ;
optional).
Foreign nonces receive
.Er EACCES
on bind or connect to claimed endpoints.
Default: empty.
.It Va jails
Array of jail claims.
Each element may be an integer JID, a string jail name, or an
object with:
.Va jid
(integer),
.Va name
(string),
.Va actions
.Pq Dq * No or array of Dq create , Dq get , Dq set , Dq remove , Dq attach ,
and optionally
.Va path
(jail root path).
Default: empty.
.It Va system
Array of system operation names to gate via the
.Xr cap_rt_system 4
service.
Once claimed, even root is denied unless holding an authorized
token from
.Nm .
Available operations:
.Dq kldload ,
.Dq kldunload ,
.Dq kldstat ,
.Dq reboot ,
.Dq swapon ,
.Dq swapoff ,
.Dq sysctl ,
.Dq kenv ,
.Dq kenv_read ,
.Dq acct ,
.Dq audit .
Default: empty (no system operations gated).
.El
.Sh CONTROL SOCKET
.Nm
listens on a Unix domain socket at
.Pa /var/run/oracled.sock
(mode 0700 by default) for administrative commands.
The socket accepts at most 16 concurrent connections with a
2-second timeout per operation.
The protocol version is 1.
.Pp
The following operations are supported:
.Bl -tag -width "CTL_OP_SHUTDOWN (1)"
.It Dv CTL_OP_SHUTDOWN (1)
Initiate graceful shutdown.
Root only.
.It Dv CTL_OP_STATUS (2)
Query daemon status, active claims, and integrity flags.
Any user.
.It Dv CTL_OP_RELOAD (3)
Reload configuration, update claims, and forward
.Dv SIGHUP
to
.Xr serviced 8 .
Root only.
.El
.Pp
Service management commands (check, load, services) are handled by
.Xr serviced 8
via
.Xr servicectl 8 .
.Sh SIGNALS
.Bl -tag -width "SIGTERM, SIGINT"
.It Dv SIGHUP
Reload configuration, update claims (acquiring new claims and
releasing removed ones), and forward
.Dv SIGHUP
to
.Xr serviced 8 .
.It Dv SIGTERM , SIGINT
Initiate graceful shutdown.
.It Dv SIGCHLD
Reap children and restart
.Xr serviced 8
according to the restart policy.
.El
.Pp
The serviced restart policy uses exponential backoff.
If
.Xr serviced 8
runs for at least 5 seconds, the crash counter resets and restart
is immediate.
If it crashes within 5 seconds, the delay starts at 1 second and
doubles up to a maximum of 30 seconds.
After 10 consecutive fast crashes, the circuit breaker trips and
.Nm
gives up restarting.
.Sh DTRACE PROBES
.Nm
is instrumented with DTrace USDT probes in the
.Ql oracled
provider.
Probes are zero-cost when DTrace is not attached.
.Pp
.Em Lifecycle:
.Bl -tag -width "shutdown-done(duration_ns)" -compact
.It Li startup
Daemon initialization complete.
.It Li shutdown(reason)
Daemon shutting down.
Reason is a signal number or 0 for control socket shutdown.
.It Li shutdown-done(duration_ns)
Shutdown sequence complete.
.It Li config-load(path)
Configuration file parsed.
.El
.Pp
.Em Claims:
.Bl -tag -width "claim-net-release(port_min, port_max, protocol)" -compact
.It Li claim-path(path)
File or directory claimed successfully.
.It Li claim-path-fail(path)
File or directory claim failed.
.It Li claim-path-release(path)
Path claim released.
.It Li claim-net(port_min, port_max, protocol)
Network endpoint claimed.
.It Li claim-net-fail(port_min, port_max, protocol)
Network endpoint claim failed.
.It Li claim-net-release(port_min, port_max, protocol)
Network claim released.
.It Li claim-jail-release(name, actions)
Jail claim released.
.It Li claim-system-release(gates)
System gates released.
.El
.Pp
.Em Dynamic Claims:
.Bl -tag -width "dyn-release-net(port_min, port_max, protocol, refcount, result)" -compact
.It Li dyn-claim-path(path, result)
Dynamic path claim created or refcount bumped.
.It Li dyn-claim-net(port_min, port_max, protocol, result)
Dynamic network claim created or refcount bumped.
.It Li dyn-claim-jail(name, actions, result)
Dynamic jail claim created or refcount bumped.
.It Li dyn-claim-system(gates, result)
Dynamic system gate claim created or refcount bumped.
.It Li dyn-release-path(path, refcount, result)
Dynamic path claim released.
Refcount is the value after decrement.
.It Li dyn-release-net(port_min, port_max, protocol, refcount, result)
Dynamic network claim released.
.It Li dyn-release-jail(name, actions, refcount, result)
Dynamic jail claim released.
.It Li dyn-release-system(gates, released, result)
Dynamic system gate claim released.
.Ar released
is the bitmask of gates whose refcount reached zero.
.El
.Pp
.Em Integrity:
.Bl -tag -width "integrity(flags)" -compact
.It Li integrity(flags)
Capprotect integrity shield activated.
.El
.Pp
.Em Control:
.Bl -tag -width "ctl-cmd-done(op, uid, status, duration_ns)" -compact
.It Li ctl-accept(uid)
Control socket connection accepted.
.It Li ctl-cmd(op, uid)
Control command dispatched.
.It Li ctl-cmd-done(op, uid, status, duration_ns)
Control command completed.
.It Li ctl-deny(op, uid)
Control command denied (EPERM).
.El
.Pp
.Em Reload:
.Bl -tag -width "reload-claims-done(acquired, released, failed)" -compact
.It Li reload()
Configuration reload initiated.
.It Li reload-claims-start(nacquire, nrelease)
Claim delta computation complete.
.It Li reload-claims-done(acquired, released, failed)
Claim update complete.
.El
.Pp
.Em Minting:
.Bl -tag -width "mint-system(gates, result)" -compact
.It Li mint-path(path, result)
Path isolation token minted.
.It Li mint-net(port_min, port_max, protocol, result)
Network isolation token minted.
.It Li mint-jail(jid, name, actions, result)
Jail isolation token minted.
.It Li mint-system(gates, result)
System gate token minted.
.It Li create-jail(name, result)
Jail created.
.It Li pair-create(result)
Pair channel created.
.It Li coalition-create(result)
Coalition created.
.El
.Pp
.Em IPC:
.Bl -tag -width "ipc-dispatch-done(op, status, duration_ns)" -compact
.It Li ipc-recv(op)
Oracle protocol message received from serviced.
.It Li ipc-reply(op, status)
Oracle protocol reply sent.
.It Li ipc-dispatch-done(op, status, duration_ns)
Oracle protocol dispatch complete.
.El
.Pp
.Em Bootstrap:
.Bl -tag -width "bootstrap-restart(count, delay_sec)" -compact
.It Li bootstrap-start(pid)
Serviced process started.
.It Li bootstrap-exit(pid, status)
Serviced process exited.
.It Li bootstrap-restart(count, delay_sec)
Serviced restart scheduled.
.El
.Pp
.Em Connections:
.Bl -tag -width "conn-count(nconns)" -compact
.It Li conn-count(nconns)
Control socket connection count changed.
.El
.Pp
.Em Errors:
.Bl -tag -width "error(subsys, msg)" -compact
.It Li error(subsys, msg)
Notable error.
.El
.Pp
Example: trace all minting operations:
.Bd -literal -offset indent
dtrace -n 'oracled*:::mint-*'
.Ed
.Pp
Example: trace serviced lifecycle:
.Bd -literal -offset indent
dtrace -n 'oracled*:::bootstrap-*'
.Ed
.Pp
Example: trace dynamic claim acquisition:
.Bd -literal -offset indent
dtrace -n 'oracled*:::dyn-claim-* { printf("%s result=%d",
    copyinstr(arg0), arg1); }'
.Ed
.Pp
Example: trace dynamic claim release with refcount:
.Bd -literal -offset indent
dtrace -n 'oracled*:::dyn-release-* { printf("refcount=%d result=%d",
    arg1, arg2); }'
.Ed
.Sh FILES
.Bl -tag -width "/usr/libexec/serviced"
.It Pa /etc/oracled.conf
Configuration file (UCL format).
Optional.
.It Pa /usr/libexec/serviced
Default service manager binary.
Started by
.Nm
as its single child process.
.It Pa /var/run/oracled.pid
Default pidfile.
.It Pa /var/run/oracled.sock
Default control socket (mode 0700).
.It Pa /dev/cap_rt
CAP_RT control device, claimed exclusively by
.Nm
at startup.
.El
.Sh EXIT STATUS
.Ex -std
.Pp
.Nm
exits with an error if the configuration file contains syntax errors,
if the pidfile cannot be acquired, or if required
.Xr cap_rt 4
operations fail.
.Sh EXAMPLES
Minimal configuration with default claims:
.Bd -literal -offset indent
pidfile = "/var/run/oracled.pid";
control_socket = "/var/run/oracled.sock";
service_manager = "/usr/libexec/serviced";
.Ed
.Pp
Full integrity hardening (note: enabling
.Va signal
prevents
.Xr rc 8
from sending signals to
.Nm ) :
.Bd -literal -offset indent
integrity {
    ptrace = true;
    signal = true;
    visible = true;
    wait = true;
    sched = true;
    core = true;
    ktrace = true;
}
.Ed
.Pp
Claim sensitive files, a privileged port range, and system operations:
.Bd -literal -offset indent
claims {
    paths = [
        "/dev/mem",
        "/boot/kernel",
    ];
    network = [
        {
            port = ".<1024";
            protocol = "tcp";
            direction = "bind";
            domain = "inet";
            address = "192.0.2.0/24";
        },
    ];
    jails = [
        "webjail",
        {
            jid = 10;
            name = "dbjail";
            actions = ["create", "attach"];
            path = "/usr/local/jails/dbjail";
        },
    ];
    system = ["kldload", "kldunload", "kldstat",
              "reboot", "sysctl"];
}
.Ed
.Sh SEE ALSO
.Xr kqueue 2 ,
.Xr pdfork 2 ,
.Xr procctl 2 ,
.Xr cap_rt 4 ,
.Xr cap_rt_capprotect 4 ,
.Xr cap_rt_isolation 4 ,
.Xr cap_rt_system 4 ,
.Xr serviced 8
.Sh HISTORY
.Nm
first appeared in 5BSD as the Oracle authority daemon.
