5BSD/5BSD/usr.sbin/notifyctl/notifyctl.8
.\" SPDX-License-Identifier: BSD-2-Clause
.Dd September 14, 2026
.Dt NOTIFYCTL 8
.Os
.Sh NAME
.Nm notifyctl
.Nd validate and operate the Notify service
.Sh SYNOPSIS
.Nm
.Cm configtest
.Op Ar file
.Nm
.Op Fl s
.Cm publish
.Ar topic
.Op Ar payload
.Nm
.Op Fl s
.Cm state-get
.Ar topic
.Nm
.Op Fl s
.Cm state-set
.Ar topic value
.Nm
.Op Fl s
.Cm timer
.Ar timer-id interval-ms
.Op Ar count Op Ar timeout-ms
.Nm
.Op Fl s
.Cm watch
.Ar topic
.Op Ar timeout-ms
.Nm
.Op Fl s
.Cm stats
.Sh DESCRIPTION
.Nm
is the administrator and diagnostic client for
.Xr bsdnotify 8 .
It uses
.Xr libnotify 3
for all live service operations and is therefore subject to the immutable
switchboard identity policy of the invoking service.
It receives no implicit administrative bypass.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl s
Connect to the gated system tier
.Dq system.Notify.System
instead of the open tier
.Dq system.Notify .
The gated tier may publish under any topic, set state, and use timers, but
switchboard resolves it only for callers anointed with
.Dq system.notify.system ;
without that anointment the open fails with
.Er ENOENT .
On the open tier a default policy allows subscribing to any topic and
publishing under
.Dq user.* ;
anything else fails with
.Er EACCES .
See
.Xr bsdnotify 8
for the tiers and their configuration.
.El
.Pp
The
.Cm configtest
command parses the supplied policy file, or
.Pa /etc/bsdnotify.conf
by default, with the same strict parser used by the daemon.
It does not modify or reload the running service.
.Cm publish ,
.Cm state-get ,
.Cm state-set ,
.Cm timer ,
.Cm watch ,
and
.Cm stats
provide bounded diagnostic access to the corresponding public API.
Payload output is written as opaque bytes after one metadata line.
.Pp
The
.Cm timer
command adds an owner-scoped timer and waits for its events on the same
session.
The timer identifier must be nonzero and the interval must be between one
millisecond and 24 hours.
The default count is one, producing a one-shot timer.
A count greater than one requests a periodic timer and cancels it after
exactly that many events.
The optional receive timeout applies separately to each event.
The
.Cm watch
command explicitly unsubscribes after receiving its event.
.Sh SEE ALSO
.Xr libnotify 3 ,
.Xr bsdnotify 8 ,
.Xr switchboard 8
