5BSD/5BSD/share/man/man4/cap_rt.4
.\"
.\" Copyright (c) 2026 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 5, 2026
.Dt CAP_RT 4
.Os
.Sh NAME
.Nm cap_rt
.Nd Capability Message Interface
.Sh SYNOPSIS
To load at boot (required for program nonce):
.Bd -literal -offset indent
echo 'cap_rt_load="YES"' >> /boot/loader.conf
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides a message-passing capability framework for kernel modules.
Capabilities are represented as file descriptors of type
.Dv DTYPE_CAP_RT .
Each capability is an instance of a kernel service, accessed through
structured ioctls.
.Pp
The
.Pa /dev/cap_rt
device is normally claimed exclusively by
.Xr oracled 8
at boot via the isolation service.
Once claimed, only
.Xr oracled 8
can open the device; all other processes receive
.Er EACCES .
Administrative access to capability services is provided through
.Xr oraclectl 8 .
.Pp
The framework supports two messaging models:
.Bl -tag -width "Synchronous"
.It Sy Asynchronous
Messages are enqueued via
.Dv CAP_RT_SENDMSG
and async replies or notifications are dequeued via
.Dv CAP_RT_RECVMSG .
The service processes messages on a kernel taskqueue.
.It Sy Synchronous
Requests are made via
.Dv CAP_RT_CALL .
The service handler runs in the caller's thread context.
.El
.Pp
A service may expose asynchronous messaging, synchronous calls, or both.
Services that do not accept
.Dv CAP_RT_SENDMSG
may still emit asynchronous notifications on
.Dv CAP_RT_RECVMSG .
.Xr kqueue 2
readiness maps to the async queues:
.Dv EVFILT_READ
means
.Dv CAP_RT_RECVMSG
can make progress, and
.Dv EVFILT_WRITE
means space is available for
.Dv CAP_RT_SENDMSG .
Service-defined events are delivered as
.Dv CAP_RT_RECVMSG
payloads; kqueue notes provide readiness, not the event payload itself.
.Pp
The device node
.Pa /dev/cap_rt
is created at module load with mode 0600 (root only).
.Ss Creating a capability
Open
.Pa /dev/cap_rt
and issue
.Dv CAP_RT_CONNECT
with the name of the desired service.
On success, a new capability file descriptor is returned in the
.Va fd
field.
The
.Pa /dev/cap_rt
descriptor can then be closed.
.Ss Credential trailer
Every message carries a kernel-stamped credential trailer containing
the sender's uid, gid, jail ID, and program nonce.
The nonce is an 8-byte cryptographic random value that identifies the
program image: it is inherited across
.Xr fork 2
and rotated on
.Xr execve 2 .
Zero is never a valid nonce.
.Ss Capability control
.Bl -tag -width CAP_RT_REVOKE_MINT
.It Dv CAP_RT_REVOKE_SEND
Strip the ability to send async messages.
.It Dv CAP_RT_REVOKE_RECV
Strip the ability to receive async messages.
.It Dv CAP_RT_REVOKE_CALL
Strip the ability to make synchronous calls.
.It Dv CAP_RT_REVOKE_MINT
Strip the ability to mint new instances.
One-way latch.
.It Dv CAP_RT_TERMINATE
Kill the instance for all holders.
Subsequent operations return
.Er ECONNRESET .
.El
.Ss Minting
Services created with the
.Dv CAP_RT_SVC_MINTABLE
flag allow holders to create new instances via
.Dv CAP_RT_MINT_INSTANCE .
The mint ability can be removed with
.Dv CAP_RT_REVOKE_MINT .
.Ss Introspection
.Dv CAP_RT_GETINFO
returns the service name, badge, queue limits, and feature flags
.Pq Dv CAP_RT_INFO_F_SENDMSG , CAP_RT_INFO_F_RECVMSG , CAP_RT_INFO_F_CALL , CAP_RT_INFO_F_KQUEUE .
Standard file-descriptor tools such as
.Xr procstat 1
show
.Nm
descriptors as
.Dq cap_rt:service[badge] .
The path may include compact state suffixes such as
.Dq :no-send ,
.Dq :no-recv ,
.Dq :no-call ,
.Dq :no-mint ,
.Dq :revoked ,
and
.Dq :closed .
.Ss File descriptor passing
Capabilities can carry up to 32 file descriptors per message.
Attached fds preserve their Capsicum rights through the transfer.
.Ss Capsicum integration
.Nm
descriptors participate in
.Xr capsicum 4
rights enforcement.
The following Capsicum rights govern ioctl access:
.Bl -tag -width CAP_CAP_RT_SEND
.It Dv CAP_CAP_RT_SEND
Required for
.Dv CAP_RT_SENDMSG .
.It Dv CAP_CAP_RT_RECV
Required for
.Dv CAP_RT_RECVMSG .
.It Dv CAP_CAP_RT_SEND , CAP_CAP_RT_RECV , CAP_IOCTL
All three required for
.Dv CAP_RT_CALL .
.It Dv CAP_CAP_RT_MINT
Required for
.Dv CAP_RT_MINT_INSTANCE .
.El
.Pp
The following ioctls are always allowed without a rights check:
.Dv CAP_RT_GETINFO ,
.Dv CAP_RT_REVOKE_SEND ,
.Dv CAP_RT_REVOKE_RECV ,
.Dv CAP_RT_REVOKE_CALL ,
.Dv CAP_RT_REVOKE_MINT ,
and
.Dv CAP_RT_TERMINATE .
.Ss Service creation flags
Kernel modules register services with the following optional flags:
.Bl -tag -width CAP_RT_SVC_MINTABLE
.It Dv CAP_RT_SVC_NOTIFY Pq 0x0002
Service emits async notifications.
.It Dv CAP_RT_SVC_MINTABLE Pq 0x0004
Instances can mint new instances via
.Dv CAP_RT_MINT_INSTANCE .
.El
.Sh IOCTLS
.Bl -tag -width CAP_RT_MINT_INSTANCE
.It Dv CAP_RT_CONNECT
Connect to a named service.
Returns a capability fd.
.It Dv CAP_RT_SENDMSG
Send an async message with optional fd attachment.
Returns
.Er EAGAIN
if the RX queue is full; wait for
.Dv EVFILT_WRITE
and retry.
.It Dv CAP_RT_RECVMSG
Receive an async message.
Blocks unless
.Dv O_NONBLOCK
is set.
.It Dv CAP_RT_CALL
Synchronous request/reply in the caller's thread.
Returns
.Er EMSGSIZE
with the required size if the reply buffer is too small.
.It Dv CAP_RT_GETINFO
Query capability metadata: service name, badge, queue limits, and
feature flags.
.It Dv CAP_RT_REVOKE_SEND
Strip send ability.
One-way latch.
.It Dv CAP_RT_REVOKE_RECV
Strip receive ability.
One-way latch.
.It Dv CAP_RT_REVOKE_CALL
Strip call ability.
One-way latch.
.It Dv CAP_RT_REVOKE_MINT
Strip mint ability.
One-way latch.
.It Dv CAP_RT_TERMINATE
Kill the instance for all holders.
.It Dv CAP_RT_MINT_INSTANCE
Create a new instance from an existing mintable instance.
Requires the
.Dv CAP_CAP_RT_MINT
Capsicum right.
Only available on services registered with the
.Dv CAP_RT_SVC_MINTABLE
flag.
.El
.Sh SERVICES
The following services are provided as loadable kernel modules:
.Bl -tag -width cap_rt_capprotect
.It Sy cap_rt_identity
Program nonce queries.
Provides SELF and QUERY operations via
.Xr procdesc 4 .
See
.Xr cap_rt_identity 4 .
.It Sy cap_rt_capprotect
Capability protection via MACF.
Selectively shield a program from ptrace, signals, visibility,
and wait.
Same-nonce (fork family) processes interact freely;
foreign programs are blocked.
Provides shield, mint, authorize, capmode, and chroot operations.
See
.Xr cap_rt_capprotect 4 .
.It Sy cap_rt_isolation
File, network, and jail isolation by nonce.
Supports claims, tokens, and MACF enforcement.
See
.Xr cap_rt_isolation 4 .
.It Sy cap_rt_system
System operation gating via MACF.
Controls kldload, reboot, sysctl, and other privileged operations.
See
.Xr cap_rt_system 4 .
.It Sy cap_rt_coalition
Resource group management.
Provides enlist, terminate, deadline, watchdog, and related operations.
See
.Xr cap_rt_coalition 4 .
.It Sy cap_rt_node
Per-process inspection and control via
.Xr procdesc 4 .
See
.Xr cap_rt_node 4 .
.It Sy cap_rt_accounting
Per-process racct/rctl operations via
.Xr procdesc 4 .
See
.Xr cap_rt_accounting 4 .
.It Sy cap_rt_pair
Bidirectional capability pair for peer-to-peer messaging.
See
.Xr cap_rt_pair 4 .
.It Sy cap_rt_mount
Capability-based filesystem mounting.
See
.Xr cap_rt_mount 4 .
.El
.Ss Test fixtures
The following services exist for testing the CAP_RT framework.
They are not intended for production use.
.Bl -tag -width cap_rt_test_kernelstore
.It Sy cap_rt_test_kernelstore
Sync-only shared key-value store (256 keys, 4096 bytes per value).
.It Sy cap_rt_test_keystore
Async key-value store.
.El
.Sh LIMITS
.Bl -tag -width CAP_RT_MSG_PAYLOAD_SIZE
.It Dv CAP_RT_MSG_PAYLOAD_SIZE
14336 bytes (14 KB) maximum usable payload per message.
.It Dv CAP_RT_MAX_FDS
32 file descriptors per message.
.It Dv CAP_RT_MAXNAME
64 bytes maximum service name length.
.It Dv CAP_RT_DEFAULT_QUEUE_DEPTH
256 messages per async queue (configurable by service).
.It Dv CAP_RT_MAX_QUEUE_DEPTH
4096 messages maximum async queue depth.
.El
.Pp
Messages are fixed at 16384 bytes (4 pages) including a 2048-byte
header reserved for framework use.
Sync-only services do not allocate message queues.
.Sh SYSCTL VARIABLES
.Bl -tag -width kern.cap_rt.service_details
.It Va kern.cap_rt.services
Number of registered services.
.It Va kern.cap_rt.instances
Number of active capability instances.
.It Va kern.cap_rt.service_names
Newline-separated list of registered service names.
.It Va kern.cap_rt.service_details
Newline-separated list of registered services with flags, queue depth,
TX limit, instance limit, active instance count, and destroying state.
.El
.Sh DTRACE PROBES
The
.Nm
provider defines the following probes.
.Ss Core messaging
connect, connect-done, send, send-done, recv, recv-done, dispatch,
dispatch-done, reply, reply-done, notify, notify-done, call, call-done,
forward, forward-done, revoke, revoke-done, close.
.Ss FD lifecycle
fd-install, fd-close, fd-receive, fd-mint.
.Ss Control
control, ioctl-deny, rights-change, state, error.
.Ss Instance lifecycle
instance-create, instance-finalize, instance-lastclose.
.Ss Service lifecycle
service-create, service-destroy.
.Ss Queue
queue-pressure.
.Pp
The descriptor probes include the service name, badge, fd, pid,
credential pointer, and nonce.
The control probe includes the service name, badge, ioctl command, pid,
credential pointer, and nonce.
The state probe passes service name, badge, instance flags, restriction
bits, pid, and nonce so scripts do not have to infer descriptor state
from prior events.
These probes cover descriptor events visible to
.Nm
itself; generic
.Xr dup 2 ,
fork inheritance, and
.Dv SCM_RIGHTS
transfer through Unix sockets require fd-layer instrumentation.
.Pp
Related providers include
.Va fd
for descriptor install, dup, close, fork inheritance,
.Dv SCM_RIGHTS
send/receive, and pass-deny events;
.Va capsicum
for rights/ioctl/fcntl limit, get, check, and denial events;
.Va cap_rt_nonce
for nonce assign, copy, backfill, and exec-rotate events;
and subsystem providers
.Va cap_rt_capprotect ,
.Va cap_rt_isolation ,
.Va cap_rt_system ,
.Va cap_rt_coalition ,
and
.Va cap_rt_pair
for claim, token, authorization, release, and denial events.
.Pp
Installed DTrace scripts for observing
.Nm
and related descriptor authority include:
.Pp
.Bl -tag -width cap_rt-coalitions -compact
.It Pa cap_rt-audit
Comprehensive audit trail of all
.Nm
operations.
.It Pa cap_rt-calls
Synchronous call latency and frequency.
.It Pa cap_rt-coalitions
Coalition membership and lifecycle events.
.It Pa cap_rt-delegation
Capability delegation through fd passing.
.It Pa cap_rt-denials
Denied operations from MACF and Capsicum.
.It Pa cap_rt-errors
Error frequency by service and error code.
.It Pa cap_rt-fds
File descriptor lifecycle for
.Nm
descriptors.
.It Pa cap_rt-holders
Active capability holders by service.
.It Pa cap_rt-messages
Async message throughput and queue depth.
.It Pa cap_rt-nonces
Program nonce assignment and rotation.
.It Pa cap_rt-services
Service registration and instance counts.
.It Pa cap_rt-shield
capprotect shield and authorization events.
.It Pa cap_rt-summary
Aggregate statistics across all services.
.It Pa cap_rt-who
Per-process capability usage summary.
.It Pa capsicum-changes
Capsicum rights changes across all descriptor types.
.El
.Sh FILES
.Bl -tag -width /dev/cap_rt
.It Pa /dev/cap_rt
Control device for creating capabilities.
.El
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er EAGAIN
RX queue full
.Pq Dv CAP_RT_SENDMSG ,
no message available with
.Dv O_NONBLOCK
.Pq Dv CAP_RT_RECVMSG ,
or TX soft limit reached for notifications.
.It Bq Er EACCES
Operation revoked via
.Dv CAP_RT_REVOKE_* ,
Capsicum rights check failed, or restriction flag triggered.
.It Bq Er EBADF
File descriptor hold failed during message construction.
.It Bq Er ECONNABORTED
Service being destroyed during
.Dv CAP_RT_CONNECT .
.It Bq Er ECONNRESET
Instance terminated or peer closed.
.It Bq Er EINVAL
Invalid arguments, reserved fields nonzero, payload too large, or
too many file descriptors attached.
.It Bq Er EMSGSIZE
Payload too large
.Pq Dv CAP_RT_SENDMSG ,
or reply buffer too small
.Pq Dv CAP_RT_RECVMSG , CAP_RT_CALL .
The required size is returned in the length field.
.It Bq Er ENOBUFS
TX hard limit reached
.Pq queue_depth * 4 .
.It Bq Er ENOENT
Service not found
.Pq Dv CAP_RT_CONNECT .
.It Bq Er EOPNOTSUPP
Wrong messaging model for this service:
.Dv CAP_RT_SENDMSG
on a sync-only service,
.Dv CAP_RT_CALL
on an async-only service, or
.Dv CAP_RT_MINT_INSTANCE
on a non-mintable service.
.It Bq Er EPIPE
Instance dead on
.Dv CAP_RT_SENDMSG .
.El
.Sh EXAMPLES
Connect to a service and make a synchronous call:
.Bd -literal -offset indent
int devfd, capfd;
struct cap_rt_connect_args conn;
struct cap_rt_call_args call;
char req[128], reply[1024];

devfd = open("/dev/cap_rt", O_RDWR);

memset(&conn, 0, sizeof(conn));
strlcpy(conn.name, "cap_rt_identity", sizeof(conn.name));
if (ioctl(devfd, CAP_RT_CONNECT, &conn) == -1)
	err(1, "connect");
capfd = conn.fd;
close(devfd);

memset(&call, 0, sizeof(call));
call.tx_data = req;
call.tx_len = sizeof(req);
call.rx_data = reply;
call.rx_len = sizeof(reply);
if (ioctl(capfd, CAP_RT_CALL, &call) == -1)
	err(1, "call");

/* call.rx_len now contains the actual reply size */
.Ed
.Pp
Narrow a capability for delegation to an untrusted child:
.Bd -literal -offset indent
/* Strip send and mint, keep only recv and call */
ioctl(capfd, CAP_RT_REVOKE_SEND, NULL);
ioctl(capfd, CAP_RT_REVOKE_MINT, NULL);
cap_xfer_limit(capfd, CAP_XFER_NONE);  /* prevent further delegation */
.Ed
.Pp
Poll for async messages with
.Xr kqueue 2 :
.Bd -literal -offset indent
struct kevent ev;
EV_SET(&ev, capfd, EVFILT_READ, EV_ADD, 0, 0, NULL);
kevent(kq, &ev, 1, NULL, 0, NULL);

/* In event loop */
if (kevent(kq, NULL, 0, &ev, 1, NULL) > 0) {
	struct cap_rt_recvmsg_args rmsg;
	memset(&rmsg, 0, sizeof(rmsg));
	rmsg.rx_data = buf;
	rmsg.rx_len = sizeof(buf);
	ioctl(capfd, CAP_RT_RECVMSG, &rmsg);
}
.Ed
.Sh SEE ALSO
.Xr capsicum 4 ,
.Xr mac 4 ,
.Xr cap_rt_accounting 4 ,
.Xr cap_rt_capprotect 4 ,
.Xr cap_rt_coalition 4 ,
.Xr cap_rt_identity 4 ,
.Xr cap_rt_isolation 4 ,
.Xr cap_rt_mount 4 ,
.Xr cap_rt_node 4 ,
.Xr cap_rt_pair 4 ,
.Xr cap_rt_system 4 ,
.Xr oracled 8
.Sh HISTORY
The
.Nm
framework first appeared in
.Fx 15.0
as part of 5BSD.
