5BSD/5BSD/share/man/man4/cap_rt_coalition.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt CAP_RT_COALITION 4
.Os
.Sh NAME
.Nm cap_rt_coalition
.Nd capability-based resource group management
.Sh SYNOPSIS
To load at boot:
.Bd -literal -offset indent
echo 'cap_rt_coalition_load="YES"' >> /boot/loader.conf
.Ed
.Pp
Wire protocol header:
.Bd -literal -offset indent
#include <dev/cap_rt/cap_rt_coalition_proto.h>
.Ed
.Sh DESCRIPTION
The
.Nm
service groups processes and other resources under a single capability handle
for collective operations.
A coalition can contain process descriptors, jail descriptors,
.Xr cap_rt 4
instances, sockets, shared memory objects, and nested coalitions.
.Pp
Operations are issued synchronously via
.Dv CAP_RT_CALL
or asynchronously via
.Dv CAP_RT_SENDMSG .
Asynchronous replies and state-change notifications are delivered as
.Dv CAP_RT_RECVMSG
payloads.
.Xr kqueue 2
.Dv EVFILT_READ
reports notification readiness;
.Dv EVFILT_WRITE
reports send-queue readiness.
.Pp
Member file descriptors are passed as attached fds, not as integer fd numbers
in the payload.
.Pp
The default termination signal is
.Dv SIGKILL .
.Ss Operations
All operations begin with a common request header:
.Bd -literal -offset indent
struct coalition_req_hdr {
	uint32_t	op;
};
.Ed
.Pp
Most operations return a generic reply:
.Bd -literal -offset indent
struct coalition_reply {
	int32_t		status;	/* 0 = success, errno on failure */
};
.Ed
.Pp
The following operations are defined:
.Bl -tag -width "Dv COALITION_OP_SET_WATCHDOG"
.It Dv COALITION_OP_ENLIST
Attach a member file descriptor to the coalition.
The member fd is passed as an attached fd.
Accepted descriptor types are
.Dv DTYPE_PROCDESC ,
.Dv DTYPE_JAILDESC ,
.Dv DTYPE_CAP_RT ,
.Dv DTYPE_SOCKET ,
and
.Dv DTYPE_SHM .
A
.Dv DTYPE_CAP_RT
descriptor backed by the coalition service is treated as a nested coalition.
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_JOIN
The calling process joins the coalition without requiring a file descriptor.
This operation is
.Dv CAP_RT_CALL
only; it cannot be used with
.Dv CAP_RT_SENDMSG
because the service taskqueue has no caller process context.
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_ENLIST_SET
Attach multiple member file descriptors in a single call.
All member fds are passed as attached fds.
Stops on the first error.
Returns:
.Bd -literal -offset indent
struct coalition_enlist_set_reply {
	int32_t		status;
	uint32_t	enlisted;  /* count of successfully enlisted members */
};
.Ed
.It Dv COALITION_OP_TERMINATE
Terminate all coalition members.
Processes receive the configured signal
.Pq default Dv SIGKILL ,
jails are removed via
.Fn prison_remove ,
sockets are shut down, and
.Xr cap_rt 4
members are revoked.
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_STAT
Query coalition membership and state.
Returns:
.Bd -literal -offset indent
struct coalition_stat_reply {
	int32_t		status;
	uint32_t	member_count;
	uint32_t	flags;          /* COF_* */
	int32_t		signal;
	uint32_t	nesting_depth;
	uint32_t	nested_count;   /* nested coalition members */
	uint32_t	cap_rt_count;   /* non-coalition DTYPE_CAP_RT */
	uint32_t	process_count;
	uint32_t	jail_count;
	uint32_t	other_count;
};
.Ed
.It Dv COALITION_OP_SET_SIGNAL
Configure the signal used for group termination.
.Bd -literal -offset indent
struct coalition_set_signal_req {
	uint32_t	op;
	int32_t		signal;
};
.Ed
.Pp
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_GRACEFUL
Perform graceful termination: deliver the specified signal to all process
members, wait for the timeout, then
.Dv SIGKILL
any survivors.
.Bd -literal -offset indent
struct coalition_graceful_req {
	uint32_t	op;
	int32_t		signal;
	uint32_t	timeout_ms;
};
.Ed
.Pp
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_SET_DEADLINE
Set a time-bounded lifetime for the coalition.
When the deadline expires, the configured signal is delivered.
If
.Fa grace_ms
is nonzero, a grace period follows before
.Dv SIGKILL .
Setting
.Fa timeout_ms
to zero cancels the deadline.
Setting
.Fa signal
to zero causes immediate
.Dv SIGKILL
with no grace period.
.Bd -literal -offset indent
struct coalition_set_deadline_req {
	uint32_t	op;
	uint32_t	timeout_ms;
	int32_t		signal;     /* 0 = immediate SIGKILL */
	uint32_t	grace_ms;
};
.Ed
.Pp
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_SET_WATCHDOG
Enable a dead-man switch that requires periodic heartbeats.
If no heartbeat arrives within
.Fa timeout_ms ,
the coalition is terminated.
Setting
.Fa timeout_ms
to zero disables the watchdog.
.Bd -literal -offset indent
struct coalition_set_watchdog_req {
	uint32_t	op;
	uint32_t	timeout_ms;
};
.Ed
.Pp
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_HEARTBEAT
Reset the watchdog timer.
Request is a plain
.Vt struct coalition_req_hdr .
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_SET_LEADER
Designate a leader process.
The leader's process descriptor is passed as an attached fd.
If the leader exits, the coalition is terminated.
Omitting the attached fd clears the leader.
Returns
.Vt struct coalition_reply .
.It Dv COALITION_OP_RUSAGE
Query aggregate resource usage across all process members.
Returns:
.Bd -literal -offset indent
struct coalition_rusage_reply {
	int32_t		status;
	uint32_t	nprocs;
	uint32_t	nthreads;
	uint32_t	_pad;
	uint64_t	rss_bytes;
	uint64_t	vsz_bytes;
	uint64_t	user_usec;
	uint64_t	sys_usec;
	uint64_t	inblock;
	uint64_t	oublock;
	uint64_t	majflt;
	uint64_t	minflt;
};
.Ed
.El
.Ss Member Types
The following descriptor types are accepted by
.Dv COALITION_OP_ENLIST :
.Bl -tag -width "Dv DTYPE_CAP_RT (coalition)" -compact
.It Dv DTYPE_PROCDESC
Process descriptor.
Requires
.Dv CAP_PDKILL
rights under Capsicum.
.It Dv DTYPE_JAILDESC
Jail descriptor.
Requires
.Dv CAP_JAIL_REMOVE
rights.
.It Dv DTYPE_CAP_RT
A
.Xr cap_rt 4
capability instance.
If the instance is backed by the coalition service, it is treated as a
nested coalition; otherwise it is revoked on termination.
.It Dv DTYPE_SOCKET
Socket.
Requires
.Dv CAP_SHUTDOWN
rights.
Terminated via
.Fn soshutdown SHUT_RDWR .
.It Dv DTYPE_SHM
Shared memory object.
Requires
.Dv CAP_FTRUNCATE
rights.
.El
.Pp
Nested coalitions are limited to a maximum depth of 16
.Pq Dv COALITION_MAX_NESTING .
Cycles are detected and rejected at enlist time.
.Ss Deadline
The
.Dv COALITION_OP_SET_DEADLINE
operation sets a time-bounded lifetime.
When the timer fires:
.Bl -enum -compact
.It
If
.Fa signal
is nonzero, that signal is delivered to all process members.
.It
If
.Fa grace_ms
is nonzero, a grace period starts.
.It
After the grace period (or immediately if
.Fa grace_ms
is zero or
.Fa signal
is zero), remaining members receive
.Dv SIGKILL .
.El
.Ss Watchdog
The
.Dv COALITION_OP_SET_WATCHDOG
operation enables a dead-man switch.
The holder must periodically send
.Dv COALITION_OP_HEARTBEAT
before the timeout expires.
If the watchdog fires, the coalition is terminated with the configured signal.
.Ss Notifications
Asynchronous state-change events are delivered as
.Dv CAP_RT_RECVMSG
payloads:
.Bd -literal -offset indent
struct coalition_event_msg {
	uint32_t	flags;   /* COALITION_NOTE_* */
};
.Ed
.Bl -column "Dv COALITION_NOTE_MEMBER_REMOVED" "0x0080" -offset indent
.It Sy Constant Ta Sy Value
.It Dv COALITION_NOTE_MEMBER_ADDED Ta 0x0001
.It Dv COALITION_NOTE_MEMBER_REMOVED Ta 0x0002
.It Dv COALITION_NOTE_TERMINATING Ta 0x0004
.It Dv COALITION_NOTE_TERMINATED Ta 0x0008
.It Dv COALITION_NOTE_LEADER_DIED Ta 0x0010
.It Dv COALITION_NOTE_DEADLINE_FIRED Ta 0x0020
.It Dv COALITION_NOTE_WATCHDOG_FIRED Ta 0x0040
.It Dv COALITION_NOTE_GRACE_STARTED Ta 0x0080
.El
.Ss Coalition Flags
The
.Fa flags
field of
.Vt struct coalition_stat_reply
contains a bitmask of:
.Bl -column "Dv COF_LEADER_MONITOR" "0x0020" "Grace period active, new members rejected" -offset indent
.It Sy Constant Ta Sy Value Ta Sy Meaning
.It Dv COF_TERMINATING Ta 0x0001 Ta Coalition is being terminated
.It Dv COF_DEADLINE_ACTIVE Ta 0x0002 Ta Deadline timer is running
.It Dv COF_DEADLINE_GRACE Ta 0x0004 Ta Deadline grace period is active
.It Dv COF_WATCHDOG_ACTIVE Ta 0x0008 Ta Watchdog timer is running
.It Dv COF_HAS_LEADER Ta 0x0010 Ta A leader process is designated
.It Dv COF_LEADER_MONITOR Ta 0x0020 Ta Leader monitor holds a reference
.It Dv COF_GRACE_ACTIVE Ta 0x0040 Ta Grace period active, new members rejected
.El
.Ss Sysctl Tunables
.Bl -tag -width "Va kern.cap_rt_coalition.max_members"
.It Va kern.cap_rt_coalition.count
Number of active coalitions (read-only).
.It Va kern.cap_rt_coalition.max
Maximum number of coalitions; 0 means unlimited.
Soft limit, best-effort enforcement.
.It Va kern.cap_rt_coalition.max_members
Maximum total members across all coalitions; 0 means unlimited.
Soft limit, best-effort enforcement.
.It Va kern.cap_rt_coalition.members
Total members across all coalitions (read-only).
.El
.Sh DTRACE PROBES
The following DTrace probes are available under the
.Nm cap_rt_coalition
provider:
.Bl -tag -width "deadline-expire(phase, signal)"
.It Fn create badge
Fired when a coalition is created.
.Ar badge
is the instance badge.
.It Fn enlist dtype error
Fired after an enlist attempt.
.Ar dtype
is the descriptor type;
.Ar error
is 0 on success or an errno.
.It Fn join pid error
Fired when a process joins.
.Ar pid
is the caller's PID;
.Ar error
is 0 on success.
.It Fn terminate member_count error
Fired on termination.
.Ar member_count
is the number of members at the time of termination.
.It Fn close member_count
Fired when the coalition handle is closed.
.It Fn member-exit pid
Fired when a member process exits.
.It Fn leader-exit pid
Fired when the designated leader process exits.
.It Fn fork-inherit parent_pid child_pid
Fired when a child process inherits coalition membership via
.Xr fork 2 .
.It Fn signal-set signal 0
Fired when the termination signal is changed.
.It Fn deadline-set timeout_ms signal grace_ms 0
Fired when a deadline is configured.
.It Fn deadline-expire phase signal
Fired when a deadline or grace period expires.
.Ar phase
is a string describing the expiry stage.
.It Fn watchdog-set timeout_ms 0
Fired when the watchdog is configured.
.It Fn watchdog-expire signal
Fired when the watchdog expires.
.It Fn heartbeat timeout_ms
Fired when a heartbeat resets the watchdog.
.Ar timeout_ms
is the remaining timeout.
.It Fn graceful signal timeout_ms 0
Fired when graceful termination is initiated.
.It Fn call-done op error time
Fired after every operation completes.
.Ar op
is the operation code;
.Ar error
is the result;
.Ar time
is the elapsed time as an
.Vt sbintime_t .
.It Fn deny reason errno pid
Fired when an operation is denied.
.Ar reason
is a string description.
.El
.Sh EXAMPLES
Create a coalition, enlist two processes, set a deadline, and terminate:
.Bd -literal -offset indent
/* Obtain coalition fd from oracled. */
int co_fd = obtain_coalition_fd();

/* Enlist a process descriptor. */
struct coalition_req_hdr req = { .op = COALITION_OP_ENLIST };
struct coalition_reply reply;
cap_rt_call(co_fd, &req, sizeof(req), &reply, sizeof(reply),
    &proc_fd, 1);

/* Set a 30-second deadline with SIGTERM + 5s grace. */
struct coalition_set_deadline_req dreq = {
	.op = COALITION_OP_SET_DEADLINE,
	.timeout_ms = 30000,
	.signal = SIGTERM,
	.grace_ms = 5000,
};
cap_rt_call(co_fd, &dreq, sizeof(dreq), &reply, sizeof(reply),
    NULL, 0);

/* Enable watchdog with 10-second timeout. */
struct coalition_set_watchdog_req wreq = {
	.op = COALITION_OP_SET_WATCHDOG,
	.timeout_ms = 10000,
};
cap_rt_call(co_fd, &wreq, sizeof(wreq), &reply, sizeof(reply),
    NULL, 0);

/* Send heartbeats periodically. */
struct coalition_req_hdr hb = { .op = COALITION_OP_HEARTBEAT };
cap_rt_call(co_fd, &hb, sizeof(hb), &reply, sizeof(reply),
    NULL, 0);

/* Graceful shutdown: SIGTERM + 5s grace. */
struct coalition_graceful_req greq = {
	.op = COALITION_OP_GRACEFUL,
	.signal = SIGTERM,
	.timeout_ms = 5000,
};
cap_rt_call(co_fd, &greq, sizeof(greq), &reply, sizeof(reply),
    NULL, 0);
.Ed
.Sh ERRORS
Operations return raw
.Xr errno 2
values in the reply
.Fa status
field:
.Bl -tag -width Er
.It Bq Er EINVAL
Invalid operation code, signal number, or timeout value.
.It Bq Er ENOTCAPABLE
The member fd lacks the required Capsicum rights.
.It Bq Er ESRCH
The target process or member was not found.
.It Bq Er EPERM
Permission denied.
.It Bq Er ELOOP
Enlisting a nested coalition would exceed
.Dv COALITION_MAX_NESTING
or create a cycle.
.It Bq Er ENOMEM
Insufficient memory for a new member.
.It Bq Er EBUSY
The coalition is in a terminating or grace state and rejects new members.
.El
.Sh SEE ALSO
.Xr kqueue 2 ,
.Xr cap_rt 4 ,
.Xr cap_rt_capprotect 4 ,
.Xr cap_rt_system 4 ,
.Xr oracled 8 ,
.Xr serviced 8
.Sh HISTORY
The
.Nm
service first appeared in
5BSD.
