5BSD/5BSD/share/man/man4/capsicum.4
.\"
.\" Copyright (c) 2011, 2013 Robert N. M. Watson
.\" Copyright (c) 2011 Jonathan Anderson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 23, 2026
.Dt CAPSICUM 4
.Os
.Sh NAME
.Nm Capsicum
.Nd lightweight OS capability and sandbox framework
.Sh SYNOPSIS
.Cd "options CAPABILITY_MODE"
.Cd "options CAPABILITIES"
.Sh DESCRIPTION
.Nm
is a lightweight OS capability and sandbox framework implementing a hybrid
capability system model.
.Nm
is designed to blend capabilities with UNIX.
This approach achieves many of the benefits of least-privilege operation, while
preserving existing UNIX APIs and performance, and presents application authors
with an adoption path for capability-oriented design.
.Pp
Capabilities are unforgeable tokens of authority that can be delegated and must
be presented to perform an action.
.Nm
makes file descriptors into capabilities.
.Pp
.Nm
can be used for application and library compartmentalisation, the
decomposition of larger bodies of software into isolated (sandboxed)
components in order to implement security policies and limit the impact of
software vulnerabilities.
.Pp
.Nm
provides two core kernel primitives:
.Bl -tag -width indent
.It capability mode
A process mode, entered by invoking
.Xr cap_enter 2 ,
in which access to global OS namespaces (such as the file system and PID
namespaces) is restricted; only explicitly delegated rights, referenced by
memory mappings or file descriptors, may be used.
Once set, the flag is inherited by future children processes, and may not be
cleared.
.Pp
Access to system calls in capability mode is restricted: some system calls
requiring global namespace access are unavailable, while others are
constrained.
Conversely, capability mode unlocks capability-pure system call variants
that are unavailable outside capability mode.
These variants perform only capability rights checks on descriptors,
with no ambient authority checks such as MAC policy, jail confinement,
or credential re-validation.
Outside capability mode, these system calls return
.Er ENOTCAPABLE .
For instance,
.Xr sysctl 2
can be used to query process-local information such as address space layout,
but also to monitor a system's network connections.
.Xr sysctl 2
is constrained by explicitly marking \(~~60 of over 15000 parameters as
permitted in capability mode; all others are denied.
.Pp
The system calls which require constraints are
.Xr sysctl 2 ,
.Xr shm_open 2
.Pq which is permitted to create anonymous memory objects but not named ones
and the
.Xr openat 2
family of system calls.
The
.Xr openat 2
calls already accept a file descriptor argument as the directory to perform the
.Xr open 2 ,
.Xr rename 2 ,
etc. relative to; in capability mode the
.Xr openat 2
family of system calls are constrained so that they can only operate on
objects “under” the provided file descriptor.
.It capabilities
Limit operations that can be called on file descriptors.
For example, a file descriptor returned by
.Xr open 2
may be refined using
.Xr cap_rights_limit 2
so that only
.Xr read 2
and
.Xr write 2
can be called, but not
.Xr fchmod 2 .
The complete list of the capability rights can be found in the
.Xr rights 4
manual page.
.It transfer state
Control whether a descriptor can be passed to another process via
.Xr sendmsg 2
with
.Dv SCM_RIGHTS .
Using
.Xr cap_xfer_limit 2 ,
a descriptor's transfer state can be set to single-use
.Pq Dv CAP_XFER_ONCE
or fully locked
.Pq Dv CAP_XFER_NONE .
Transfer state is orthogonal to capability rights.
.Pp
.Xr cap_xfer_capmode 2
provides an additional monotonic per-descriptor restriction: once set,
the descriptor may only be received by a process that is already in
capability mode.
If the receiver is not in capability mode,
.Xr recvmsg 2
fails with
.Er ENOTCAPABLE
and the descriptor is not delivered.
The flag propagates to the new descriptor in the receiver's table,
so all subsequent transfers are likewise restricted.
.It connection-level capability enforcement
The
.Dv LOCAL_CAPMODE_CONNECT
.Ux Ns -domain
socket option
.Pq see Xr unix 4
restricts connections to a listening socket so that only processes in
capability mode may connect.
Attempts to
.Xr connect 2
from a process not in capability mode fail with
.Er ENOTCAPABLE .
The option is monotonic and cannot be cleared once set.
.El
.Pp
In some cases,
.Nm
requires use of alternatives to traditional POSIX APIs in order to name
objects using capabilities rather than global namespaces:
.Bl -tag -width indent
.It process descriptors
File descriptors representing processes, allowing parent processes to manage
child processes without requiring access to the PID namespace; described in
greater detail in
.Xr procdesc 4 .
.It anonymous shared memory
An extension to the POSIX shared memory API to support anonymous swap objects
associated with file descriptors; described in greater detail in
.Xr shm_open 2 .
.El
.Pp
In some cases,
.Nm
limits the valid values of some parameters to traditional APIs in order to
restrict access to global namespaces:
.Bl -tag -width indent
.It process IDs
Processes can only act upon their own process ID with syscalls such as
.Xr cpuset_setaffinity 2 .
.El
.Pp
.Fx
provides some additional functionality to support application sandboxing that
is not part of
.Nm
itself:
.Bl -tag -width indent
.It Xr capsicum_helpers 3
A set of a inline functions which simplify modifying programs to use
.Nm .
.It Xr libcasper 3
A library that provides services for sandboxed applications, such as operating
on files specified on a command line or establishing network connections.
.El
.Sh SEE ALSO
.Xr cap_enter 2 ,
.Xr cap_fcntls_limit 2 ,
.Xr cap_getmode 2 ,
.Xr cap_ioctls_limit 2 ,
.Xr cap_rights_limit 2 ,
.Xr cap_xfer_capmode 2 ,
.Xr cap_xfer_limit 2 ,
.Xr fchmod 2 ,
.Xr open 2 ,
.Xr pdfork 2 ,
.Xr pdgetpid 2 ,
.Xr pdincapmode 2 ,
.Xr pdkill 2 ,
.Xr pdwait4 2 ,
.Xr read 2 ,
.Xr shm_open 2 ,
.Xr write 2 ,
.Xr cap_rights_get 3 ,
.Xr capsicum_helpers 3 ,
.Xr libcasper 3 ,
.Xr procdesc 4 ,
.Xr unix 4
.Sh HISTORY
.Nm
first appeared in
.Fx 9.0 ,
and was developed at the University of Cambridge.
.Sh AUTHORS
.Nm
was developed by
.An -nosplit
.An Robert Watson Aq Mt rwatson@FreeBSD.org
and
.An Jonathan Anderson Aq Mt jonathan@FreeBSD.org
at the University of Cambridge, and
.An Ben Laurie Aq Mt benl@FreeBSD.org
and
.An Kris Kennaway Aq Mt kris@FreeBSD.org
at Google, Inc., and
.An Pawel Jakub Dawidek Aq Mt pawel@dawidek.net .
Portions of this manual page are drawn from
.Rs
.%A Robert N. M. Watson
.%A Jonathan Anderson
.%A Ben Laurie
.%A Kris Kennaway
.%T Capsicum: practical capabilities for UNIX
.%J USENIX Security Symposium
.%D August 2010
.%O DOI: 10.5555/1929820.1929824
.Re
