5BSD/5BSD/share/man/man4/cmi_token.4
.\"
.\" Copyright (c) 2026 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd April 19, 2026
.Dt CMI_TOKEN 4
.Os
.Sh NAME
.Nm cmi_token
.Nd CMI authorization token service
.Sh SYNOPSIS
.Cd "kldload cmi"
.Cd "kldload cmi_token"
.Sh DESCRIPTION
The
.Nm
service provides kernel-gated authorization tokens.
An issuer creates labeled tokens that prove authorization.
Tokens can be passed to other processes, validated, and revoked.
.Pp
Tokens cannot be forged \(em only the kernel issues them.
.Xr dup 2
shares the same instance, so revoking one copy revokes all.
.Pp
All operations use
.Dv CMI_CALL
(synchronous).
.Ss Operations
.Bl -tag -width TOKEN_OP_VALIDATE
.It Dv TOKEN_OP_CREATE
Create a new token with a label (up to 64 bytes).
The token is returned as a reply fd.
.It Dv TOKEN_OP_VALIDATE
Check if a token is live and retrieve its label, issuer uid,
and issuer program nonce.
.It Dv TOKEN_OP_REVOKE
Invalidate a token.
.El
.Ss Wire protocol
.Bd -literal
#include <cmi_token_proto.h>

struct token_create_request {
    uint32_t op;
    uint32_t _reserved;
    char     label[TOKEN_LABEL_MAX];
};

struct token_validate_reply {
    uint32_t valid;
    uid_t    issuer_uid;
    uint64_t issuer_nonce;
    char     label[TOKEN_LABEL_MAX];
};
.Ed
.Sh SEE ALSO
.Xr cmi 4
