5BSD/5BSD/share/man/man4/mac_capability_capprotect.4
.\"
.\" Copyright (c) 2026 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt MAC_CAPABILITY_CAPPROTECT 4
.Os
.Sh NAME
.Nm mac_capability_capprotect
.Nd MAC_CAPABILITY capability protection service
.Sh SYNOPSIS
.Cd "kldload mac_capability"
.Cd "kldload mac_capability_capprotect"
.Sh DESCRIPTION
The
.Nm
service provides selective process integrity protection using the
MACF framework.
A process shields itself by calling
.Dv CP_OP_SHIELD
with a bitmask of desired protections.
.Pp
Protection is scoped by the program nonce: all processes sharing the
same nonce (the calling process and its fork descendants) are considered
the same program and can interact freely.
Only foreign programs (different nonce, i.e., post-exec) are subject to
the shield.
The nonce rotates on
.Xr execve 2 ,
so protection does not survive exec.
Closing the capability fd removes protection.
.Pp
A shielded program can grant access to a foreign program by minting an
access token
.Pq Dv CP_OP_MINT
and handing it to the foreign program.
The recipient activates the token with
.Dv CP_OP_AUTHORIZE
to gain access through the shield.
Authorization persists while the token fd is open.
Closing the token fd revokes authorization.
.Pp
All operations use
.Dv MAC_CAPABILITY_CALL
(synchronous).
.Ss Shield flags
.Bl -tag -width CP_SF_NOFDRECV
.It Dv CP_SF_PTRACE Pq 0x001
Block
.Xr ptrace 2
attach from foreign programs.
.It Dv CP_SF_SIGNAL Pq 0x002
Block signals from foreign programs.
SIGKILL and SIGCONT require their own flags.
.It Dv CP_SF_VISIBLE Pq 0x004
Hide the process from credential visibility checks
.Pq Xr ps 1 , Xr top 1 , procfs enumeration .
.It Dv CP_SF_WAIT Pq 0x008
Block
.Xr wait4 2
from non-parent foreign processes.
.It Dv CP_SF_SIGKILL Pq 0x010
Block SIGKILL from foreign programs.
Makes the process unkillable except by the same program or authorized holders.
.It Dv CP_SF_SIGCONT Pq 0x020
Block SIGCONT from foreign programs.
.It Dv CP_SF_SCHED Pq 0x040
Block
.Xr getpriority 2 ,
.Xr setpriority 2 ,
and
.Xr cpuset 2
manipulation from foreign programs.
.It Dv CP_SF_CORE Pq 0x080
Suppress core dumps for the protected process.
.It Dv CP_SF_KTRACE Pq 0x100
Block
.Xr ktrace 1
from foreign programs.
.It Dv CP_SF_NOPRIVS Pq 0x200
Strip all privileges from the protected process.
.It Dv CP_SF_NOFORK Pq 0x400
Block
.Xr fork 2 ,
.Xr vfork 2 ,
and
.Xr rfork 2 .
.It Dv CP_SF_NOIPC Pq 0x800
Block SysV and POSIX IPC operations.
.It Dv CP_SF_NOFDRECV Pq 0x1000
Block incoming
.Dv SCM_RIGHTS
file descriptor transfers over local-domain sockets.
This flag removes ambient descriptor receipt; it does not block attachments
received over a previously held
.Xr mac_capability_channel 4
endpoint.
Such attachments remain subject to the channel's explicit authority,
descriptor-transfer limit, close-on-exec state, and close-on-fork state.
.It Dv CP_SF_ALL Pq 0x1fff
All protections.
.El
.Pp
Passing
.Fa flags Ns = Ns 0
enables all protections.
.Ss Operations
.Bl -tag -width CP_OP_AUTHORIZE
.It Dv CP_OP_SHIELD Pq 1
Shield the calling program with the specified flags.
Closing the capability fd removes protection.
.It Dv CP_OP_MINT Pq 2
Create an access token (returned as a reply fd).
Only available on an active shield instance.
.It Dv CP_OP_AUTHORIZE Pq 3
Called on a token fd.
Authorizes the calling program to interact with the shielded target
despite the shield.
.It Dv CP_OP_CAPMODE Pq 4
Enter Capsicum capability mode for the calling process.
.It Dv CP_OP_CHROOT Pq 5
Change the filesystem root.
The new root directory fd is attached to the message.
.El
.Ss Wire protocol
.Bd -literal
#include <mac_capability_capprotect_proto.h>

struct cp_request {
    uint32_t op;      /* CP_OP_* */
    uint32_t flags;   /* CP_SF_* bitmask for SHIELD, 0 for others */
};
.Ed
.Pp
The reply uses the standard
.Xr mac_capability 4
call reply mechanism: status in the reply buffer, or an empty reply
for success.
For
.Dv CP_OP_MINT ,
the reply fd carries the new access token.
.Ss MACF hooks gated
The following MAC framework hooks are gated by the shield:
.Xr ptrace 2 ,
signals (with special handling for SIGKILL and SIGCONT),
process visibility,
.Xr wait4 2 ,
process scheduling,
core dumps,
.Xr ktrace 1 ,
privilege checks,
.Xr fork 2 ,
IPC operations,
and fd receiving.
.Sh FILES
.Bl -tag -width indent
.It Pa /dev/mac_capability
The
.Xr mac_capability 4
device node used by
.Fn mac_capability_connect .
.El
.Sh DTRACE PROBES
The following DTrace probes are available under the
.Nm mac_capability_capprotect
provider:
.Bl -tag -width "state"
.It Li "deny(reason, target_nonce, accessor_nonce)"
Fires when a shield denies an operation from a foreign program.
.It Li "allow(reason, target_nonce, accessor_nonce)"
Fires when an operation is allowed (same nonce or valid token).
.It Li "state(operation, target, caller, flags, pid, error)"
Fires on a state change (shield, mint, or authorize).
.El
.Sh EXAMPLES
Shield a process from ptrace and signals:
.Bd -literal
int fd = mac_capability_connect("capprotect");
struct cp_request req = { .op = CP_OP_SHIELD,
    .flags = CP_SF_PTRACE | CP_SF_SIGNAL };
struct mac_capability_call_args ca = { .req = &req, .req_len = sizeof(req) };
ioctl(fd, MAC_CAPABILITY_CALL, &ca);
/* Protected until close(fd) */
.Ed
.Sh ERRORS
Operations may fail with the following errors:
.Bl -tag -width Er
.It Bq Er EINVAL
Invalid operation code, or invalid flags passed to
.Dv CP_OP_SHIELD .
.It Bq Er EALREADY
.Dv CP_OP_SHIELD
called on an fd that already has an active shield.
.It Bq Er ENOENT
.Dv CP_OP_MINT
or
.Dv CP_OP_AUTHORIZE
called without an active shield.
.It Bq Er ENOTCAPABLE
The capability fd lacks the required rights for the operation.
.El
.Sh SEE ALSO
.Xr ptrace 2 ,
.Xr mac 4 ,
.Xr mac_capability 4 ,
.Xr authorityd 8
.Sh HISTORY
The
.Nm
service first appeared in
5BSD.
