5BSD/5BSD/share/man/man4/mac_capability_system.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd June 5, 2026
.Dt MAC_CAPABILITY_SYSTEM 4
.Os
.Sh NAME
.Nm mac_capability_system
.Nd MAC_CAPABILITY system operation gating
.Sh SYNOPSIS
To load at boot:
.Bd -literal -offset indent
echo 'mac_capability_system_load="YES"' >> /boot/loader.conf
.Ed
.Pp
Wire protocol header:
.Bd -literal -offset indent
#include <dev/mac_capability/mac_capability_system_proto.h>
.Ed
.Sh DESCRIPTION
The
.Nm
service gates privileged system operations via MACF hooks.
Once an operation is claimed, all processes are denied except
those with the claimer's nonce or an authorized token.
Even root cannot bypass the MACF enforcement.
The only way through a claimed gate is to be the claim owner
(same nonce) or to hold an authorized token.
.Pp
Capability-mode callers fail closed for capability-enabled system
operations.
They must be the owner of a matching claim or possess authorization minted
by that owner; an unclaimed gate is not ambient authority in capability mode.
Callers outside capability mode retain the historical allow-by-default
behavior for unclaimed gates.
.Pp
Operations are claimed by bitmask.
Multiple operations can be claimed in a single call.
.Ss Gated Operations
Each gate corresponds to a bit in the
.Fa gates
field of
.Vt struct sys_request .
Gates are combined with bitwise OR.
.Bl -column "Dv SYS_GATE_KLDUNLOAD" "0x400" "kernel environment reading" -offset indent
.It Sy Constant Ta Sy Value Ta Sy Description
.It Dv SYS_GATE_KLDLOAD Ta 0x001 Ta kernel module loading
.It Dv SYS_GATE_KLDUNLOAD Ta 0x002 Ta kernel module unloading
.It Dv SYS_GATE_KLDSTAT Ta 0x004 Ta kernel module enumeration
.It Dv SYS_GATE_REBOOT Ta 0x008 Ta system reboot/halt/poweroff
.It Dv SYS_GATE_SWAPON Ta 0x010 Ta adding swap devices
.It Dv SYS_GATE_SWAPOFF Ta 0x020 Ta removing swap devices
.It Dv SYS_GATE_SYSCTL Ta 0x040 Ta security-relevant sysctl writes
.It Dv SYS_GATE_KENV Ta 0x080 Ta kernel environment modification (set/unset)
.It Dv SYS_GATE_ACCT Ta 0x100 Ta process accounting control
.It Dv SYS_GATE_AUDIT Ta 0x200 Ta auditon + auditctl
.It Dv SYS_GATE_KENV_READ Ta 0x400 Ta kernel environment reading (get/dump)
.It Dv SYS_GATE_ALL Ta 0x7ff Ta all gates
.El
.Pp
Claiming
.Dv SYS_GATE_REBOOT | SYS_GATE_KLDLOAD
gates only reboot and module loading; all other operations
remain unrestricted for callers outside capability mode.
.Ss Protocol
The service is accessed via
.Dv MAC_CAPABILITY_CALL
on an instance fd obtained from
.Dv MAC_CAPABILITY_CONNECT
with the service name
.Dq system .
.Pp
Requests use the following wire structure, defined in
.In dev/mac_capability/mac_capability_system_proto.h :
.Bd -literal -offset indent
struct sys_request {
	uint32_t	op;	/* SYS_OP_* */
	uint32_t	gates;	/* SYS_GATE_* bitmask */
} __packed;
.Ed
.Pp
The reply is a standard
.Xr mac_capability 4
call reply.
.Dv SYS_OP_MINT
returns a token fd as the reply fd.
.Pp
The operation codes are:
.Bl -tag -width "SYS_OP_AUTHORIZE"
.It Dv SYS_OP_CLAIM Pq 1
Claim the specified gates.
The caller's nonce becomes the owner.
.It Dv SYS_OP_RELEASE Pq 2
Release the claim.
Only the claim owner can release.
.It Dv SYS_OP_MINT Pq 3
Create an access token fd covering the specified gates,
which must be a subset of the currently claimed gates.
The token fd is returned as a reply fd.
Only the claim owner can mint tokens.
.It Dv SYS_OP_AUTHORIZE Pq 4
Called on a token fd.
Adds the caller's nonce to the authorized set.
Authorization persists while the token fd is open.
.El
.Ss Token Narrowing
.Dv SYS_OP_MINT
creates a token that covers only the gates specified in the
request, which must be a subset of the gates held by the claim owner.
The token recipient calls
.Dv SYS_OP_AUTHORIZE
to add their nonce to the authorized set for those gates.
This allows the claim owner to delegate a subset of privileges
without granting full access to all claimed gates.
.Sh DTRACE PROBES
The following DTrace probes are provided under the
.Nm mac_capability_system
provider:
.Bl -tag -width "state"
.It Cm deny Ns Pq Ar gate_name, owner_nonce, accessor_nonce
Fires when a gate check denies access.
.It Cm allow Ns Pq Ar gate_name, owner_nonce, accessor_nonce
Fires when a gate check allows access.
.It Cm state Ns Pq Ar operation, owner, accessor, gates, pid, error
Fires on state changes (claim, release, mint, authorize).
.El
.Pp
Example one-liner to trace denied operations:
.Bd -literal -offset indent
dtrace -n 'mac_capability_system::deny { printf("%s owner=%u accessor=%u",
    copyinstr(arg0), arg1, arg2); }'
.Ed
.Sh EXAMPLES
Claim the reboot gate and mint a narrowed token for a child process:
.Bd -literal -offset indent
#include <dev/mac_capability/mac_capability_system_proto.h>

int sysfd, tokfd;
struct sys_request req;

/* Connect to the system service */
sysfd = mac_capability_connect("system");

/* Claim the reboot gate */
req.op = SYS_OP_CLAIM;
req.gates = SYS_GATE_REBOOT;
mac_capability_call(sysfd, &req, sizeof(req), NULL, 0);

/* Mint a token covering only SYS_GATE_REBOOT */
req.op = SYS_OP_MINT;
req.gates = SYS_GATE_REBOOT;
tokfd = mac_capability_call(sysfd, &req, sizeof(req), NULL, 0);

/* Pass tokfd to child; child calls SYS_OP_AUTHORIZE on it */
.Ed
.Pp
Authorize on a received token fd:
.Bd -literal -offset indent
struct sys_request req;

req.op = SYS_OP_AUTHORIZE;
req.gates = 0;
mac_capability_call(tokfd, &req, sizeof(req), NULL, 0);
/* This process can now perform gated reboot operations */
.Ed
.Sh ERRORS
The service returns the following error codes in the
.Xr mac_capability 4
reply:
.Bl -tag -width "EACCES"
.It Bq Er EINVAL
Invalid gates bitmask or invalid operation code.
.It Bq Er EPERM
A non-owner attempted
.Dv SYS_OP_MINT
or
.Dv SYS_OP_RELEASE .
.It Bq Er EBUSY
The specified gates are already claimed by another nonce.
.It Bq Er EACCES
Gate check denied.
The caller's nonce is neither the claim owner nor authorized
via a token.
.El
.Sh SEE ALSO
.Xr kldload 2 ,
.Xr reboot 2 ,
.Xr sysctl 3 ,
.Xr mac_capability 4 ,
.Xr authorityd 8
.Sh HISTORY
.Nm
first appeared in 5BSD.
