5BSD/5BSD/share/man/man4/mac_capability_system.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd September 25, 2026
.Dt MAC_CAPABILITY_SYSTEM 4
.Os
.Sh NAME
.Nm mac_capability_system
.Nd MAC_CAPABILITY system operation gating
.Sh SYNOPSIS
The service is compiled into every 5BSD kernel as part of the mandatory
.Xr mac_capability 4
plane; it is not a loadable module and needs no
.Xr loader.conf 5
entry.
.Pp
Wire protocol header:
.Bd -literal -offset indent
#include <dev/mac_capability/mac_capability_system_proto.h>
.Ed
.Sh DESCRIPTION
The
.Nm
service gates privileged system operations via MACF hooks.
Once an operation is claimed, all processes are denied except
those with the claimer's nonce or an authorized token.
Even root cannot bypass the MACF enforcement.
The only way through a claimed gate is to be the claim owner
(same nonce) or to hold an authorized token.
.Pp
Capability-mode callers fail closed for capability-enabled system
operations.
They must be the owner of a matching claim or possess authorization minted
by that owner; an unclaimed gate is not ambient authority in capability mode.
Callers outside capability mode retain the historical allow-by-default
behavior for unclaimed gates, subject to the kernel's own
.Xr priv 9
checks.
.Pp
Operations are claimed by bitmask.
Multiple operations can be claimed in a single call.
A gate may be claimed by more than one nonce; a caller passes a gate check
if it owns any claim covering the gate, or holds an authorization from the
owner of any covering claim.
.Pp
In addition to the claim/mint/authorize protocol, the service offers
.Em perform
operations that execute a privileged primitive in kernel context on behalf
of a caller that actively holds the corresponding gate.
These exist for born-in-capability-mode brokers
.Po
.Xr BSDTime 8 ,
.Xr BSDSysctl 8 ,
.Xr BSDExtension 8 ,
.Xr BSDNamespace 8
.Pc
which cannot issue the ambient system call at all; the held gate replaces
the privilege check and capability mode is never loosened for the raw
system call.
.Ss Gated Operations
Each gate corresponds to a bit in the
.Fa gates
field of
.Vt struct sys_request .
Gates are combined with bitwise OR.
.Bl -column "Dv SYS_GATE_KLDUNLOAD" "0x1000" "kernel environment reading" -offset indent
.It Sy Constant Ta Sy Value Ta Sy Description
.It Dv SYS_GATE_KLDLOAD Ta 0x0001 Ta kernel module loading
.It Dv SYS_GATE_KLDUNLOAD Ta 0x0002 Ta kernel module unloading
.It Dv SYS_GATE_REBOOT Ta 0x0008 Ta system reboot/halt/poweroff
.It Dv SYS_GATE_SWAPON Ta 0x0010 Ta adding swap devices
.It Dv SYS_GATE_SWAPOFF Ta 0x0020 Ta removing swap devices
.It Dv SYS_GATE_SYSCTL Ta 0x0040 Ta privileged sysctl writes (optionally per-OID)
.It Dv SYS_GATE_KENV Ta 0x0080 Ta kernel environment modification (set/unset)
.It Dv SYS_GATE_ACCT Ta 0x0100 Ta process accounting control
.It Dv SYS_GATE_AUDIT Ta 0x0200 Ta auditon + auditctl
.It Dv SYS_GATE_KENV_READ Ta 0x0400 Ta kernel environment reading (get/dump)
.It Dv SYS_GATE_SETTIME Ta 0x0800 Ta clock step and slew (perform-only)
.It Dv SYS_GATE_JAIL Ta 0x1000 Ta jail creation and query (perform-only)
.It Dv SYS_GATE_ALL Ta 0x1ffb Ta all known gates
.El
.Pp
Bit 0x0004 formerly gated kernel module enumeration
.Pq Xr kldstat 2 , Xr kldfind 2 , Xr modfind 2 .
That gate is retired: enumeration is deliberately ungated because read-only
module queries are required by the DTrace toolchain.
The bit is excluded from
.Dv SYS_GATE_ALL ,
must not be reassigned, and a claim carrying it is rejected with
.Er EINVAL .
.Pp
The MACF hooks enforced for each gate are:
.Bl -column "Dv SYS_GATE_KLDUNLOAD" -offset indent
.It Sy Gate Ta Sy MACF hooks
.It Dv SYS_GATE_KLDLOAD Ta Fn mpo_kld_check_load
.It Dv SYS_GATE_KLDUNLOAD Ta Fn mpo_kld_check_unload
.It Dv SYS_GATE_REBOOT Ta Fn mpo_system_check_reboot
.It Dv SYS_GATE_SWAPON Ta Fn mpo_system_check_swapon
.It Dv SYS_GATE_SWAPOFF Ta Fn mpo_system_check_swapoff
.It Dv SYS_GATE_SYSCTL Ta Fn mpo_system_check_sysctl
.It Dv SYS_GATE_KENV Ta Fn mpo_kenv_check_set , Fn mpo_kenv_check_unset
.It Dv SYS_GATE_ACCT Ta Fn mpo_system_check_acct
.It Dv SYS_GATE_AUDIT Ta Fn mpo_system_check_auditon , Fn mpo_system_check_auditctl
.It Dv SYS_GATE_KENV_READ Ta Fn mpo_kenv_check_get , Fn mpo_kenv_check_dump
.El
.Pp
.Dv SYS_GATE_SETTIME
and
.Dv SYS_GATE_JAIL
install no MACF hook.
They authorize only the perform operations
.Dv SYS_OP_SETTIME ,
.Dv SYS_OP_ADJTIME ,
.Dv SYS_OP_JAIL_SET
and
.Dv SYS_OP_JAIL_GET
described below; the ambient
.Xr settimeofday 2 ,
.Xr adjtime 2
and
.Xr jail_set 2
system calls keep their ordinary privilege checks and remain refused in
capability mode.
.Pp
Claiming
.Dv SYS_GATE_REBOOT | SYS_GATE_KLDLOAD
gates only reboot and module loading; all other operations
remain unrestricted for callers outside capability mode.
.Ss Per-OID sysctl isolation
A
.Dv SYS_OP_CLAIM
whose gates include
.Dv SYS_GATE_SYSCTL
may append a
.Vt struct sys_sysctl_oidset
immediately after the fixed
.Vt struct sys_request .
The kernel detects the payload by the request length:
.Bl -tag -width "Scoped mode" -offset indent
.It Coarse mode
No payload: the SYSCTL gate isolates every privileged sysctl write.
.It Scoped mode
A payload of 1 to
.Dv SYS_SYSCTL_MAXOIDS
(64) MIB entries: only the listed OIDs are isolated; every other node stays
directly writable subject to the kernel's own
.Dv PRIV_SYSCTL_WRITE
check.
.El
.Pp
Each entry is a
.Vt struct sys_sysctl_oid
naming the node by its integer MIB with a depth of 1 to
.Dv SYS_OID_MAXDEPTH
.Pq Dv CTL_MAXNAME .
The request length must equal exactly
.Li sizeof(struct sys_request) + sizeof(uint32_t) + noids * sizeof(struct sys_sysctl_oid) ;
anything else is rejected with
.Er EINVAL .
A repeated
.Dv SYS_OP_CLAIM
with a payload unions the new OIDs into the owner's scoped set (converting a
coarse claim into a scoped one); a
.Dv SYS_OP_RELEASE
with a payload subtracts exactly those OIDs without releasing the claim.
Exceeding
.Dv SYS_SYSCTL_MAXOIDS
fails with
.Er ENOSPC .
.Ss Protocol
The service is accessed via
.Dv MAC_CAPABILITY_CALL
on an instance fd obtained from
.Dv MAC_CAPABILITY_CONNECT
with the service name
.Dq system .
The caller must carry a program nonce; an unlabeled caller receives
.Er ENXIO .
.Pp
Every request starts with the header defined in
.In dev/mac_capability/mac_capability_system_proto.h :
.Bd -literal -offset indent
struct sys_request {
	uint32_t	op;	/* SYS_OP_* */
	uint32_t	gates;	/* SYS_GATE_* bitmask */
} __packed;
.Ed
.Pp
The perform operations use larger request structures whose first member
aliases
.Fa op .
The reply is a standard
.Xr mac_capability 4
call reply.
.Dv SYS_OP_MINT
returns a token fd as the reply fd.
.Pp
The operation codes are:
.Bl -tag -width "SYS_OP_KLDUNLOAD"
.It Dv SYS_OP_CLAIM Pq 1
Claim the specified gates.
The caller's nonce becomes the owner.
.Fa gates
must be non-zero and a subset of
.Dv SYS_GATE_ALL .
Re-claiming on an already active instance is a no-op unless it adds gate bits
(which accumulate on the instance) or carries a sysctl OID payload.
.It Dv SYS_OP_RELEASE Pq 2
Release the claim held by this instance.
Only the claim owner can release.
With a sysctl OID payload, only the listed OIDs are removed from the scoped
set.
.It Dv SYS_OP_MINT Pq 3
Create an access token fd covering the specified gates,
which must be a subset of the gates held by this instance;
.Fa gates
of zero means all of them.
The token fd is returned as a reply fd.
Only the claim owner can mint tokens.
.It Dv SYS_OP_AUTHORIZE Pq 4
Called on a token fd.
Adds the caller's nonce to the authorized set for the token's gates.
Authorization persists while the token fd is open; a second call on an
already authorized token succeeds without effect.
The total number of outstanding authorizations is bounded by
.Va kern.mac_capability_system.max_auth .
.It Dv SYS_OP_SETTIME Pq 5
Perform a clock step.
Request is
.Vt struct sys_settime_request
.Pq Fa clockid , sec , nsec ;
only
.Dv CLOCK_REALTIME
is accepted.
Requires
.Dv SYS_GATE_SETTIME .
.It Dv SYS_OP_ADJTIME Pq 6
Perform a clock slew.
Request is
.Vt struct sys_adjtime_request
.Pq Fa delta_sec , delta_usec ;
the reply is a
.Vt struct sys_adjtime_reply
carrying the previously programmed adjustment.
Requires
.Dv SYS_GATE_SETTIME .
.It Dv SYS_OP_SYSCTL Pq 7
Perform a sysctl read and/or write in kernel context.
Request is
.Vt struct sys_sysctl_request
.Pq Fa depth , newlen , oldlen , mib[]
followed by
.Fa newlen
bytes of new value; the old value is returned in the reply buffer, which must
have at least
.Fa oldlen
bytes of capacity.
The node is accessed with
.Dv SCTL_GATED ,
which lifts the capability-mode node confinement and
.Dv PRIV_SYSCTL_WRITE
while keeping securelevel and the MAC hooks.
Requires an active
.Dv SYS_GATE_SYSCTL
hold; the isolate set of a scoped claim does not narrow which OIDs the holder
may perform on.
.It Dv SYS_OP_KLDLOAD Pq 8
Load a kernel module.
Request is
.Vt struct sys_kldload_request
.Pq Fa namelen
followed by the NUL-terminated module name (at most
.Dv SYS_KLD_NAME_MAX
bytes), resolved exactly as
.Xr kldload 2
would.
The reply is a
.Vt struct sys_kldload_reply
carrying the linker file id.
The lookup runs under a transient suspension of the caller's capability-mode
credential flag so that the module path can be resolved; securelevel still
applies.
Requires
.Dv SYS_GATE_KLDLOAD .
.It Dv SYS_OP_KLDUNLOAD Pq 9
Unload the module named by linker file id.
Request is
.Vt struct sys_kldunload_request
.Pq Fa fileid , flags ,
where
.Fa flags
is a
.Dv LINKER_UNLOAD_*
value.
Requires
.Dv SYS_GATE_KLDUNLOAD .
.It Dv SYS_OP_JAIL_SET Pq 10
Create or update a jail.
Request is
.Vt struct sys_jail_request
.Pq Fa jail_flags , nparams , buflen
followed by
.Fa nparams
packed
.Vt struct sys_jail_param
entries (name and value back to back), at most
.Dv SYS_JAIL_MAXPARAMS
(16) entries and
.Dv SYS_JAIL_MAXBUF
(4096) bytes.
.Fa jail_flags
may contain only
.Dv JAIL_CREATE ,
.Dv JAIL_UPDATE ,
.Dv JAIL_GET_DESC ,
.Dv JAIL_OWN_DESC
and
.Dv JAIL_DYING ;
.Dv JAIL_ATTACH
and the descriptor-input forms are refused.
A
.Dq desc
parameter with a 4-byte value receives the jail descriptor installed in the
caller's table.
The reply is a
.Vt struct sys_jail_reply
.Pq Fa jid , desc_fd ,
optionally followed by the packed parameter buffer when the reply capacity
allows.
Requires
.Dv SYS_GATE_JAIL .
.It Dv SYS_OP_JAIL_GET Pq 11
Query a jail by name or jid using the same request layout as
.Dv SYS_OP_JAIL_SET ;
output parameter values are written back into the returned parameter buffer
with their
.Fa value_len
updated.
Requires
.Dv SYS_GATE_JAIL .
.El
.Pp
The perform operations use a stricter authority test than the MACF hooks:
they succeed only when the caller owns, or is authorized (via a minted and
authorized token) against, a claim covering the gate.
An unclaimed gate, an unlabeled caller, and a labeled caller lacking the
claim are all denied with
.Er EPERM ,
root included.
.Ss Token Narrowing
.Dv SYS_OP_MINT
creates a token that covers only the gates specified in the
request, which must be a subset of the gates held by the claim owner.
The token recipient calls
.Dv SYS_OP_AUTHORIZE
to add their nonce to the authorized set for those gates.
This allows the claim owner to delegate a subset of privileges
without granting full access to all claimed gates.
Closing the token fd removes every authorization it granted; closing the
claiming instance fd releases the gates it referenced.
.Sh SYSCTL VARIABLES
.Bl -tag -width indent
.It Va kern.mac_capability_system.max_auth
Maximum number of outstanding authorization entries across all tokens
(0 = unlimited).
.Dv SYS_OP_AUTHORIZE
fails with
.Er ENOSPC
once the limit is reached.
.It Va kern.mac_capability_system.auth_count
Current number of authorization entries (read-only).
.El
.Sh DTRACE PROBES
The following DTrace probes are provided under the
.Nm mac_capability_system
provider:
.Bl -tag -width "state"
.It Cm deny Ns Pq Ar gate_name, owner_nonce, accessor_nonce
Fires when a gate check or perform operation denies access.
.It Cm allow Ns Pq Ar gate_name, owner_nonce, accessor_nonce
Fires when a gate check or perform operation allows access.
.It Cm state Ns Pq Ar operation, owner, accessor, gates, pid, error
Fires on state changes and perform operations.
.Ar operation
is one of
.Dq claim , claim-ref , claim-error , claim-remove ,
.Dq release , release-oids ,
.Dq token-mint , token-remove ,
.Dq authorize , authorize-dedup , authorize-nospc ,
.Dq settime , adjtime , sysctl , kldload , kldunload , jail
and their
.Dq -deny
variants.
.El
.Pp
Example one-liner to trace denied operations:
.Bd -literal -offset indent
dtrace -n 'mac_capability_system::deny { printf("%s owner=%u accessor=%u",
    copyinstr(arg0), arg1, arg2); }'
.Ed
.Sh EXAMPLES
Claim the reboot gate and mint a narrowed token for a child process:
.Bd -literal -offset indent
#include <dev/mac_capability/mac_capability_system_proto.h>

int sysfd, tokfd;
struct sys_request req;

/* Connect to the system service */
sysfd = mac_capability_connect("system");

/* Claim the reboot gate */
req.op = SYS_OP_CLAIM;
req.gates = SYS_GATE_REBOOT;
mac_capability_call(sysfd, &req, sizeof(req), NULL, 0);

/* Mint a token covering only SYS_GATE_REBOOT */
req.op = SYS_OP_MINT;
req.gates = SYS_GATE_REBOOT;
tokfd = mac_capability_call(sysfd, &req, sizeof(req), NULL, 0);

/* Pass tokfd to child; child calls SYS_OP_AUTHORIZE on it */
.Ed
.Pp
Authorize on a received token fd:
.Bd -literal -offset indent
struct sys_request req;

req.op = SYS_OP_AUTHORIZE;
req.gates = 0;
mac_capability_call(tokfd, &req, sizeof(req), NULL, 0);
/* This process can now perform gated reboot operations */
.Ed
.Pp
Step the clock from a capability-mode holder of an authorized
.Dv SYS_GATE_SETTIME
token:
.Bd -literal -offset indent
struct sys_settime_request sr = {
	.op = SYS_OP_SETTIME,
	.clockid = CLOCK_REALTIME,
	.sec = now.tv_sec,
	.nsec = now.tv_nsec,
};
mac_capability_call(tokfd, &sr, sizeof(sr), NULL, 0);
.Ed
.Sh ERRORS
The service returns the following error codes in the
.Xr mac_capability 4
reply:
.Bl -tag -width "EOPNOTSUPP"
.It Bq Er EINVAL
The request is shorter than its operation requires, the gates bitmask is zero
or contains unknown or retired bits, a sysctl OID payload is malformed or
accompanies a claim without
.Dv SYS_GATE_SYSCTL ,
.Dv SYS_OP_MINT
requested gates the instance does not hold or no reply descriptor slot was
supplied, a claim operation was issued on a token fd or
.Dv SYS_OP_AUTHORIZE
on a claim fd, or a perform request carries an out-of-range value
(clock id, nanoseconds, MIB depth, module name length, jail flags or
parameter layout).
.It Bq Er ENXIO
The caller has no program nonce.
.It Bq Er EPERM
A MACF gate check denied the caller, or a perform operation was issued
without an active hold on the gate.
.It Bq Er ENOSPC
The authorization limit
.Va kern.mac_capability_system.max_auth
or the per-claim isolated-OID limit was reached.
.It Bq Er EOPNOTSUPP
Unknown operation code.
.El
.Pp
Perform operations additionally return any error from the underlying
kernel primitive
.Po
.Xr settimeofday 2 ,
.Xr adjtime 2 ,
.Xr sysctl 3 ,
.Xr kldload 2 ,
.Xr kldunload 2 ,
.Xr jail_set 2 ,
.Xr jail_get 2
.Pc .
.Sh SEE ALSO
.Xr adjtime 2 ,
.Xr jail_set 2 ,
.Xr kldload 2 ,
.Xr reboot 2 ,
.Xr settimeofday 2 ,
.Xr sysctl 3 ,
.Xr mac_capability 4 ,
.Xr BSDExtension 8 ,
.Xr BSDNamespace 8 ,
.Xr BSDSysctl 8 ,
.Xr BSDTime 8 ,
.Xr capsule 8
.Sh HISTORY
.Nm
first appeared in 5BSD.
The module enumeration gate was retired and the
.Dv SYS_GATE_SETTIME
and
.Dv SYS_GATE_JAIL
gates with their perform operations were added in 5BSD 16.0.
