5BSD/5BSD/share/man/man4/mac_capability_isolation.4
.\"
.\" Copyright (c) 2026 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 24, 2026
.Dt MAC_CAPABILITY_ISOLATION 4
.Os
.Sh NAME
.Nm mac_capability_isolation
.Nd MAC_CAPABILITY resource isolation service
.Sh SYNOPSIS
.Cd "kldload mac_capability"
.Cd "kldload mac_capability_isolation"
.Pp
.In dev/mac_capability/mac_capability_isolation_proto.h
.Sh DESCRIPTION
The
.Nm
service provides file, network, vsock, and jail isolation by program nonce.
A process claims a resource (vnode, network endpoint, vsock endpoint, or jail)
via its
.Xr mac_capability 4
instance fd; the caller's nonce becomes the owner.
Processes with a foreign nonce are denied access to claimed resources
unless they hold an authorized token with an appropriate action mask.
.Pp
Claims are bound to the
.Xr mac_capability 4
instance fd.
When the instance fd is closed or revoked, all claims held by that
instance are released automatically.
.Pp
All operations use
.Dv MAC_CAPABILITY_CALL
(synchronous).
.Ss File Isolation
File isolation protects vnodes of any type: regular files, directories,
device nodes (character and block), FIFOs, and Unix domain sockets.
Claims are keyed by vnode identity (held via
.Fn vref ) ,
not by pathname or
.Vt dev_t .
.Pp
The following vnode operations are gated by MACF hooks when a vnode
is claimed:
.Bl -dash -compact
.It
open, exec (content access)
.It
unlink, link, rename (namespace mutation)
.It
chmod, chown, chflags, utimes, truncate (metadata mutation)
.It
stat, access, readlink (information disclosure)
.It
connect on AF_UNIX sockets (socket access)
.It
lookup on directories (gates access to entire subtree)
.El
.Pp
An already-open file descriptor may still be passed via
.Dv SCM_RIGHTS ;
only new vnode operations are gated.
.Pp
File operations:
.Bl -tag -width FI_OP_AUTHORIZE
.It Dv FI_OP_CLAIM No (1)
Claim isolation over a vnode.
The target is identified by passing an open fd in the request
.Pq Fa cm_nfds Ns = Ns 1 .
The caller's nonce becomes the owner.
Fails with
.Er EBUSY
if already claimed by a different nonce.
Re-claiming the same vnode from the same nonce transfers ownership
to the calling instance.
.It Dv FI_OP_RELEASE No (2)
Release a previously claimed vnode.
Only the owning nonce may release.
Pass any fd referring to the same vnode.
.It Dv FI_OP_QUERY No (3)
Query whether a vnode is currently claimed.
The caller must supply a valid
.Dv FI_FS_*
actions mask.
The reply
.Fa flags
field contains:
.Bl -tag -width FI_QF_AUTHORIZED -compact
.It Dv FI_QF_CLAIMED No (0x01)
Vnode is claimed by some nonce.
.It Dv FI_QF_MINE No (0x02)
Vnode is claimed by the caller's nonce.
.It Dv FI_QF_AUTHORIZED No (0x04)
Caller is authorized via token.
.El
.It Dv FI_OP_MINT No (10)
Create an access token for a vnode claim.
The caller must be the claim owner and must supply a valid
.Dv FI_FS_*
actions mask.
The token is returned as a reply fd.
.It Dv FI_OP_AUTHORIZE No (11)
Activate a token.
Called by the recipient on the token fd.
Adds the caller's nonce to the claim's authorized set.
Authorization persists while the token fd is open; closing the fd
revokes authorization.
.El
.Ss File action masks
The following action masks are used with
.Dv FI_OP_MINT
and
.Dv FI_OP_QUERY :
.Bl -column "FI_FS_UIPC_CONNECT" "0x2000" -offset indent
.It Dv FI_FS_LOOKUP Ta 0x0001 Ta directory traversal
.It Dv FI_FS_STAT Ta 0x0002 Ta stat, access
.It Dv FI_FS_READ Ta 0x0004 Ta read, readlink
.It Dv FI_FS_WRITE Ta 0x0008 Ta write
.It Dv FI_FS_APPEND Ta 0x0010 Ta append
.It Dv FI_FS_CREATE Ta 0x0020 Ta create
.It Dv FI_FS_DELETE Ta 0x0040 Ta unlink, rmdir
.It Dv FI_FS_RENAME_FROM Ta 0x0080 Ta rename source
.It Dv FI_FS_RENAME_TO Ta 0x0100 Ta rename destination
.It Dv FI_FS_LINK Ta 0x0200 Ta link
.It Dv FI_FS_EXEC Ta 0x0400 Ta exec
.It Dv FI_FS_SETATTR Ta 0x0800 Ta chmod, chown, chflags, utimes
.It Dv FI_FS_TRUNCATE Ta 0x1000 Ta truncate
.It Dv FI_FS_UIPC_CONNECT Ta 0x2000 Ta AF_UNIX connect
.It Dv FI_FS_ALL Ta 0x3fff Ta all of the above
.El
.Ss Network Isolation
Network isolation gates
.Xr bind 2
and
.Xr connect 2
by claiming network endpoints described as tuples of address family,
protocol, port range, CIDR address prefix, and direction.
.Pp
Network operations:
.Bl -tag -width FI_OP_RELEASE_NET
.It Dv FI_OP_CLAIM_NET No (4)
Claim a network endpoint.
No fd is needed; the endpoint is described in
.Vt struct fi_net_request .
Port ranges are specified in network byte order.
A full range of 0..65535 means any port.
Domain, protocol, and an all-zero address are wildcards.
Fails with
.Er EBUSY
if the endpoint overlaps an existing claim from a different nonce.
.It Dv FI_OP_RELEASE_NET No (5)
Release a network claim.
.It Dv FI_OP_QUERY_NET No (6)
Query whether a network endpoint is claimed.
.It Dv FI_OP_MINT_NET No (12)
Create a network access token.
The endpoint description in the request is embedded in the token.
.El
.Pp
Direction flags:
.Bl -column "FI_NET_CONNECT" "0x02" -offset indent
.It Dv FI_NET_BIND Ta 0x01 Ta gate Xr bind 2
.It Dv FI_NET_CONNECT Ta 0x02 Ta gate Xr connect 2
.It Dv FI_NET_ANY Ta 0x03 Ta both bind and connect
.El
.Pp
Listen is not separately enforced; bind is the gate.
Socket creation is enforced only for fully-wildcard (domain-wide) claims.
A token narrowed from such a claim permits creating an unconnected socket;
the narrowed endpoint is still enforced by
.Xr bind 2
and
.Xr connect 2 .
.Pp
IPv4 addresses are stored as v4-mapped IPv6.
CIDR prefix lengths for
.Dv AF_INET
are mapped to the v4-mapped region
.Pq e.g., IPv4 /24 becomes bit offset 96+24=120 .
A prefix of 0 with an all-zero address means any address.
.Ss Vsock Isolation
Vsock isolation gates
.Xr socket 2 ,
.Xr bind 2 ,
and
.Xr connect 2
for
.Dv AF_VSOCK .
Claims are owned by the caller's program nonce and are keyed by a VM context
identifier (CID), an inclusive 32-bit port range, and a bind/connect direction.
They apply to both stream and sequenced-packet sockets; socket type is
intentionally not part of the key, so claiming an endpoint reserves it across
both protocol types.
.Pp
For bind claims, CID and port describe the requested local endpoint.
For connect claims, they describe the destination endpoint.
.Dv VSOCK_CID_ANY
matches any CID.
Ports are in host byte order.
A wildcard-CID or
.Dv VSOCK_PORT_ANY
bind is treated as overlapping every matching exact claim, preventing an
ephemeral bind from bypassing ownership of a claimed port.
.Pp
Vsock operations:
.Bl -tag -width FI_OP_RELEASE_VSOCK
.It Dv FI_OP_CLAIM_VSOCK No (14)
Claim a CID, port range, and direction tuple described by
.Vt struct fi_vsock_request .
Fails with
.Er EBUSY
when it overlaps a claim owned by another nonce.
.It Dv FI_OP_RELEASE_VSOCK No (15)
Release an exactly matching claim owned by the caller's nonce.
.It Dv FI_OP_QUERY_VSOCK No (16)
Query claim ownership and token authorization.
.It Dv FI_OP_MINT_VSOCK No (17)
Mint an access token narrowed to a tuple covered by one of the caller's claims.
.El
.Pp
A fully wildcard claim
.Pq any CID, all ports, both directions
also gates creation of
.Dv AF_VSOCK
sockets.
As with other isolation claims, ownership is tied to the isolation instance fd,
not to a PID; closing or revoking the instance releases its claims.
.Pp
These endpoint claims govern the socket API.
The native host provider's privileged
.Dv VSOCK_IOC_TRANSPORT_ATTACH
operation is separately authorized by
.Dv PRIV_DRIVER
and serialized by guest CID in the vsock subsystem.
Access to the
.Pa /dev/vsock
device can additionally be constrained with a vnode claim; such a claim does
not replace the
.Dv PRIV_DRIVER
check.
Distinct provider CIDs may be active concurrently, while a duplicate CID is
rejected with
.Er EADDRINUSE .
.Ss Jail Isolation
Jail isolation gates jail operations by JID, name, or both.
.Pp
Jail operations:
.Bl -tag -width FI_OP_RELEASE_JAIL
.It Dv FI_OP_CLAIM_JAIL No (7)
Claim a jail.
At least one of JID or name must be specified.
A claim with both keys protects either identifier for the same jail.
.It Dv FI_OP_RELEASE_JAIL No (8)
Release a jail claim.
.It Dv FI_OP_QUERY_JAIL No (9)
Query whether a jail is claimed.
.It Dv FI_OP_MINT_JAIL No (13)
Create a jail access token with a
.Dv FI_JAIL_*
action mask.
.El
.Pp
Jail action masks:
.Bl -column "FI_JAIL_REMOVE" "0x10" -offset indent
.It Dv FI_JAIL_CREATE Ta 0x01 Ta create jail
.It Dv FI_JAIL_GET Ta 0x02 Ta get jail parameters
.It Dv FI_JAIL_SET Ta 0x04 Ta set jail parameters
.It Dv FI_JAIL_REMOVE Ta 0x08 Ta remove jail
.It Dv FI_JAIL_ATTACH Ta 0x10 Ta attach to jail
.It Dv FI_JAIL_ALL Ta 0x1f Ta all of the above
.El
.Pp
When a claim specifies both JID and name, requests must supply both keys
and both must match.
The exception is
.Dv FI_JAIL_CREATE
requests, which may omit the JID (since it is not allocated until after
creation succeeds); in that case, matching is by name alone.
.Ss Token Narrowing
Tokens minted by
.Dv FI_OP_MINT ,
.Dv FI_OP_MINT_NET ,
.Dv FI_OP_MINT_JAIL ,
and
.Dv FI_OP_MINT_VSOCK
carry a scope that limits the operations the token holder is authorized to
perform.
The scope is fixed at mint time and cannot be widened.
.Pp
For file tokens, authorization checks require that every bit in the
requested action mask is present in the token's
.Fa fa_fs_actions
field.
For jail tokens, the
.Fa actions
field in the
.Vt struct fi_jail_request
is checked similarly.
For network tokens, the direction, domain, protocol, port range, and
address prefix must all be covered by the token's endpoint description.
For vsock tokens, CID, port range, and direction must be covered.
A token narrowed from a domain-wide vsock claim likewise permits creating an
unconnected socket; the narrowed tuple is then enforced by
.Xr bind 2
and
.Xr connect 2 .
.Ss MACF Enforcement
The service registers MAC policy hooks for:
.Bl -dash -compact
.It
Vnode check operations: open, exec, unlink, link, rename, chmod, chown,
chflags, utimes, truncate, stat, access, readlink, lookup, connect
(AF_UNIX).
.It
Socket bind and connect.
.It
Jail create, get, set, remove, and attach.
.El
.Pp
For each hook, the enforcement logic is:
.Bl -enum -compact
.It
If no claim exists for the resource, allow (default-open).
.It
If the caller's nonce matches the claim owner, allow.
.It
If the caller holds an authorized token with a matching action mask,
allow.
.It
Otherwise, deny with
.Er EACCES .
.El
.Pp
A fast-path atomic counter avoids locking when no claims exist for a
resource type.
.Sh DTRACE PROBES
The following DTrace probes are available under the
.Nm mac_capability_isolation
provider:
.Bl -tag -width "token-narrow"
.It Li "deny(name, owner_nonce, caller_nonce)"
A vnode operation was denied because no claim matched the caller's nonce.
.It Li "deny-action(name, owner_nonce, caller_nonce, claim_id, actions)"
A vnode operation was denied; includes the claim ID and requested action mask.
.It Li "deny-net(owner_nonce, caller_nonce, claim_id, domain, proto|dir, port)"
A network operation was denied.
.It Li "deny-vsock(owner_nonce, caller_nonce, claim_id, cid, port, direction)"
A vsock socket creation, bind, or connect operation was denied.
.It Li "deny-jail(owner_nonce, caller_nonce, claim_id, jid, name, actions)"
A jail operation was denied.
.It Li "allow-action(name, owner_nonce, caller_nonce, claim_id, actions)"
A vnode operation was allowed (nonce match or valid token).
.It Li "allow-net(owner_nonce, caller_nonce, claim_id, domain, proto|dir, port)"
A network operation was allowed.
.It Li "allow-vsock(owner_nonce, caller_nonce, claim_id, cid, port, direction)"
A vsock operation was allowed by ownership or a matching token.
.It Li "allow-jail(owner_nonce, caller_nonce, claim_id, jid, name, actions)"
A jail operation was allowed.
.It Li "token-narrow(type, owner_nonce, claim_id, actions, 0)"
A token was minted with a narrowed action mask.
.It Li "query(type, caller_nonce, 0, 0, reply_flags)"
A query was performed; reply_flags contains
.Dv FI_QF_*
result.
.It Li "state(name, nonce, nonce, claim_id, op, errno)"
A state change occurred (claim, release, authorize).
.El
.Sh EXAMPLES
Claim a file and mint a read-only token:
.Bd -literal
int iso = mac_capability_connect("isolation");
int target = open("/data/secrets.db", O_RDONLY);

/* Claim the vnode */
struct fi_request req = { .op = FI_OP_CLAIM };
struct mac_capability_call_args ca = {
    .req = &req, .req_len = sizeof(req),
    .req_fds = &target, .req_nfds = 1
};
ioctl(iso, MAC_CAPABILITY_CALL, &ca);

/* Mint a read-only token */
int token_fd;
req = (struct fi_request){ .op = FI_OP_MINT,
    .actions = FI_FS_READ | FI_FS_STAT };
ca = (struct mac_capability_call_args){
    .req = &req, .req_len = sizeof(req),
    .req_fds = &target, .req_nfds = 1,
    .reply_fds = &token_fd, .reply_nfds = 1
};
ioctl(iso, MAC_CAPABILITY_CALL, &ca);
/* Pass token_fd to the worker process via SCM_RIGHTS */
.Ed
.Pp
Claim a network endpoint (TCP port 443, connect only, 10.0.0.0/8):
.Bd -literal
struct fi_net_request nr = {
    .op = FI_OP_CLAIM_NET,
    .domain = AF_INET,
    .protocol = IPPROTO_TCP,
    .port_min = htons(443),
    .port_max = htons(443),
    .direction = FI_NET_CONNECT,
    .prefix = 8,
};
/* Store 10.0.0.0 as v4-mapped IPv6 */
nr.addr[10] = 0xff; nr.addr[11] = 0xff;
nr.addr[12] = 10;
struct mac_capability_call_args ca = {
    .req = &nr, .req_len = sizeof(nr)
};
ioctl(iso, MAC_CAPABILITY_CALL, &ca);
.Ed
.Pp
Claim host access to a guest service on CID 14, port 7000:
.Bd -literal
struct fi_vsock_request vr = {
    .op = FI_OP_CLAIM_VSOCK,
    .cid = 14,
    .port_min = 7000,
    .port_max = 7000,
    .direction = FI_NET_CONNECT,
};
struct mac_capability_call_args ca = {
    .req = &vr, .req_len = sizeof(vr)
};
ioctl(iso, MAC_CAPABILITY_CALL, &ca);
.Ed
.Pp
Claim a jail by name and JID:
.Bd -literal
struct fi_jail_request jr = {
    .op = FI_OP_CLAIM_JAIL,
    .jid = 5,
    .actions = FI_JAIL_ALL,
};
strlcpy(jr.name, "authorityd.net", sizeof(jr.name));
struct mac_capability_call_args ca = {
    .req = &jr, .req_len = sizeof(jr)
};
ioctl(iso, MAC_CAPABILITY_CALL, &ca);
.Ed
.Sh ERRORS
Operations may fail with the following errors:
.Bl -tag -width Er
.It Bq Er EINVAL
Invalid operation code, zero actions mask where one is required,
or invalid request structure.
.It Bq Er EBUSY
.Dv FI_OP_CLAIM ,
.Dv FI_OP_CLAIM_NET ,
.Dv FI_OP_CLAIM_VSOCK ,
or
.Dv FI_OP_CLAIM_JAIL
attempted on a resource already claimed by a different nonce.
.It Bq Er EACCES
A MACF hook denied access because the caller's nonce does not match
the claim owner and no authorized token covers the requested action.
.It Bq Er EPERM
Release or mint attempted by a nonce that does not own the claim.
.It Bq Er ENOENT
Release, query, or mint attempted on a resource that is not claimed.
.El
.Sh WIRE PROTOCOL
.Bd -literal
struct fi_request {
    uint32_t op;       /* FI_OP_CLAIM, RELEASE, QUERY, MINT */
    uint32_t flags;    /* reserved, must be 0 */
    uint64_t actions;  /* FI_FS_* mask */
} __packed;

struct fi_reply {
    uint32_t flags;    /* FI_QF_* for QUERY; 0 otherwise */
    uint32_t _pad;
} __packed;

struct fi_net_request {
    uint32_t op;       /* FI_OP_CLAIM_NET, RELEASE_NET, etc. */
    uint32_t flags;    /* reserved, must be 0 */
    int32_t  domain;   /* AF_INET, AF_INET6, 0=any */
    int32_t  protocol; /* IPPROTO_TCP, IPPROTO_UDP, 0=any */
    uint16_t port_min; /* network byte order */
    uint16_t port_max; /* network byte order */
    uint8_t  direction;/* FI_NET_* bitmask */
    uint8_t  prefix;   /* CIDR prefix len, 0=exact/any */
    uint8_t  addr[16]; /* IPv6 or v4-mapped, all-zero=any */
} __packed;

struct fi_jail_request {
    uint32_t op;       /* FI_OP_CLAIM_JAIL, RELEASE_JAIL, etc. */
    uint32_t flags;    /* reserved, must be 0 */
    int32_t  jid;      /* host byte order; 0=not specified */
    uint32_t actions;  /* FI_JAIL_* mask */
    char     name[64]; /* NUL-terminated jail name */
} __packed;

struct fi_vsock_request {
    uint32_t op;       /* CLAIM_VSOCK, RELEASE_VSOCK, etc. */
    uint32_t flags;    /* reserved, must be 0 */
    uint64_t cid;      /* VSOCK_CID_ANY or a 32-bit CID */
    uint32_t port_min; /* host byte order */
    uint32_t port_max; /* host byte order */
    uint8_t  direction;/* FI_NET_* bitmask */
    uint8_t  _pad[3];
} __packed;
.Ed
.Sh SEE ALSO
.Xr mac 4 ,
.Xr mac_capability 4 ,
.Xr mac_capability_capprotect 4 ,
.Xr mac_capability_system 4 ,
.Xr authorityd 8
.Sh HISTORY
The
.Nm
service first appeared in 5BSD.
