5BSD/5BSD/share/man/man4/virtio_balloon.4
.\" Copyright (c) 2011 Bryan Venteicher
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 13, 2026
.Dt VIRTIO_BALLOON 4
.Os
.Sh NAME
.Nm virtio_balloon
.Nd VirtIO Memory Balloon driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device virtio_balloon"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
virtio_balloon_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for VirtIO memory balloon devices.
.Pp
The memory balloon allows the guest to, at the request of the
hypervisor, return memory allocated to the hypervisor so it can
be made available to other guests.
The hypervisor can later signal the balloon to return the memory.
.Pp
When the device negotiates the page-poison feature, pages returned to the
guest allocator on deflation are first initialized to the device-supplied
poison value, and the driver reports the poison value it uses to the device.
When the device negotiates the free-page-hint feature, the driver answers a
host-initiated reporting round by allocating a bounded sample of currently
free pages, reporting their physical ranges to the device, and immediately
returning them to the allocator; it reports a bounded sample rather than every
free page.
The continuous free-page reporting feature is deliberately not negotiated.
.Sh SYSCTL VARIABLES
The following read-only variables are available as
.Xr sysctl 8
variables, per attached device.
.Bl -tag -width indent
.It Va dev.vtballoon. Ns Ar X Ns Va .desired
The balloon size requested by the hypervisor, in 4096-byte units.
.It Va dev.vtballoon. Ns Ar X Ns Va .current
The current balloon size, in 4096-byte units.
.It Va dev.vtballoon. Ns Ar X Ns Va .poisoned
The number of pages initialized to the poison value after acknowledged
deflation, when the page-poison feature is negotiated.
.It Va dev.vtballoon. Ns Ar X Ns Va .free_page_hint_reported
The number of free pages reported in the last free-page-hint round, when the
free-page-hint feature is negotiated.
.El
.Sh SEE ALSO
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver was written by
.An Bryan Venteicher Aq Mt bryanv@FreeBSD.org .
It first appeared in
.Fx 9.0 .
