5BSD/5BSD/share/man/man4/virtio_pmem.4
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2026 Kory Heard
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 13, 2026
.Dt VIRTIO_PMEM 4
.Os
.Sh NAME
.Nm virtio_pmem
.Nd VirtIO persistent memory driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device nvdimm"
.Cd "device virtio_pmem"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
virtio_pmem_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for VirtIO persistent-memory (virtio-pmem)
devices, the modern-only VirtIO facility that exposes a host-backed byte
addressable persistent-memory region to the guest.
.Pp
The device advertises the region as a VirtIO shared-memory region.
The driver maps that region as a system-physical-address range through the
.Xr nvdimm 4
framework, which publishes it as a persistent-memory namespace with an
associated
.Xr geom 4
disk provider that can be partitioned and mounted like any other storage
device.
.Pp
Because the region is host-backed, stores are made durable by a device FLUSH
request rather than by processor cache-flush instructions: the driver issues a
FLUSH on the device's single request virtqueue and reports completion only
after the device acknowledges that the backing store has been persisted.
Both split and packed virtqueues are supported by the shared VirtIO transport
layer, and queue reset is negotiated.
.Sh SEE ALSO
.Xr geom 4 ,
.Xr nvdimm 4 ,
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 15.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Kory Heard .
