5BSD/5BSD/share/man/man4/virtio_scsi.4
.\" Copyright (c) 2012 Bryan Venteicher
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 13, 2026
.Dt VIRTIO_SCSI 4
.Os
.Sh NAME
.Nm virtio_scsi
.Nd VirtIO SCSI driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device virtio_scsi"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
virtio_scsi_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for VirtIO SCSI devices.
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width "xxxxxx"
.It Va hw.vtscsi.bus_reset_disable
In the initial QEMU release with VirtIO SCSI support, in-flight
operations were not aborted when stopping the device, rendering
bus reset ineffective.
This tunable disables attempts to issue reset bus commands.
The default value is 1.
.El
.Sh DEBUGGING
To enable debugging prints from the
.Nm
driver, set the
.Bd -literal -offset indent
hw.vtscsi.X.debug_level
.Ed
.Pp
variable, where X is the adapter number, either in
.Xr loader.conf 5
or via
.Xr sysctl 8 .
The following bits have the described effects:
.Bl -tag -width 6n -offset indent
.It 0x01
Enable informational prints.
.It 0x02
Enable prints for driver errors.
.It 0x04
Enable tracing prints.
.El
.Sh SYSCTL VARIABLES
The following per-device variables are available as
.Xr sysctl 8
variables.
.Bl -tag -width indent
.It Va dev.vtscsi. Ns Ar X Ns Va .num_queues
The number of active request virtqueues.
This is greater than one only when the device advertises multiple request
queues, in which case the driver spreads commands across up to one request
queue per CPU.
This variable is read-only.
.It Va dev.vtscsi. Ns Ar X Ns Va .debug_level
The debug level described in
.Sx DEBUGGING ;
this variable is read-write.
.It Va dev.vtscsi. Ns Ar X Ns Va .scsi_cmd_timeouts
The number of SCSI commands that have timed out.
This variable is read-only.
.It Va dev.vtscsi. Ns Ar X Ns Va .dequeue_no_requests
The number of times a request could not be dequeued because none were
available.
This variable is read-only.
.El
.Sh SEE ALSO
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver was written by
.An Bryan Venteicher Aq Mt bryanv@FreeBSD.org .
It first appeared in
.Fx 10.0 .
