5BSD/5BSD/share/man/man4/vsock.4
.\" Copyright (c) 2026 The FreeBSD Project
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 23, 2026
.Dt VSOCK 4
.Os
.Sh NAME
.Nm vsock
.Nd virtio socket communication
.Sh SYNOPSIS
.In sys/socket.h
.In sys/vsock.h
.Ft int
.Fn socket AF_VSOCK SOCK_STREAM 0
.Ft int
.Fn socket AF_VSOCK SOCK_SEQPACKET 0
.Sh DESCRIPTION
The
.Dv AF_VSOCK
socket domain provides host-guest communication via the virtio-vsock
transport, as defined in the OASIS Virtual I/O Device (VIRTIO) specification
version 1.4, section 5.10.
It enables socket-based communication between a virtual machine guest and its
hypervisor host without requiring a network stack.
.Ss Addressing
Connections are identified by (CID, port) tuples.
The CID (Context Identifier) is a 32-bit value unique to each virtual machine
(carried zero-extended to 64 bits in the on-wire
.Vt virtio_vsock_hdr ) :
.Bl -tag -width "VSOCK_CID_HYPERVISOR"
.It Dv VSOCK_CID_HYPERVISOR Po 0 Pc
Reserved for the hypervisor; not used for addressing.
.It Dv VSOCK_CID_LOCAL Po 1 Pc
Local
.Pq loopback
communication within the same host.
On a machine with no hypervisor transport this is also the default guest CID,
so loopback connections are always available.
A socket explicitly bound to this CID is loopback-only: it is reachable via
.Xr connect 2
to CID 1 but never from the hypervisor transport, and it keeps CID 1 across
transport attach and detach.
.It Dv VSOCK_CID_HOST Po 2 Pc
The hypervisor host.
.It Li 3+
Guest virtual machines; the CID is assigned by the hypervisor and may be
read from the virtio device configuration.
.It Dv VSOCK_CID_ANY Po 0xFFFFFFFF Pc
Wildcard value; when used in a
.Xr bind 2
call, binds to the local guest CID.
.El
.Pp
Ports are 32-bit unsigned integers.
.Dv VSOCK_PORT_ANY
.Pq 0xFFFFFFFF
requests automatic ephemeral port assignment.
As on Linux, port 0 is a literal
.Pq privileged
port number, not a request for automatic assignment.
Ports below 1024
.Pq including 0
are privileged and require the
.Dv PRIV_NETINET_RESERVEDPORT
privilege to bind, mirroring Linux
.Dv CAP_NET_BIND_SERVICE .
.Ss sockaddr_vm Structure
Socket addresses use the
.Vt sockaddr_vm
structure, defined in
.In sys/vsock.h :
.Bd -literal -offset indent
struct sockaddr_vm {
    uint8_t     svm_len;       /* total length */
    sa_family_t svm_family;    /* AF_VSOCK */
    uint16_t    svm_reserved1; /* must be zero */
    uint32_t    svm_port;      /* port number */
    uint32_t    svm_cid;       /* context identifier */
    uint8_t     svm_flags;     /* VMADDR_FLAG_TO_HOST */
    uint8_t     svm_zero[3];   /* pad to 16 bytes; must be zero */
};
.Ed
.Pp
.Va svm_flags
must contain only known flag bits
.Pq currently Dv VMADDR_FLAG_TO_HOST ,
which is accepted but has no effect on this single-transport implementation ,
and
.Va svm_zero
must be zero.
A
.Xr bind 2
or
.Xr connect 2
with an unknown
.Va svm_flags
bit or non-zero
.Va svm_zero
fails with
.Er EINVAL .
.Ss Socket Types
.Bl -tag -width "SOCK_SEQPACKET"
.It Dv SOCK_STREAM
Provides a reliable, ordered byte-stream connection, analogous to TCP.
.It Dv SOCK_SEQPACKET
Provides a reliable, ordered connection that preserves message record
boundaries.
Support for
.Dv SOCK_SEQPACKET
requires the host device to negotiate the
.Dv VIRTIO_VSOCK_F_SEQPACKET
feature bit.
.El
.Ss Socket Options
The following socket options are available at the
.Dv SOL_VSOCK
.Pq 287
or
.Dv AF_VSOCK
level via
.Xr getsockopt 2
and
.Xr setsockopt 2 .
The
.Dv AF_VSOCK
level is accepted for compatibility with code ported from Linux, which
applies these options at that level.
The buffer-size options take a
.Vt uint64_t
value; the connect-timeout options take a
.Vt struct timeval :
.Bl -tag -width "SO_VM_SOCKETS_BUFFER_MAX_SIZE"
.It Dv SO_VM_SOCKETS_BUFFER_SIZE Po 0 Pc
Get or set the current receive buffer size in bytes.
.It Dv SO_VM_SOCKETS_BUFFER_MIN_SIZE Po 1 Pc
Get or set the minimum receive buffer size in bytes.
.It Dv SO_VM_SOCKETS_BUFFER_MAX_SIZE Po 2 Pc
Get or set the maximum receive buffer size in bytes.
.It Dv SO_VM_SOCKETS_CONNECT_TIMEOUT Po 6 Pc
Get or set the connect timeout.
The value is a
.Vt struct timeval ,
matching Linux.
A value of zero uses the default 2-second timeout, matching Linux's
.Dv VSOCK_DEFAULT_CONNECT_TIMEOUT .
An option buffer smaller than
.Fn sizeof "struct timeval"
fails with
.Er EINVAL .
A structurally valid buffer holding an out-of-range
.Vt struct timeval
.Pq negative seconds or microseconds, or microseconds not less than 1000000
fails with
.Er ERANGE ,
matching Linux.
.It Dv SO_VM_SOCKETS_CONNECT_TIMEOUT_NEW Po 8 Pc
Identical to
.Dv SO_VM_SOCKETS_CONNECT_TIMEOUT ;
the value is a
.Vt struct timeval .
The separate option number exists only for source compatibility with Linux,
where it is the 64-bit-time variant.
.It Dv SO_VM_SOCKETS_PEER_HOST_VM_ID Po 3 Pc
Get the CID of the connected peer.
This option is read-only; a
.Xr setsockopt 2
attempt fails with
.Er EOPNOTSUPP ,
and a
.Xr getsockopt 2
on an unconnected socket fails with
.Er ENOTCONN .
.It Dv SO_VM_SOCKETS_TRUSTED Po 5 Pc , Dv SO_VM_SOCKETS_NONBLOCK_TXRX Po 7 Pc
Recognized for source compatibility with Linux but unsupported: these are
specific to the Linux VMCI transport and have no
.Nm
equivalent.
Both fail with
.Er EOPNOTSUPP .
.El
.Pp
The
.Dv MSG_OOB
flag is not supported;
.Nm
has no out-of-band data channel, so
.Xr send 2
with
.Dv MSG_OOB
fails with
.Er EOPNOTSUPP
rather than sending the data in band.
.Pp
The Linux
.Dv MSG_ZEROCOPY
send path and
.Dv SO_ZEROCOPY
socket option are not supported.
Standard data copies are used for all transfers.
.Ss Credit-Based Flow Control
The virtio-vsock transport uses credit-based flow control.
Each endpoint advertises its available receive buffer capacity to the peer.
A sender may only transmit data up to the peer's available credit.
Credit updates are exchanged automatically by the driver and are not
visible to the application.
.Ss Ioctls
The following
.Xr ioctl 2
requests are supported:
.Bl -tag -width ".Dv SIOCOUTQ"
.It Dv FIONREAD
Returns, as an
.Vt int ,
the number of bytes available to read from the socket
.Pq the Linux Dv SIOCINQ No equivalent .
.It Dv SIOCOUTQ
Returns, as an
.Vt int ,
the number of bytes sent to the peer but not yet acknowledged as consumed
.Pq in flight .
This mirrors Linux
.Dv SIOCOUTQ ,
but uses the native
.Fx
.Xr ioctl 2
encoding rather than the Linux numeric value, so ported code must use the
.Dv SIOCOUTQ
constant from
.In sys/vsock.h .
.It Dv IOCTL_VM_SOCKETS_GET_LOCAL_CID
Returns, as a
.Vt uint32_t ,
the local
.Pq guest
CID.
Accepted both on any
.Nm
socket and on the
.Pa /dev/vsock
character device, where Linux serves it.
As with
.Dv SIOCOUTQ ,
the native
.Fx
.Xr ioctl 2
encoding is used, so ported code must be recompiled against
.In sys/vsock.h .
.El
.Ss VMM Transport Provider
A privileged VMM can attach one remote guest to the host socket domain through
.Pa /dev/vsock .
After attachment, the host local CID is
.Dv VSOCK_CID_HOST
.Pq 2 ,
and host applications use ordinary
.Dv AF_VSOCK
sockets to listen for the guest or connect to its configured CID.
The character device exchanges one complete
.Vt virtio_vsock_hdr
and its payload per
.Xr read 2
or
.Xr write 2 .
The
.Dv VSOCK_IOC_TRANSPORT_ATTACH
and
.Dv VSOCK_IOC_TRANSPORT_SET_FEATURES
feature fields contain only
.Dv VIRTIO_VSOCK_F_*
device-specific bits.
Common VirtIO transport and ring bits, such as
.Dv VIRTIO_F_VERSION_1 ,
are outside this provider interface and are rejected with
.Er EINVAL .
The packet interface is reserved for VMM implementations; attaching it
requires the
.Dv PRIV_DRIVER
privilege.
When kernel auditing is enabled and the applicable audit class is selected,
provider control ioctls are recorded as standard
.Dv AUE_IOCTL
events.
Packet reads and writes and individual vsock connections do not have a
dedicated BSM audit event.
The
.Li provider-*
DTrace probes described below add the guest CID, feature, queue, and packet
metadata needed for vsock-specific operational auditing without exposing
payload contents.
Only one remote transport can be registered at a time.
An attachment therefore fails with
.Er EBUSY
when a VirtIO guest driver or another VMM transport is already active.
Closing the provider descriptor unregisters the transport and resets its live
connections.
The
.Xr bhyve 8
.Cm virtio-vsock
device selects this interface with
.Cm backend=kernel .
.Ss Tunable Parameters
The following
.Xr sysctl 8
variables control default parameters for the
.Dv AF_VSOCK
domain:
.Bl -tag -width "kern.vsock.seqpacket_frag_max"
.It Va kern.vsock.buf_default
Default buffer size in bytes for new sockets.
This is the initial value advertised to the peer for credit-based flow control.
Default: 262144 (256 KiB).
.It Va kern.vsock.buf_min
Minimum buffer size in bytes.
The
.Dv SO_VM_SOCKETS_BUFFER_SIZE
socket option will not set the buffer below this value.
Default: 128.
.It Va kern.vsock.buf_max
Maximum buffer size in bytes.
The
.Dv SO_VM_SOCKETS_BUFFER_SIZE
socket option will not set the buffer above this value.
Default: 262144 (256 KiB).
.It Va kern.vsock.seqpacket_frag_max
Maximum number of
.Dv SOCK_SEQPACKET
fragments that may be accumulated during reassembly of a single message.
If a peer sends more fragments than this limit without completing the message
.Pq setting the EOM flag ,
the connection is reset with
.Er EMSGSIZE .
A value of 0 disables the fragment count limit; reassembly is still bounded
by the per-connection buffer capacity
.Pq Va buf_alloc .
Default: 256.
.It Va kern.vsock.max_connections
Maximum number of simultaneously connected PCBs.
Inbound connection requests that would exceed this ceiling are refused with a
reset, providing a fleet-safe backstop against connection-table growth driven
by a malicious peer, independent of per-listener backlog limits.
Default: 16384.
.El
.Pp
Buffer size values affect new sockets only; existing sockets are not modified.
Per-socket tuning is available via the
.Dv SOL_VSOCK
socket options described above.
.Pp
The
.Va kern.vsock.pcblist
.Xr sysctl 8
variable exports the list of active vsock connections for use by
.Xr sockstat 1 .
.Pp
The following read-only
.Xr sysctl 8
counters report cumulative
.Nm
activity since the module was loaded:
.Bl -tag -width "kern.vsock.connections"
.It Va kern.vsock.tx_packets
Total packets sent.
.It Va kern.vsock.tx_bytes
Total payload bytes sent.
.It Va kern.vsock.rx_packets
Total packets received.
.It Va kern.vsock.rx_bytes
Total payload bytes received.
.It Va kern.vsock.rx_drops
Total received packets dropped.
.It Va kern.vsock.connections
Total connections established.
.El
.Pp
The read-only
.Va kern.vsock.cur_connections
.Xr sysctl 8
variable reports the current number of connected PCBs
.Pq a gauge, not a cumulative counter .
.Ss Guest CID Discovery
Applications can read the guest's CID via the
.Va kern.vsock.guest_cid
.Xr sysctl 8
variable, or via Linux's
.Dv IOCTL_VM_SOCKETS_GET_LOCAL_CID
ioctl on the
.Pa /dev/vsock
character device or on any
.Nm
socket.
.Ss DTrace Probes
The
.Nm
driver defines the following DTrace SDT probes under the
.Li vsock
provider:
.Bl -tag -width "credit-update-send" -compact
.It Li connect-request
Outbound connection request sent (args: CID, port, is_local).
.It Li connect-established
Connection established (args: CID, port, is_local).
.It Li connect-refused
Connection refused (args: CID, port).
.It Li connect-timeout
Connect attempt timed out (args: CID, port).
.It Li pkt-rx
Inbound packet received; metadata only, no payload
(args: op, src CID, src port, dst port, length, flags).
.It Li pkt-drop
Inbound packet rejected before delivery
(args: stable reason string, op, src CID, src port, dst port).
.It Li pkt-tx
Outbound packet sent; metadata only, no payload
(args: op, src CID, src port, dst port, length, flags).
Provided by
.Pa virtio_vsock.ko .
.It Li rst-received
Reset received from peer (args: CID, port, previous state, errno).
.It Li shutdown
Half-close observed
(args: CID, port, direction flags, is_send).
.It Li credit-update-recv
Credit update received from peer
(args: CID, port, peer_buf_alloc, peer_fwd_cnt).
.It Li send
Data sent by application (args: bytes, is_seqpacket).
.It Li receive
Data consumed by application (args: bytes, is_seqpacket).
.It Li credit-stall
Sender blocked waiting for peer credit (args: peer_buf_alloc, tx_cnt,
peer_fwd_cnt).
Provided by
.Pa virtio_vsock.ko ;
only present on a guest with the VirtIO transport loaded.
.It Li credit-update-send
Credit update sent to peer (args: buf_alloc, fwd_cnt, rx_bytes).
Provided by
.Pa virtio_vsock.ko ;
only present on a guest with the VirtIO transport loaded.
.It Li disconnect
Connection torn down (args: CID, port).
.It Li provider-attach
A privileged VMM transport attached
(args: guest CID, negotiated device features).
.It Li provider-detach
The VMM transport detached (arg: guest CID).
.It Li provider-reset
The VMM transport reset its guest-facing state (arg: guest CID).
.It Li provider-features
The VMM updated its negotiated device features
(args: guest CID, features).
.It Li provider-enqueue
The kernel queued a complete packet for the VMM to read
(args: operation, payload length, queue depth).
.It Li provider-dequeue
The VMM read a queued packet
(args: operation, payload length, remaining queue depth).
.It Li provider-inject
The VMM supplied a complete guest packet to the kernel
(args: operation, payload length).
.It Li provider-backpressure
The bounded VMM packet queue rejected an enqueue
(args: queue depth, is_control).
.It Li provider-reject
The
.Pa /dev/vsock
provider interface rejected an invalid packet
(args: packet length, errno).
.El
.Pp
The
.Li provider-*
probes are provided by
.Pa vsock.ko
and are active when
.Xr bhyve 8
uses
.Cm backend=kernel .
They expose packet metadata and resource state only, never payload contents.
The installed
.Pa /usr/share/dtrace/vsock-provider
script summarizes this provider path.
.Ss Differences from Linux
.Bl -bullet
.It
.Vt svm_cid
is a 32-bit field and is followed by an
.Vt svm_flags
byte
.Pq Dv VMADDR_FLAG_TO_HOST ,
matching Linux's field layout.
The only structural difference is the leading BSD
.Vt svm_len
byte (absent in Linux).
.It
.Dv AF_VSOCK
is
.Pq 46
here, versus 40 on Linux.
Code that uses the
.Dv AF_VSOCK
symbolic constant needs no change; code that hard-codes the numeric value
must be adjusted.
.It
The
.Dv SO_VM_SOCKETS_*
socket options are accepted at both the
.Dv SOL_VSOCK
and
.Dv AF_VSOCK
levels; Linux uses only
.Dv AF_VSOCK .
.It
.Dv MSG_ZEROCOPY
and
.Dv SO_ZEROCOPY
are not supported.
.It
.Dv SOCK_DGRAM
is not supported
.Pq Xr socket 2 returns Er EPROTOTYPE .
Datagram vsock is not part of the ratified virtio-vsock specification; Linux
implements it only on the VMCI transport, not over virtio.
.El
.Sh IMPLEMENTATION NOTES
The
.Dv AF_VSOCK
socket domain is split into two kernel modules:
.Bl -tag -width "virtio_vsock.ko"
.It Pa vsock.ko
The socket domain, protocol operations, and loopback transport.
This module provides
.Dv AF_VSOCK
sockets and local (same-host) communication.
It can be loaded on any machine, including bare metal.
.It Pa virtio_vsock.ko
The VirtIO PCI transport driver.
This module attaches to the virtio-vsock device presented by a hypervisor
and enables guest-to-host communication.
It depends on
.Pa vsock.ko .
.El
.Pp
When only
.Pa vsock.ko
is loaded (no virtio device), the guest CID defaults to
.Dv VSOCK_CID_LOCAL
.Pq 1
and only loopback connections are possible.
When
.Pa virtio_vsock.ko
attaches to a device, the CID is read from the hypervisor's device
configuration and remote connections become available.
.Pp
To load both modules at boot, add to
.Xr loader.conf 5 :
.Bd -literal -offset indent
vsock_load="YES"
virtio_vsock_load="YES"
.Ed
.Pp
Both modules are compiled into the
.Li GENERIC
kernel on amd64 and into
.Pa std.virt
on arm64 by default.
.Pp
The host-side device is emulated by
.Xr bhyve 8
using the virtio-vsock PCI device.
The
.Cm backend
option selects where the host-side vsock endpoints are implemented:
.Bl -tag -width "backend=userspace"
.It Cm backend=userspace
Use the
.Xr bhyve 8
userspace protocol engine and Unix sockets in the directory named by
.Cm path .
This is the default.
.It Cm backend=kernel
Pass complete VirtIO-vsock packets between the guest and the
.Pa /dev/vsock
kernel transport provider.
Host applications use ordinary
.Dv AF_VSOCK
sockets.
The
.Cm path
option is not accepted with this backend.
.El
.Pp
The corresponding
.Xr bhyve 8
.Fl s
options are:
.Bd -literal -offset indent
-s N,virtio-vsock,cid=<CID>,backend=userspace,path=<directory>
-s N,virtio-vsock,cid=<CID>,backend=kernel
.Ed
.Pp
where
.Ar CID
is the guest's context identifier, from 3 through 4294967294.
For the userspace backend,
.Ar directory
is a directory on the host for Unix sockets.
The directory must exist before
.Xr bhyve 8
starts.
Omitting
.Cm backend
selects
.Cm userspace ,
so existing configurations containing
.Cm path
continue to work.
.Pp
The kernel backend requires
.Pa vsock.ko
and exclusive ownership of the remote transport provider.
Only one kernel-backed virtual machine can be active at a time.
If another provider already owns the transport,
.Xr bhyve 8
fails device initialization.
.Pp
The PCI transport defaults to the legacy-compatible interface used by earlier
.Xr bhyve 8
versions.
Modern VirtIO PCI transport is an explicit opt-in:
.Bd -literal -offset indent
-s 5,virtio-vsock,cid=3,backend=userspace,path=/var/run/vm1,transport=modern
-s 5,virtio-vsock,cid=3,backend=kernel,transport=modern
.Ed
.Pp
The accepted values are
.Cm transport=legacy
and
.Cm transport=modern .
The modern form presents a non-transitional VirtIO device with PCI device ID
0x1053, revision 1, 64-bit feature negotiation, capability-based memory BARs,
and separately addressed virtqueues.
Omitting
.Cm transport
retains the legacy device identity and I/O BAR, so existing command lines and
guests continue to behave as before.
.Ss Userspace Backend: Guest-to-Host Connections
When a guest application connects to
.Dv VSOCK_CID_HOST
on port
.Ar N ,
.Xr bhyve 8
connects to a Unix socket named
.Ar N
inside the directory (e.g.,
.Pa /var/run/vm1/80
for port 80).
The socket type matches the guest connection:
.Dv SOCK_STREAM
or
.Dv SOCK_SEQPACKET .
Message boundaries are preserved for
.Dv SOCK_SEQPACKET .
If no listener exists, the guest receives
.Er ECONNRESET
(the device replies with
.Dv VIRTIO_VSOCK_OP_RST ,
which the guest reports as
.Er ECONNRESET ,
matching Linux).
.Pp
To expose a host service on port 80:
.Bd -literal -offset indent
mkdir /var/run/vm1
socat UNIX-LISTEN:/var/run/vm1/80,fork EXEC:myservice
bhyve -s 5,virtio-vsock,cid=3,backend=userspace,path=/var/run/vm1 ...
.Ed
.Ss Userspace Backend: Host-to-Guest Connections
A host application connects to
.Pa <directory>/sock
and sends a 16-byte control message:
.Bd -literal -offset indent
struct vsock_ctl_msg {
    uint32_t cmd;    /* 1 = connect */
    uint32_t port;   /* guest port */
    uint32_t type;   /* SOCK_STREAM or SOCK_SEQPACKET */
    int32_t  status; /* unused in request */
};
.Ed
.Pp
The fields use the host's native byte order and the native socket type values.
The control socket is a byte stream, and
.Xr bhyve 8
accepts the request split across multiple writes.
Any socket type other than
.Dv SOCK_STREAM
or
.Dv SOCK_SEQPACKET
is rejected with
.Er ESOCKTNOSUPPORT .
.Pp
.Xr bhyve 8
replies with the same struct
.Po Va status
= 0 on success, negative errno on failure
.Pc
and passes a connected data socket via
.Dv SCM_RIGHTS .
The host application uses the received fd for data transfer.
.Pp
This design is compatible with
.Xr capsicum 4
capability mode.
The
.Xr bhyve 8
.Li vsock
USDT provider reports connection lifecycle, credit stalls, bounded-resource
overflows, and rejected guest descriptors for this backend.
The installed
.Pa /usr/share/dtrace/vsock-overview ,
.Pa vsock-perf ,
and
.Pa vsock-security
scripts consume these probes without logging payload contents.
.Ss Kernel Backend
With
.Cm backend=kernel ,
.Xr bhyve 8
registers as the remote transport provider for
.Pa /dev/vsock
and forwards complete VirtIO-vsock packets between that provider and the
guest's virtqueues.
The guest observes the configured
.Ar CID ;
the host endpoint is
.Dv VSOCK_CID_HOST
.Pq 2 .
.Pp
Host applications use the normal socket API described above.
For guest-to-host service, a host process creates an
.Dv AF_VSOCK
socket and listens on a local port.
For host-to-guest service, it connects an
.Dv AF_VSOCK
socket to the configured guest CID and port.
Both
.Dv SOCK_STREAM
and
.Dv SOCK_SEQPACKET
are supported.
There is no Unix socket directory, control message, or
.Dv SCM_RIGHTS
handoff in this mode.
.Pp
The
.Pa /dev/vsock
transport-provider interface is used by
.Xr bhyve 8 ;
it is not the application data interface.
Applications continue to use
.Xr socket 2 ,
.Xr bind 2 ,
.Xr listen 2 ,
and
.Xr connect 2 .
Closing the virtual machine unregisters the provider and releases exclusive
ownership for a subsequent provider.
.Pp
See
.Xr bhyve_config 5
for further configuration details.
.Sh ERRORS
In addition to the standard errors returned by
.Xr socket 2 ,
.Xr bind 2 ,
.Xr connect 2 ,
and related calls, the following errors are specific to the
.Dv AF_VSOCK
domain:
.Bl -tag -width Er
.It Bq Er EPROTOTYPE
A socket type other than
.Dv SOCK_STREAM
or
.Dv SOCK_SEQPACKET
.Pq for example Dv SOCK_DGRAM
was requested; this matches the
.Sx Differences from Linux
note above.
.Pq Er EPROTONOSUPPORT No or Er ESOCKTNOSUPPORT No may also be returned .
.It Bq Er EINVAL
An attempt was made to
.Xr bind 2
to the reserved hypervisor CID
.Pq Dv VMADDR_CID_HYPERVISOR , No 0 ,
or a
.Vt sockaddr_vm
was supplied with a non-zero reserved field, an unknown
.Va svm_flags
bit, or non-zero
.Va svm_zero
padding.
.It Bq Er EADDRNOTAVAIL
An attempt was made to
.Xr bind 2
to the host CID
.Pq Dv VMADDR_CID_HOST , No 2 ,
which names the host side and can never be a local guest endpoint.
.It Bq Er EAFNOSUPPORT
An attempt was made to bind to some other CID that is neither the local guest
CID nor
.Dv VSOCK_CID_ANY .
.It Bq Er EACCES
A privileged process restriction was violated when binding to a port below
1024; see
.Xr bind 2 .
Binding to a reserved port requires the
.Dv PRIV_NETINET_RESERVEDPORT
privilege, matching the Linux
.Dv CAP_NET_BIND_SERVICE
requirement.
.Er EPERM
may also be returned.
.It Bq Er ENXIO
A remote connection was attempted but no virtio-vsock transport is
registered.
Load
.Pa virtio_vsock.ko
inside a virtual machine with a vsock device attached.
.It Bq Er ETIMEDOUT
The connection attempt timed out before the peer responded.
.It Bq Er ECONNRESET
Returned by
.Xr connect 2
when a connection is refused, whether no listener exists on the target CID and
port or the listener's backlog is full.
This matches Linux vsock, which refuses connections by reset on every transport
\(em loopback and remote alike \(em and therefore reports refusal as
.Er ECONNRESET ,
not the POSIX
.Er ECONNREFUSED .
.Er ECONNRESET
is also returned on an established connection when the peer violates flow
control or the transport is reset.
Note that a plain
.Dv VIRTIO_VSOCK_OP_RST
on an established connection is instead delivered as end-of-file to the reader
and
.Er EPIPE
to the writer, again matching Linux.
.El
.Sh SEE ALSO
.Xr dtrace 1 ,
.Xr sockstat 1 ,
.Xr accept 2 ,
.Xr bind 2 ,
.Xr connect 2 ,
.Xr listen 2 ,
.Xr socket 2 ,
.Xr capsicum 4 ,
.Xr virtio 4 ,
.Xr bhyve_config 5 ,
.Xr bhyve 8
.Sh STANDARDS
.Rs
.%A OASIS
.%T Virtual I/O Device (VIRTIO) Version 1.4
.%O Section 5.10: Socket Device
.Re
.Sh HISTORY
The
.Nm
socket domain first appeared in
.Fx 16.0 .
.Sh AUTHORS
The
.Nm
socket domain was written by the
.An FreeBSD Project .
