5BSD/5BSD/usr.sbin/authorityd/authorityd.conf.5
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 19, 2026
.Dt AUTHORITYD.CONF 5
.Os
.Sh NAME
.Nm authorityd.conf
.Nd configuration file for the Authorityd authority daemon
.Sh DESCRIPTION
The
.Nm
file configures the
.Xr authorityd 8
daemon.
It uses
UCL format.
The default location is
.Pa /etc/authorityd.conf .
.Pp
If the configuration file does not exist,
compiled-in defaults are used.
Syntax errors in the configuration file are fatal and cause
.Xr authorityd 8
to exit.
Unknown keys are silently ignored.
.Ss General
The following top-level keys are recognized:
.Bl -tag -width "control_socket_mode"
.It Va pidfile
Path to the pidfile.
Default:
.Pa /var/run/authorityd.pid .
.It Va control_socket
Path to the control socket.
Default:
.Pa /var/run/authorityd.sock .
.It Va control_socket_mode
Quoted octal file mode for the control socket.
Default:
.Dq 0700 .
.It Va service_manager
Path to the first managed process started by
.Xr authorityd 8 .
Default:
.Pa /usr/libexec/serviced .
If set to an empty string, no service manager is started.
May be overridden with
.Xr authorityd 8 Ns 's
.Fl b
option.
.El
.Ss Integrity
The
.Va integrity
section is an object whose keys are booleans controlling
.Xr mac_capability_capprotect 4
shield flags that protect the
.Xr authorityd 8
process from external interference.
.Bl -tag -width "visible"
.It Va ptrace
Block ptrace attach from foreign nonces.
Maps to
.Dv CP_SF_PTRACE .
Default: true.
.It Va signal
Block all signals except
.Dv SIGKILL
and
.Dv SIGCONT
from foreign nonces.
Maps to
.Dv CP_SF_SIGNAL .
Always enabled and cannot be disabled by configuration.
.It Va sigkill
Block
.Dv SIGKILL
from foreign nonces.
Maps to
.Dv CP_SF_SIGKILL .
Always enabled and cannot be disabled by configuration.
.It Va sigcont
Block
.Dv SIGCONT
from foreign nonces.
Maps to
.Dv CP_SF_SIGCONT .
Always enabled and cannot be disabled by configuration.
.It Va visible
Hide
.Xr authorityd 8
from
.Xr ps 1 ,
.Xr top 1 ,
and procfs enumeration.
Maps to
.Dv CP_SF_VISIBLE .
Default: false.
.It Va wait
Block
.Xr wait4 2
from non-parent processes.
Maps to
.Dv CP_SF_WAIT .
Default: true.
.It Va sched
Block scheduler priority and CPU affinity manipulation.
Maps to
.Dv CP_SF_SCHED .
Default: true.
.It Va core
Suppress core dumps to prevent leaking secrets from process memory.
Maps to
.Dv CP_SF_CORE .
Default: false.
.It Va ktrace
Block passive syscall tracing via
.Xr ktrace 1 .
Maps to
.Dv CP_SF_KTRACE .
Default: true.
.El
.Pp
Together,
.Va signal ,
.Va sigkill ,
and
.Va sigcont
deny every foreign-nonce ambient PID-based signal, including signal 0.
.Xr service 8
uses the root-only control socket for status, reload, and graceful shutdown.
Forced termination is deliberately reserved for a supervisor holding an
.Xr pdfork 2
process descriptor; signaling through
.Xr pdkill 2
does not depend on ambient PID authority.
.Ss Claims
The
.Va claims
section lists resources to be claimed exclusively by
.Xr authorityd 8
at boot via the
.Xr mac_capability_isolation 4
service.
Once claimed, MACF hooks deny access from all other processes,
including root.
.Pa /dev/mac_capability
is always claimed automatically regardless of configuration.
.Pp
Claims declared here are
.Em policy claims
.Pq Dv CLAIM_SOURCE_POLICY .
They are acquired at boot, survive
.Xr serviced 8
restarts, and cannot be released via the channel.
.Pp
Resources requested by services but not listed here are auto-claimed
dynamically at runtime with reference counting.
These
.Em dynamic claims
are released from the kernel when no service needs them.
.Xr authorityctl 8
.Cm status
shows
.Ql [policy]
for manifest claims and
.Ql [service, refcount=N]
for dynamic claims.
.Pp
Claim limits: at most 64 paths, 32 network claims, and 32 jail claims.
.Bl -tag -width "network"
.It Va paths
Array of absolute paths to files or directories to claim.
Claiming a file blocks open, stat, chmod, chown, and other
vnode operations.
Claiming a directory blocks lookup into the subtree,
preventing access to all files within.
Paths on network filesystems (NFS, FUSE) may block at boot if the
server is unreachable; to protect a network mount point, claim the
parent directory instead.
Default: empty.
.It Va network
Array of network endpoint objects to claim.
Each object supports the following keys:
.Bl -tag -width "direction"
.It Va port Pq or Va ports
Port number, range, or wildcard.
May be an integer, a range string
.Pq e.g., Dq 80-8000 ,
.Dq *
for all ports (0\(en65535), or
.Dq .\&<1024
for privileged ports (0\(en1023).
Optional; default is all ports (0\(en65535).
.Va ports
is accepted as an alias for
.Va port .
.It Va protocol
.Dq tcp ,
.Dq udp ,
the Bluetooth socket protocols
.Dq l2cap ,
.Dq rfcomm ,
.Dq sco ,
.Dq iso ,
.Dq hci ,
.Dq any ,
or
.Dq * .
Default:
.Dq tcp .
.It Va direction
.Dq bind ,
.Dq connect ,
.Dq any ,
or
.Dq * .
Default:
.Dq bind .
.It Va domain
.Dq inet ,
.Dq inet6 ,
.Dq bluetooth ,
.Dq any ,
or
.Dq * .
Default:
.Dq inet .
A
.Dq bluetooth
claim reserves the
.Dv AF_BLUETOOTH
socket family; a fully-wildcard bluetooth claim
.Pq protocol, address, and direction all
.Dq any
reserves the entire radio to the claiming nonce, so that every other
process is denied at
.Xr socket 2
create time across HCI, L2CAP, RFCOMM, SCO, and ISO.
.It Va address
For
.Dq inet
and
.Dq inet6 ,
an IP address or CIDR prefix.
An IPv4 or IPv6 address without a prefix length matches a single host.
CIDR notation
.Pq e.g., Dq 192.0.2.0/24 No or Dq 2001:db8::/32
matches a network.
For
.Dq bluetooth ,
a device address of the form
.Dq aa:bb:cc:dd:ee:ff
matches a single peer.
.Dq *
matches any address.
Optional; if omitted, any address is matched.
.El
.Pp
Foreign nonces receive
.Er EACCES
on bind or connect to claimed endpoints.
Default: empty.
.It Va jails
Array of jail claims.
Each element may be:
.Bl -dash -compact
.It
An integer jail ID (all actions are claimed).
.It
A string jail name (all actions are claimed).
.It
An object with the following keys:
.Bl -tag -width "actions" -compact
.It Va jid
Integer jail ID.
0 or omitted means not specified.
.It Va name
String jail name.
Empty or omitted means not specified.
.It Va actions
.Dq *
or
.Dq all
for all actions, or an array of:
.Dq create ,
.Dq get ,
.Dq set ,
.Dq remove ,
.Dq attach .
.It Va path
Allowed root path prefix for jail creation.
Optional.
.El
.El
.Pp
Default: empty.
.It Va system
Array of system gate names to claim via the
.Xr mac_capability_system 4
service.
Once claimed, the gated operation is denied to all processes
unless they hold an authorized token from
.Xr authorityd 8 .
Available gate names:
.Dq kldload ,
.Dq kldunload ,
.Dq kldstat ,
.Dq reboot ,
.Dq swapon ,
.Dq swapoff ,
.Dq sysctl ,
.Dq kenv ,
.Dq kenv_read ,
.Dq acct ,
.Dq audit .
Default: empty.
.El
.Sh EXAMPLES
Minimal configuration relying on compiled-in defaults:
.Bd -literal -offset indent
pidfile = "/var/run/authorityd.pid";
control_socket = "/var/run/authorityd.sock";
service_manager = "/usr/libexec/serviced";
.Ed
.Pp
Full integrity hardening.
Note that enabling
.Va signal
prevents
.Xr rc 8
from sending signals to
.Xr authorityd 8 :
.Bd -literal -offset indent
integrity {
    ptrace = true;
    signal = true;
    visible = true;
    wait = true;
    sched = true;
    core = true;
    ktrace = true;
}
.Ed
.Pp
Claim sensitive files, a privileged port range on a specific subnet,
jail resources, and system operations:
.Bd -literal -offset indent
claims {
    paths = [
        "/dev/mem",
        "/dev/kmem",
        "/boot/kernel",
    ];
    network = [
        {
            port = ".<1024";
            protocol = "tcp";
            direction = "bind";
            domain = "inet";
            address = "192.0.2.0/24";
        },
        {
            port = 8443;
            protocol = "tcp";
            direction = "bind";
            domain = "inet6";
            address = "2001:db8::/32";
        },
    ];
    jails = [
        "webjail",
        {
            name = "dbjail";
            actions = ["create", "attach"];
            path = "/usr/local/jails/dbjail";
        },
    ];
    system = ["kldload", "kldunload", "reboot", "sysctl"];
}
.Ed
.Sh SEE ALSO
.Xr mac_capability 4 ,
.Xr mac_capability_capprotect 4 ,
.Xr mac_capability_isolation 4 ,
.Xr mac_capability_system 4 ,
.Xr authorityd 8 ,
.Xr authorityctl 8 ,
.Xr serviced 8
